package main.topicTickets.caption;

public class BusCaption {
    public final String FTP1 = "https://imgur.com/EK9Dhpr";
    public final String FTP2 = "https://imgur.com/ptDQzmr";
    public final String FTP3 = "https://imgur.com/FqaX8NP";
    public final String FTP4 = "https://imgur.com/jCQh1aI";
    public final String FTP5 = "https://imgur.com/SVZdij6";

    public final String FTC1 = "Правая полоса предназначена для движения:\n" +
            "1. " +
            "Любых автобусов\n" +
            "2. " +
            "Всех автобусов и троллейбусов\n" +
            "3. " +
            "Автобусов и троллейбусов, движущихся по установленным маршрутам с обозначенными местами остановок," +
            " а также школьных автобусов и легковых такси";
    public final String FTC1Help = "Правая полоса предназначена для движения:\n" +
            "1. " +
            "Любых автобусов\n" +
            "2. " +
            "Всех автобусов и троллейбусов\n" +
            "3. " +
            "Автобусов и троллейбусов, движущихся по установленным маршрутам с обозначенными местами остановок, а также школьных автобусов " +
            "и легковых такси\n\n" +
            "Правильный ответ: 3\n" +
            "По крайней правой полосе, обозначенной разметкой 1.23.1 (в виде буквы «А») и знаком 5.14 «Полоса для маршрутных транспортных средств» " +
            "из перечисленных в ответах Т.С. имеют право на движение автобусы и троллейбусы, движущиеся по установленным" +
            " маршрутам с обозначенными местами остановок, относящиеся к маршрутным транспортным средствам, а также школьные автобусы и легковые такси.";
    public final String FTC2 = "Разрешается ли Вам на легковом автомобиле перестроиться вправо, чтобы продолжить движение в прямом направлении?\n" +
            "1. " +
            "Разрешается, если не создадите помех движению маршрутных транспортных средств\n" +
            "2. " +
            "Разрешается, если Вы управляете легковым такси\n" +
            "3. " +
            "Запрещается";
    public final String FTC2Help = "Разрешается ли Вам на легковом автомобиле перестроиться вправо, чтобы продолжить движение в прямом направлении?\n" +
            "1. " +
            "Разрешается, если не создадите помех движению маршрутных транспортных средств\n" +
            "2. " +
            "Разрешается, если Вы управляете легковым такси\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 2\n" +
            "Согласно знаку 5.14 «Полоса для маршрутных транспортных средств» и разметки 1.23.1 (в виде буквы «А») правая" +
            " полоса принадлежит маршрутным транспортным средствам и ТС, " +
            "используемым в качестве легкового такси, а также велосипедистам и «школьным автобусам». Движение и остановка" +
            " других транспортных средств на этой полосе запрещается.";
    public final String FTC3 = "Обязаны ли Вы уступить дорогу маршрутному транспортному средству, отъезжающему от тротуара, где нет обозначенного места остановки ?\n" +
            "1. " +
            "Обязаны\n" +
            "2. " +
            "Не обязаны, если Вы управляете легковым такси\n" +
            "3. " +
            "Не обязаны";
    public final String FTC3Help = "Обязаны ли Вы уступить дорогу маршрутному транспортному средству, отъезжающему от тротуара, где нет обозначенного места остановки ?\n" +
            "1. " +
            "Обязаны\n" +
            "2. " +
            "Не обязаны, если Вы управляете легковым такси\n" +
            "3. " +
            "Не обязаны\n\n" +
            "Правильный ответ: 3\n" +
            "Маршрутным транспортным средствам приоритет предоставляется только в начале движения от обозначенных для них остановок," +
            " в населённых пунктах, " +
            "обозначенных знаками «начало населённого пункта» с белым фоном. В других местах этой «льготой» они не пользуются ни " +
            "при каких обстоятельствах. (Пункт 18.3 ПДД)";
    public final String FTC4 = "Кто из водителей должен уступить дорогу трамваю?\n" +
            "1. " +
            "Оба\n" +
            "2. " +
            "Только водитель грузового автомобиля\n" +
            "3. " +
            "Только водитель легкового автомобиля\n" +
            "4. " +
            "Никто из водителей";
    public final String FTC4Help = "Кто из водителей должен уступить дорогу трамваю?\n" +
            "1. " +
            "Оба\n" +
            "2. " +
            "Только водитель грузового автомобиля\n" +
            "3. " +
            "Только водитель легкового автомобиля\n" +
            "4. " +
            "Никто из водителей\n\n" +
            "Правильный ответ: 4\n" +
            "Вне перекрёстков, где трамвайные пути пересекают проезжую часть, трамвай имеет преимущество перед " +
            "безрельсовыми транспортными средствами, кроме случаев выезда из депо. Здесь именно такой случай. " +
            "Поэтому никто из водителей не уступает дорогу трамваю. (Пункт 18.1 ПДД)";
    public final String FTC5 = "В данной ситуации Вы:\n" +
            "1. " +
            "Должны уступить дорогу автобусу, начинающему движение от обозначенного места остановки\n" +
            "2. " +
            "Имеете преимущество, так как автобус начинает движение с выездом на левую полосу";
    public final String FTC5Help = "В данной ситуации Вы:\n" +
            "1. " +
            "Должны уступить дорогу автобусу, начинающему движение от обозначенного места остановки\n" +
            "2. " +
            "Имеете преимущество, так как автобус начинает движение с выездом на левую полосу\n\n" +
            "Правильный ответ: 1\n" +
            "В населённых пунктах, обозначенных соответствующим знаком с белым фоном, при трогании от обозначенного места " +
            "остановки автобусы и троллейбусы имеют преимущество. При этом водители троллейбусов и автобусов могут начинать движение только после того, как убедятся, " +
            "что им уступают дорогу. Этот пункт Правил предусматривает редкий случай - равнозначную ответственность " +
            "водителей за разрешение дорожной ситуации. (Пункт 18.3 ПДД)";
}
