package main.topicTickets.caption;

public class CrossroadCaption {
    public final String FTP1 = "https://imgur.com/arMMFnZ";
    public final String FTP2 = "https://imgur.com/8ZwO3mv";
    public final String FTP3 = "https://imgur.com/MJBMw4a";
    public final String FTP4 = "https://imgur.com/OdUlAo0";
    public final String FTP5 = "https://imgur.com/WNJCLRD";

    public final String FTC1 = "Вы намерены проехать перекрёсток в прямом направлении. Ваши действия?\n" +
            "1. " +
            "Проедете перекресток первым\n" +
            "2. " +
            "Уступите дорогу только встречному автомобилю\n" +
            "3. " +
            "Уступите дорогу только автомобилю с включенными проблесковым маячком и специальным звуковым сигналом\n" +
            "4. " +
            "Уступите дорогу обоим транспортным средствам";
    public final String FTC1Help = "Вы намерены проехать перекрёсток в прямом направлении. Ваши действия?\n" +
            "1. " +
            "Проедете перекресток первым\n" +
            "2. " +
            "Уступите дорогу только встречному автомобилю\n" +
            "3. " +
            "Уступите дорогу только автомобилю с включенными проблесковым маячком и специальным звуковым сигналом\n" +
            "4. " +
            "Уступите дорогу обоим транспортным средствам\n\n" +
            "Правильный ответ: 3\n" +
            "Перекресток регулируемый. Первым проедет «оперативник» со специальными сигналами, который может отступать от требований сигналов светофора. " +
            "Другие водители должны обеспечить ему беспрепятственный проезд перекрёстка. " +
            "Водитель грузовика обязан уступить Вам, т.е. транспортному средству, движущемуся прямо со встречного направления. (Пункты 3.1, 3.2, 13.3, 13.4 ПДД)";
    public final String FTC2 = "Вы намерены повернуть налево. Ваши действия?\n" +
            "1. " +
            "Уступите дорогу трамваю\n" +
            "2. " +
            "Дождётесь разрешающего сигнала специального светофора и, пропустив трамвай, повернете налево\n" +
            "3. " +
            "Проедете перекрёсток первым";
    public final String FTC2Help = "Вы намерены повернуть налево. Ваши действия?\n" +
            "1. " +
            "Уступите дорогу трамваю\n" +
            "2. " +
            "Дождётесь разрешающего сигнала специального светофора и, пропустив трамвай, повернете налево\n" +
            "3. " +
            "Проедете перекрёсток первым\n\n" +
            "Правильный ответ: 3\n" +
            "Светофор с сигналами бело-лунного цвета, предназначенный для водителей маршрутных транспортных средств, запрещает им движение (горит верхний ряд). Трамвай стоит. " +
            "Вам же, согласно зелёного сигнала светофора, разрешено движение в любом направлении, по Вашему желанию поворачивая налево, " +
            "проезжайте перекресток первым. (Пункты 6.3, 6.8 ПДД)";
    public final String FTC3 = "Как Вам следует поступить при повороте налево?\n" +
            "1. " +
            "Проехать перекресток первым\n" +
            "2. " +
            "Выехать за стоп-линию и остановиться на перекрестке, чтобы уступить дорогу встречному автомобилю\n" +
            "3. " +
            "Остановиться перед стоп-линией и после проезда легкового автомобиля повернуть налево";
    public final String FTC3Help = "Как Вам следует поступить при повороте налево?\n" +
            "1. " +
            "Проехать перекресток первым\n" +
            "2. " +
            "Выехать за стоп-линию и остановиться на перекрестке, чтобы уступить дорогу встречному автомобилю\n" +
            "3. " +
            "Остановиться перед стоп-линией и после проезда легкового автомобиля повернуть налево\n\n" +
            "Правильный ответ: 2\n" +
            "Остановка не далее стоп-линии обязательна при запрещающем сигнале светофора. Вам же горит «зелёный». " +
            "Без остановки выезжаете на перекрёсток и перед поворотом налево останавливаетесь, чтобы уступить дорогу легковому " +
            "автомобилю, движущемуся прямо со встречного направления. ";
    public final String FTC4 = "Кто из водителей, выполняющих поворот, нарушит Правила?\n" +
            "1. " +
            "Оба\n" +
            "2. " +
            "Только водитель легкового автомобиля\n" +
            "3. " +
            "Только водитель мотоцикла\n" +
            "4. " +
            "Никто не нарушит";
    public final String FTC4Help = "Кто из водителей, выполняющих поворот, нарушит Правила?\n" +
            "1. " +
            "Оба\n" +
            "2. " +
            "Только водитель легкового автомобиля\n" +
            "3. " +
            "Только водитель мотоцикла\n" +
            "4. " +
            "Никто не нарушит\n\n" +
            "Правильный ответ: 1\n" +
            "Знак 4.1.1 «Движение прямо» в данном случае установлен непосредственно перед пересечением проезжих частей, " +
            "т.е перед перекрестком. Можно продолжать движение только прямо. В данной ситуации нарушают Правила оба водителя.";
    public final String FTC5 = "Разрешено ли Вам выехать на перекресток, за которым образовался затор?\n" +
            "1. " +
            "Разрешено\n" +
            "2. " +
            "Разрешено, если Вы намерены выполнить поворот\n" +
            "3. " +
            "Запрещено";
    public final String FTC5Help = "Разрешено ли Вам выехать на перекресток, за которым образовался затор?\n" +
            "1. " +
            "Разрешено\n" +
            "2. " +
            "Разрешено, если Вы намерены выполнить поворот\n" +
            "3. " +
            "Запрещено\n\n" +
            "Правильный ответ: 2\n" +
            "Перекрёсток регулируемый. Вам «зелёный свет», но впереди «пробка». Если Вы выедете на перекрёсток для движения в " +
            "прямом направлении, то при смене сигналов будете оказывать помехи движению, особенно в поперечном направлении. " +
            "Поэтому на перекрёсток Вы можете выехать только для поворота направо или налево. ";
}
