package main.topicTickets.caption;

public class CrossingsCaption {
    public final String FTP1 = "https://imgur.com/Uoh4sxl";
    public final String FTP2 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Кому Вы должны уступить дорогу при повороте направо?\n" +
            "1. " +
            "Только пешеходу, переходящему проезжую часть по нерегулируемому пешеходному переходу\n" +
            "2. " +
            "Только пешеходам, переходящим проезжую часть, на которую Вы поворачиваете\n" +
            "3. " +
            "Всем пешеходам";
    public final String FTC1Help = "Кому Вы должны уступить дорогу при повороте направо?\n" +
            "1. " +
            "Только пешеходу, переходящему проезжую часть по нерегулируемому пешеходному переходу\n" +
            "2. " +
            "Только пешеходам, переходящим проезжую часть, на которую Вы поворачиваете\n" +
            "3. " +
            "Всем пешеходам\n\n" +
            "Правильный ответ: 3\n" +
            "Первоначально Вы должны уступить дорогу пешеходу, находящемуся на нерегулируемом пешеходном переходе. " +
            "(Пункт 14.1 ПДД). В последующем, при повороте направо уступите дорогу пешеходам, переходящим проезжую часть " +
            "дороги, на которую Вы поворачиваете. (Пункт 13.1 ПДД). Это правило распространяется при проезде как регулируемых," +
            " так и нерегулируемых перекрестков.";
    public final String FTC2 = "При приближении к остановившемуся транспортному средству с включенной аварийной сигнализацией, которое имеет опознавательные знаки «Перевозка детей», водитель должен:\n" +
            "1. " +
            "Снизить скорость\n" +
            "2. " +
            "При необходимости остановиться и пропустить детей\n" +
            "3. " +
            "Осуществить все перечисленные действия";
    public final String FTC2Help = "При приближении к остановившемуся транспортному средству с включенной аварийной сигнализацией, которое имеет опознавательные знаки «Перевозка детей», водитель должен:\n" +
            "1. " +
            "Снизить скорость\n" +
            "2. " +
            "При необходимости остановиться и пропустить детей\n" +
            "3. " +
            "Осуществить все перечисленные действия\n\n" +
            "Правильный ответ: 3\n" +
            "Аварийная сигнализация должна быть включена при посадке детей в транспортное средства и высадке из него," +
            " имеющем опознавательные знаки «Перевозка детей». Приближаясь к остановившемуся ТС с включенной аварийной " +
            "сигнализацией, имеющему опознавательные знаки «Перевозка детей» водитель должен снизить скорость, " +
            "при необходимости остановиться и пропустить детей, т.е. осуществить все перечисленные действия. " +
            "(Пункты 7.1, 14.7, 22.6 ПДД)";
    public final String FTC3 = "Где необходимо остановиться, если сразу за пешеходным переходом образовался затор?\n" +
            "1. " +
            "На пешеходном переходе, если нет пешеходов\n" +
            "2. " +
            "Непосредственно перед пешеходным переходом\n" +
            "3. " +
            "Не ближе 5 м до пешеходного перехода";
    public final String FTC3Help = "Где необходимо остановиться, если сразу за пешеходным переходом образовался затор?\n" +
            "1. " +
            "На пешеходном переходе, если нет пешеходов\n" +
            "2. " +
            "Непосредственно перед пешеходным переходом\n" +
            "3. " +
            "Не ближе 5 м до пешеходного перехода\n\n" +
            "Правильный ответ: 2\n" +
            "Здесь Вы производите временное прекращение движения, а не преднамеренную остановку. Поэтому останавливаетесь " +
            "до границы пешеходного перехода, которая обозначается знаками или разметкой. Правильный ответ – " +
            "непосредственно перед пешеходным переходом. (Пункт 14.4 ПДД)";
    public final String FTC4 = "В каком случае водитель транспортного средства, приближающегося к нерегулируемому пешеходному переходу, обязан уступить дорогу пешеходам?\n" +
            "1. " +
            "Если пешеходы переходят дорогу\n" +
            "2. " +
            "Если пешеходы вступили на проезжую часть (трамвайные пути) для осуществления перехода\n" +
            "3. " +
            "В обоих перечисленных случаях";
    public final String FTC4Help = "В каком случае водитель транспортного средства, приближающегося к нерегулируемому пешеходному переходу, обязан уступить дорогу пешеходам?\n" +
            "1. " +
            "Если пешеходы переходят дорогу\n" +
            "2. " +
            "Если пешеходы вступили на проезжую часть (трамвайные пути) для осуществления перехода\n" +
            "3. " +
            "В обоих перечисленных случаях\n\n" +
            "Правильный ответ: 3\n" +
            "Водитель транспортного средства, приближающегося к нерегулируемому пешеходному переходу," +
            " обязан выполнять требования «уступить дорогу». Это требование нужно выполнить в обоих перечисленных " +
            "случаях. (Пункт 14.1 ПДД)";
    public final String FTC5 = "Подъехав к трамваю попутного направления, остановившемуся у посадочной площадки, которая расположена посередине дороги, водитель должен:\n" +
            "1. " +
            "Уступить дорогу пешеходам, идущим к трамваю или от него\n" +
            "2. " +
            "Остановиться и продолжить движение только после закрытия дверей трамвая\n" +
            "3. " +
            "Остановиться и продолжить движение только после начала движения трамвая";
    public final String FTC5Help = "Подъехав к трамваю попутного направления, остановившемуся у посадочной площадки, которая расположена посередине дороги, водитель должен:\n" +
            "1. " +
            "Уступить дорогу пешеходам, идущим к трамваю или от него\n" +
            "2. " +
            "Остановиться и продолжить движение только после закрытия дверей трамвая\n" +
            "3. " +
            "Остановиться и продолжить движение только после начала движения трамвая\n\n" +
            "Правильный ответ: 1\n" +
            "При наличии посадочной площадки уступить дорогу пешеходам, идущим к трамваю или от него. При отсутствии " +
            "пешеходов, переходящих проезжую часть со стороны дверей, с соблюдением необходимых мер предосторожности, " +
            "т.е. возможности Вашей остановки в любой момент при появлении «выскочившего пешехода», можете продолжать движение, " +
            "не дожидаясь закрытия дверей и начала движения маршрутного транспортного средства.";
}
