package main.topicTickets.caption;

public class DriveOrderCaption {
    public final String FTP1 = "https://imgur.com/59o9LQ0";
    public final String FTP2 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP3 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP4 = "https://imgur.com/rDhgPP7";
    public final String FTP5 = "https://imgur.com/7HbmwM6";

    public final String FTC1 = "По какой траектории Вам разрешается продолжить движение?\n" +
            "1. " +
            "Только по А\n" +
            "2. " +
            "Только по Б\n" +
            "3. " +
            "По любой из указанных";
    public final String FTC1Help = "По какой траектории Вам разрешается продолжить движение?\n" +
            "1. " +
            "Только по А\n" +
            "2. " +
            "Только по Б\n" +
            "3. " +
            "По любой из указанных\n\n" +
            "Правильный ответ: 2\n" +
            "Водители, поворачивающие на дорогу с реверсивным движением, обозначенную знаком 5.10, " +
            "должны двигаться по крайней правой полосе. Перестраиваться разрешается только после того, " +
            "как водитель убедится, что движение в данном направлении разрешается и по другим полосам. " +
            "Продолжать движение из указанных траекторий можно только по траектории «Б». ";
    public final String FTC2 = "В каких случаях разрешается выезжать за пределы правой полосы, если " +
            "Вы управляете транспортным средством, скорость которого по техническим причинам не может быть более 40 км/ч?\n" +
            "1. " +
            "Только при перестроении перед поворотом налево либо разворотом\n" +
            "2. " +
            "Только при обгоне или объезде\n" +
            "3. " +
            "Во всех перечисленных случаях";
    public final String FTC2Help =  "В каких случаях разрешается выезжать за пределы правой полосы, если " +
            "Вы управляете транспортным средством, скорость которого по техническим причинам не может быть более 40 км/ч?\n" +
            "1. " +
            "Только при перестроении перед поворотом налево либо разворотом\n" +
            "2. " +
            "Только при обгоне или объезде\n" +
            "3. " +
            "Во всех перечисленных случаях\n\n" +
            "Правильный ответ: 3\n" +
            "Транспортные средства, скорость движения которых не должна превышать 40 км/ч или которые по техническим причинам не могут развивать такую скорость, " +
            "должны двигаться по крайней правой полосе, кроме случаев объезда, обгона " +
            "или перестроения перед поворотом налево, разворотом или остановкой в разрешенных случаях на левой стороне дороги. Правильный ответ – " +
            "во всех перечисленных случаях.";
    public final String FTC3 = "Допускается ли движение автомобилей по тротуарам или пешеходным дорожкам?\n" +
            "1. " +
            "Допускается\n" +
            "2. " +
            "Допускается только при доставке грузов к торговым и другим предприятиям, расположенным непосредственно у " +
            "тротуаров или пешеходных дорожек, если отсутствуют другие возможности подъезда\n" +
            "3. " +
            "Не допускается";
    public final String FTC3Help = "Допускается ли движение автомобилей по тротуарам или пешеходным дорожкам?\n" +
            "1. " +
            "Допускается\n" +
            "2. " +
            "Допускается только при доставке грузов к торговым и другим предприятиям, расположенным непосредственно у тротуаров или " +
            "пешеходных дорожек, если отсутствуют другие возможности подъезда\n" +
            "3. " +
            "Не допускается\n\n" +
            "Правильный ответ: 2\n" +
            "Допускается движение автомобилей по тротуарам или пешеходным дорожкам только если Вы обслуживаете торговые или другие предприятия, " +
            "расположенные непосредственно у этих тротуаров или дорожек, при отсутствии других возможностей подъезда. (Пункт 9.9 ПДД)";
    public final String FTC4 = "Укажите расстояние, под которым в Правилах понимается дистанция:\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "Только Б\n" +
            "3. " +
            "Только В\n" +
            "4. " +
            "А и В";
    public final String FTC4Help = "Укажите расстояние, под которым в Правилах понимается дистанция:\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "Только Б\n" +
            "3. " +
            "Только В\n" +
            "4. " +
            "А и В\n\n" +
            "Правильный ответ: 2\n" +
            "Расстояние «Б» – дистанция между попутными транспортными средствами. Расстояние «А» – " +
            "интервал между встречными транспортными средствами, расстояние «В» – интервал между попутными транспортными средствами. (Пункт 9.10 ПДД)";
    public final String FTC5 = "Разрешается ли Вам, управляя легковым автомобилем, продолжить движение по трамвайным путям попутного направления?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только для поворота налево и разворота\n" +
            "3. " +
            "Запрещается";
    public final String FTC5Help = "Разрешается ли Вам, управляя легковым автомобилем, продолжить движение по трамвайным путям попутного направления?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только для поворота налево и разворота\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 3\n" +
            "При наличии знаков 5.15.1 и 5.15.2, указывающих количество полос и разрешённые направления движения " +
            "по ним, выезд на трамвайные пути в границах перекрёстка является нарушением. (Пункты 8.5, 9.6 ПДД)";
}
