package main.topicTickets.caption;

public class DriveCaption {
    public final String FTP1 = "https://imgur.com/bzGYr1f";
    public final String FTP2 = "https://imgur.com/fAGy5Lc";
    public final String FTP3 = "https://imgur.com/fbc5Ms9";
    public final String FTP4 = "https://imgur.com/ZNY9LjL";
    public final String FTP5 = "https://imgur.com/FZE630O";

    public final String FTC1 = "Водитель легкового автомобиля должен выключить указатели левого поворота:\n" +
            "1. " +
            "После перестроения на левую полосу\n" +
            "2. " +
            "После опережения грузового автомобиля\n" +
            "3. " +
            "После возвращения на правую полосу";
    public final String FTC1Help = "Водитель легкового автомобиля должен выключить указатели левого поворота:\n" +
            "1. " +
            "После перестроения на левую полосу\n" +
            "2. " +
            "После опережения грузового автомобиля\n" +
            "3. " +
            "После возвращения на правую полосу\n\n" +
            "Правильный ответ: 1\n" +
            "Показанная траектория состоит из трёх фаз. Первая фаза - перестроение в параллельный ряд. Как только Вы его закончили, " +
            "выключите левый сигнал указателя поворота. Вторая фаза – двигаетесь в параллельном ряду – включать сигналы не следует. " +
            "Третья фаза – перестроение, возвращение на ранее занимаемую полосу. " +
            "Перед перестроением включаете правый сигнал поворота. Закончив перестроение, выключаете его.";
    public final String FTC2 = "Вы намерены произвести разворот на перекрестке. Какие указатели поворота необходимо включить перед въездом на перекресток?\n" +
            "1. " +
            "Правого поворота\n" +
            "2. " +
            "Левого поворота\n" +
            "3. " +
            "Включать указатели поворота нет необходимости";
    public final String FTC2Help = "Вы намерены произвести разворот на перекрестке. Какие указатели поворота необходимо включить перед въездом на перекресток?\n" +
            "1. " +
            "Правого поворота\n" +
            "2. " +
            "Левого поворота\n" +
            "3. " +
            "Включать указатели поворота нет необходимости\n\n" +
            "Правильный ответ: 1\n" +
            "Въезд на перекрёсток с круговым движением соответствует повороту направо. Соответственно включаете правый указатель поворота. " +
            "Двигаясь по кругу, Вы не изменяете направление движения. Сигналы не используете. " +
            "При съезде с перекрёстка опять совершаете правый поворот и опять заблаговременно включаете правый указатель поворота.";
    public final String FTC3 = "Обязаны ли Вы в данной ситуации подать сигнал правого поворота?\n" +
            "1. " +
            "Обязаны\n" +
            "2. " +
            "Обязаны только в темное время суток\n" +
            "3. " +
            "Не обязаны";
    public final String FTC3Help = "Обязаны ли Вы в данной ситуации подать сигнал правого поворота?\n" +
            "1. " +
            "Обязаны\n" +
            "2. " +
            "Обязаны только в темное время суток\n" +
            "3. " +
            "Не обязаны\n\n" +
            "Правильный ответ: 1\n" +
            "Вы будете перестраиваться. Перед перестроением следует подать сигнал правого поворота. («Дорожные знаки», «Горизонтальная разметка» 1.19, пункт 8.1 ПДД)";
    public final String FTC4 = "Вы намерены повернуть налево на этом перекрёстке. В какой момент следует включить указатели левого поворота?\n" +
            "1. " +
            "Заблаговременно, до въезда на перекрёсток\n" +
            "2. " +
            "После въезда на первое пересечение проезжих частей\n" +
            "3. " +
            "По Вашему усмотрению";
    public final String FTC4Help = "Вы намерены повернуть налево на этом перекрёстке. В какой момент следует включить указатели левого поворота?\n" +
            "1. " +
            "Заблаговременно, до въезда на перекрёсток\n" +
            "2. " +
            "После въезда на первое пересечение проезжих частей\n" +
            "3. " +
            "По Вашему усмотрению\n\n" +
            "Правильный ответ: 2\n" +
            "Правила требуют заблаговременно предупреждать других участников дорожного движения об изменении намерений в движении. " +
            "Подаваемый Вами сигнал не должен вводить в заблуждение других водителей. " +
            "В рассматриваемой ситуации следует включить указатель поворота после въезда на первое пересечение проезжих частей. (Пункты 8.1, 8.2 ПДД)";
    public final String FTC5 = "Такой сигнал рукой, подаваемый водителем мотоцикла, информирует Вас:\n" +
            "1. " +
            "О его намерении повернуть налево или выполнить разворот\n" +
            "2. " +
            "О его намерении продолжить движение прямо или налево\n" +
            "3. " +
            "О наличии транспортного средства, приближающегося слева";
    public final String FTC5Help = "Такой сигнал рукой, подаваемый водителем мотоцикла, информирует Вас:\n" +
            "1. " +
            "О его намерении повернуть налево или выполнить разворот\n" +
            "2. " +
            "О его намерении продолжить движение прямо или налево\n" +
            "3. " +
            "О наличии транспортного средства, приближающегося слева\n\n" +
            "Правильный ответ: 1\n" +
            "Сигналу левого поворота (разворота) соответствует вытянутая в сторону левая рука. " +
            "Может использоваться для такого сигнала и правая вытянутая рука, но согнутая в локте под прямым углом вверх. (Пункт 8.1 ПДД)";

}
