package main.topicTickets.caption;

public class DriversResponsibilityCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Уголовная ответственность предусмотрена за управление транспортным средством, " +
            "не повлекшее причинение тяжкого вреда здоровью или смерть человека, лицом, находящимся в состоянии опьянения, если оно ранее было подвергнуто административному наказанию:\n" +
            "1. " +
            "За управление транспортным средством в состоянии опьянения\n" +
            "2. " +
            "За невыполнение законного требования уполномоченного должностного лица о прохождении медицинского " +
            "освидетельствования на состояние опьянения\n" +
            "3. " +
            "За совершение любого из перечисленных правонарушений";
    public final String FTC1Help = "Уголовная ответственность предусмотрена за управление транспортным средством, " +
            "не повлекшее причинение тяжкого вреда здоровью или смерть человека, лицом, находящимся в состоянии опьянения, если оно ранее было подвергнуто административному наказанию:\n" +
            "1. " +
            "За управление транспортным средством в состоянии опьянения\n" +
            "2. " +
            "За невыполнение законного требования уполномоченного должностного лица о прохождении медицинского " +
            "освидетельствования на состояние опьянения\n" +
            "3. " +
            "За совершение любого из перечисленных правонарушений\n\n" +
            "Правильный ответ: 3\n" +
            "Согласно статьи 264.1 УК РФ, уголовная ответственность предусмотрена в данной ситуации за совершение любого " +
            "из перечисленных правонарушений.";
    public final String FTC2 = "Административная ответственность установлена за нарушение Правил дорожного движения или" +
            " правил эксплуатации транспортного средства, повлекшее причинение:\n" +
            "1. " +
            "Легкого вреда здоровью человека либо незначительного материального ущерба\n" +
            "2. " +
            "Легкого или средней тяжести вреда здоровью человека\n" +
            "3. " +
            "Легкого или средней тяжести вреда здоровью человека либо материального ущерба";
    public final String FTC2Help = "Административная ответственность установлена за нарушение Правил дорожного движения " +
            "или правил эксплуатации транспортного средства, повлекшее причинение:\n" +
            "1. " +
            "Легкого вреда здоровью человека либо незначительного материального ущерба\n" +
            "2. " +
            "Легкого или средней тяжести вреда здоровью человека\n" +
            "3. " +
            "Легкого или средней тяжести вреда здоровью человека либо материального ущерба\n\n" +
            "Правильный ответ: 2\n" +
            "В соответствии со ст. 12.24 КоАП административная ответственность устанавливается за нарушения ПДД " +
            "или правил эксплуатации ТС, повлекшие причинение легкого или средней тяжести вреда здоровью человека.";
    public final String FTC3 = "Владелец транспортного средства обязан возместить вред, причинённый этим транспортным средством, если не докажет, что вред возник:\n" +
            "1. " +
            "Исключительно вследствие непреодолимой силы\n" +
            "2. " +
            "Исключительно вследствие умысла потерпевшего\n" +
            "3. " +
            "Вследствие непреодолимой силы или умысла потерпевшего";
    public final String FTC3Help = "Владелец транспортного средства обязан возместить вред, причинённый этим транспортным средством, если не докажет, что вред возник:\n" +
            "1. " +
            "Исключительно вследствие непреодолимой силы\n" +
            "2. " +
            "Исключительно вследствие умысла потерпевшего\n" +
            "3. " +
            "Вследствие непреодолимой силы или умысла потерпевшего\n\n" +
            "Правильный ответ: 3\n" +
            "Согласно ст.1079 гражданского кодекса РФ могут рассматриваться как следствие непреодолимой силы, так и следствие умысла потерпевшего";
    public final String FTC4 = "Какие виды административных наказаний могут применяться к водителям за нарушения Правил?\n" +
            "1. " +
            "Только предупреждение или штраф\n" +
            "2. " +
            "Предупреждение, штраф, лишение права управления транспортными средствами, административный арест\n" +
            "3. " +
            "Предупреждение, штраф, лишение права управления транспортными средствами, конфискация орудия совершения или " +
            "предмета административного правонарушения, административный арест, обязательные работы";
    public final String FTC4Help = "Какие виды административных наказаний могут применяться к водителям за нарушения Правил?\n" +
            "1. " +
            "Только предупреждение или штраф\n" +
            "2. " +
            "Предупреждение, штраф, лишение права управления транспортными средствами, административный арест\n" +
            "3. " +
            "Предупреждение, штраф, лишение права управления транспортными средствами, конфискация орудия совершения или " +
            "предмета административного правонарушения, административный арест, обязательные работы\n\n" +
            "Правильный ответ: 3\n" +
            "Согласно главы 12 КоАП к водителям за нарушение ПДД могут применяться все виды наказаний, перечисленные в ответах. Правильный ответ - самый полный.";
    public final String FTC5 = "Установленный факт употребления водителем вызывающих алкогольное опьянение веществ " +
            "определяется наличием в его организме абсолютного этилового спирта в концентрации, превышающей:\n" +
            "1. " +
            "0,10 миллиграмма на один литр выдыхаемого воздуха\n" +
            "2. " +
            "0,16 миллиграмма на один литр выдыхаемого воздуха\n" +
            "3. " +
            "0,25 миллиграмма на один литр выдыхаемого воздуха";
    public final String FTC5Help = "Установленный факт употребления водителем вызывающих алкогольное опьянение веществ " +
            "определяется наличием в его организме абсолютного этилового спирта в концентрации, превышающей:\n" +
            "1. " +
            "0,10 миллиграмма на один литр выдыхаемого воздуха\n" +
            "2. " +
            "0,16 миллиграмма на один литр выдыхаемого воздуха\n" +
            "3. " +
            "0,25 миллиграмма на один литр выдыхаемого воздуха\n\n" +
            "Правильный ответ: 2\n" +
            "Статья 12.8 КоАП, предусматривающая наказание водителей, находящихся в алкогольном опьянении предусматривает, " +
            "что она вступает в силу, если наличие абсолютного этилового спирта в концентрации превышает показатель 0,16 миллиграмма на один литр выдыхаемого воздуха.";
}
