package main.topicTickets.caption;

public class EmergencyCaption {
    public final String FTP1 = "https://imgur.com/WYDkR4w";
    public final String FTP2 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP3 = "https://imgur.com/M9VpYsX";
    public final String FTP4 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP5 = "https://imgur.com/bAPsXyR";

    public final String FTC1 = "Обязан ли в этой ситуации водитель, остановившийся из-за неисправности, выставить знак аварийной остановки?\n" +
            "1. " +
            "Обязан\n" +
            "2. " +
            "Обязан, если неисправна аварийная сигнализация\n" +
            "3. " +
            "Не обязан";
    public final String FTC1Help = "Обязан ли в этой ситуации водитель, остановившийся из-за неисправности, выставить знак аварийной остановки?\n" +
            "1. " +
            "Обязан\n" +
            "2. " +
            "Обязан, если неисправна аварийная сигнализация\n" +
            "3. " +
            "Не обязан\n\n" +
            "Правильный ответ: 1\n" +
            "При вынужденной остановке в местах, где она запрещена, водитель должен включить аварийную сигнализацию и " +
            "выставить знак аварийной остановки. " +
            "Знак аварийной остановки устанавливается вне зависимости от наличия и исправности аварийной сигнализации, " +
            "на той полосе движения, на которой находится ТС. (Пункты 7.1, 7.2 ПДД)";
    public final String FTC2 = "Аварийная сигнализация на буксируемом механическом транспортном средстве должна быть включена:\n" +
            "1. " +
            "Только в условиях недостаточной видимости\n" +
            "2. " +
            "Только в темное время суток\n" +
            "3. " +
            "Во всех случаях, когда осуществляется буксировка";
    public final String FTC2Help = "Аварийная сигнализация на буксируемом механическом транспортном средстве должна быть включена:\n" +
            "1. " +
            "Только в условиях недостаточной видимости\n" +
            "2. " +
            "Только в темное время суток\n" +
            "3. " +
            "Во всех случаях, когда осуществляется буксировка\n\n" +
            "Правильный ответ: 3\n" +
            "Во всех случаях при буксировке на буксируемом механическом транспортном средстве должна быть включена аварийная сигнализация. (Пункт 7.1 ПДД)";
    public final String FTC3 = "На каком расстоянии от транспортного средства должен быть выставлен знак аварийной остановки в данной ситуации?\n" +
            "1. " +
            "Не менее 10 м\n" +
            "2. " +
            "Не менее 15 м\n" +
            "3. " +
            "Не менее 20 м\n" +
            "4. " +
            "Не менее 30 м";
    public final String FTC3Help = "На каком расстоянии от транспортного средства должен быть выставлен знак аварийной остановки в данной ситуации?\n" +
            "1. " +
            "Не менее 10 м\n" +
            "2. " +
            "Не менее 15 м\n" +
            "3. " +
            "Не менее 20 м\n" +
            "4. " +
            "Не менее 30 м\n\n" +
            "Правильный ответ: 2\n" +
            "Действие происходит в населённом пункте. В этом случае знак аварийной остановки устанавливается на расстоянии не" +
            " менее 15 м от транспортного средства. (Пункт 7.2 ПДД)";
    public final String FTC4 = "Какой знак используется для обозначения транспортного средства при вынужденной остановке " +
            "в местах, где с учетом условий видимости оно не может быть своевременно замечено другими водителями?\n" +
            "1. " +
            "А\n" +
            "2. " +
            "Б\n" +
            "3. " +
            "В";
    public final String FTC4Help = "Какой знак используется для обозначения транспортного средства при вынужденной " +
            "остановке в местах, где с учетом условий видимости оно не может быть своевременно замечено другими водителями?\n" +
            "1. " +
            "А\n" +
            "2. " +
            "Б\n" +
            "3. " +
            "В\n\n" +
            "Правильный ответ: 1\n" +
            "Знак аварийной остановки «А». (Пункт 7.2 ПДД)";
    public final String FTC5 = "Как необходимо обозначить своё транспортное средство при дорожно-транспортном происшествии?\n" +
            "1. " +
            "Только с помощью аварийной сигнализации\n" +
            "2. " +
            "Только с помощью знака аварийной остановки\n" +
            "3. " +
            "Обоими перечисленными способами";
    public final String FTC5Help = "Как необходимо обозначить своё транспортное средство при дорожно-транспортном происшествии?\n" +
            "1. " +
            "Только с помощью аварийной сигнализации\n" +
            "2. " +
            "Только с помощью знака аварийной остановки\n" +
            "3. " +
            "Обоими перечисленными способами\n\n" +
            "Правильный ответ: 3\n" +
            "При ДТП водитель обязан включить аварийную сигнализацию и выставить знак аварийной остановки. (Пункты 7.1, 7.2 ПДД)";
}
