package main.topicTickets.caption;

public class FirstAidCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Как оказать первую помощь при отморожении и переохлаждении?\n" +
            "1. " +
            "Растереть пораженные участки тела снегом или шерстью, затем их утеплить, дать алкоголь, переместить в теплое помещение\n" +
            "2. " +
            "Утеплить пораженные участки тела и обездвижить их, укутать пострадавшего теплой одеждой или пледом, дать теплое питье, переместить в теплое помещение\n" +
            "3. " +
            "Смазать пораженные участки тела кремом, наложить согревающий компресс и грелку, переместить в теплое помещение, дать теплое питье";
    public final String FTC1Help = "Как оказать первую помощь при отморожении и переохлаждении?\n" +
            "1. " +
            "Растереть пораженные участки тела снегом или шерстью, затем их утеплить, дать алкоголь, переместить в теплое помещение\n" +
            "2. " +
            "Утеплить пораженные участки тела и обездвижить их, укутать пострадавшего теплой одеждой или пледом, дать теплое питье, переместить в теплое помещение\n" +
            "3. " +
            "Смазать пораженные участки тела кремом, наложить согревающий компресс и грелку, переместить в теплое помещение, дать теплое питье\n\n" +
            "Правильный ответ: 2\n" +
            "Давать алкоголь на морозе ЗАПРЕЩЕНО, он расширяет сосуды кожи, усиливая отдачу тепла организмом. " +
            "При отморожении и переохлаждении необходимо максимально снизить потери тепла с поверхности тела пострадавшего. " +
            "Для этого утепляют пораженные участки тела и обездвиживают их, укутывают пострадавшего теплой одеждой или пледом, " +
            "дают теплое питье, перемещают в теплое помещение.";
    public final String FTC2 = "Какова первая помощь при черепно-мозговой травме, сопровождающейся ранением волосистой части головы?\n" +
            "1. " +
            "Остановить кровотечение прямым давлением на рану и наложить давящую повязку. При потере сознания придать устойчивое боковое положение." +
            " По возможности, приложить к голове холод\n" +
            "2. " +
            "Фиксировать шейный отдел позвоночника с помощью импровизированной шейной шины (воротника). На рану наложить стерильный ватный тампон, " +
            "пострадавшего уложить на спину, приподняв ноги. По возможности, к голове приложить холод\n" +
            "3. " +
            "Шейную шину не накладывать, рану заклеить медицинским пластырем, пострадавшего уложить на бок";
    public final String FTC2Help = "Какова первая помощь при черепно-мозговой травме, сопровождающейся ранением волосистой части головы?\n" +
            "1. " +
            "Остановить кровотечение прямым давлением на рану и наложить давящую повязку. При потере сознания придать устойчивое боковое положение." +
            " По возможности, приложить к голове холод\n" +
            "2. " +
            "Фиксировать шейный отдел позвоночника с помощью импровизированной шейной шины (воротника). На рану наложить стерильный ватный тампон, " +
            "пострадавшего уложить на спину, приподняв ноги. По возможности, к голове приложить холод\n" +
            "3. " +
            "Шейную шину не накладывать, рану заклеить медицинским пластырем, пострадавшего уложить на бок\n\n" +
            "Правильный ответ: 1\n" +
            "Черепно-мозговая травма с ранением волосистой части головы может сопровождаться опасным для жизни кровотечением на вид необильным. " +
            "Его следует остановить прямым давлением на рану, и после наложить давящую повязку. При потере сознания пострадавшему придают устойчивое " +
            "боковое положение. Прикладывают холод к голове для замедления развитие отека мозга.";
    public final String FTC3 = "Как следует уложить пострадавшего при потере им сознания и наличии дыхания и кровообращения для оказания первой помощи?\n" +
            "1. " +
            "На спину с подложенным под голову валиком\n" +
            "2. " +
            "На спину с вытянутыми ногами\n" +
            "3. " +
            "Придать пострадавшему устойчивое боковое положение, чтобы согнутые колени опирались о землю, а верхняя рука находилась под щекой";
    public final String FTC3Help = "Как следует уложить пострадавшего при потере им сознания и наличии дыхания и кровообращения для оказания первой помощи?\n" +
            "1. " +
            "На спину с подложенным под голову валиком\n" +
            "2. " +
            "На спину с вытянутыми ногами\n" +
            "3. " +
            "Придать пострадавшему устойчивое боковое положение, чтобы согнутые колени опирались о землю, а верхняя рука находилась под щекой\n\n" +
            "Правильный ответ: 3\n" +
            "По наличию дыхания и признакам кровообращения, понимаем, что пострадавший жив. Но он может погибнуть от удушения в " +
            "результате западания языка. Ему следует придать устойчивое боковое положение так, чтобы согнутые колени опирались о землю, " +
            "а верхняя рука находилась под щекой.";
    public final String FTC4 = "На какой срок может быть наложен кровоостанавливающий жгут?\n" +
            "1. " +
            "Не более получаса в теплое время года и не более одного часа в холодное время года\n" +
            "2. " +
            "Не более одного часа в теплое время года и не более получаса в холодное время года\n" +
            "3. " +
            "Время наложения жгута не ограничено";
    public final String FTC4Help = "На какой срок может быть наложен кровоостанавливающий жгут?\n" +
            "1. " +
            "Не более получаса в теплое время года и не более одного часа в холодное время года\n" +
            "2. " +
            "Не более одного часа в теплое время года и не более получаса в холодное время года\n" +
            "3. " +
            "Время наложения жгута не ограничено\n\n" +
            "Правильный ответ: 2\n" +
            "Кровоостанавливающий жгут накладывается: в теплое время года (+4°С и выше ) - на время не более чем на " +
            "один час, и на время не более получаса в холодное время года (ниже +4°С).";
    public final String FTC5 = "Как определить наличие дыхания у потерявшего сознание пострадавшего?\n" +
            "1. " +
            "Взять пострадавшего за подбородок, запрокинуть голову и в течение 10 секунд проследить за движением его грудной клетки\n" +
            "2. " +
            "Положить одну руку на лоб пострадавшего, двумя пальцами другой поднять подбородок и, запрокинув голову, " +
            "наклониться к его лицу и в течение 10 секунд прислушаться к дыханию, постараться ощутить выдыхаемый воздух своей щекой, проследить за движением грудной клетки\n" +
            "3. " +
            "Не запрокидывая головы пострадавшего, наклониться к его лицу и в течение 10 секунд прислушаться к дыханию, " +
            "почувствовать его своей щекой, проследить за движением его грудной клетки";
    public final String FTC5Help = "Как определить наличие дыхания у потерявшего сознание пострадавшего?\n" +
            "1. " +
            "Взять пострадавшего за подбородок, запрокинуть голову и в течение 10 секунд проследить за движением его грудной клетки\n" +
            "2. " +
            "Положить одну руку на лоб пострадавшего, двумя пальцами другой поднять подбородок и, запрокинув голову, " +
            "наклониться к его лицу и в течение 10 секунд прислушаться к дыханию, постараться ощутить выдыхаемый воздух своей щекой, проследить за движением грудной клетки\n" +
            "3. " +
            "Не запрокидывая головы пострадавшего, наклониться к его лицу и в течение 10 секунд прислушаться к дыханию, " +
            "почувствовать его своей щекой, проследить за движением его грудной клетки\n\n" +
            "Правильный ответ: 2\n" +
            "Положить одну руку на лоб пострадавшего," +
            " двумя пальцами другой поднять подбородок и, запрокинув голову, наклониться к его лицу и в течение 10 секунд прислушаться к дыханию, постараться ощутить " +
            "выдыхаемый воздух своей щекой, проследить за движением грудной клетки.";
}
