package main.topicTickets.caption;

public class HighwayCaption {
    public final String FTP1 = "https://imgur.com/IWTKfuI";
    public final String FTP2 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP3 = "https://imgur.com/LUqebP9";
    public final String FTP4 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP5 = "https://imgur.com/A253ZcH";

    public final String FTC1 = "Разрешено ли обучать вождению на этой дороге?\n" +
            "1. " +
            "Запрещено\n" +
            "2. " +
            "Разрешено, используя для движения только правую полосу проезжей части\n" +
            "3. " +
            "Разрешено";
    public final String FTC1Help = "Разрешено ли обучать вождению на этой дороге?\n" +
            "1. " +
            "Запрещено\n" +
            "2. " +
            "Разрешено, используя для движения только правую полосу проезжей части\n" +
            "3. " +
            "Разрешено\n\n" +
            "Правильный ответ: 3\n" +
            "Движение происходит согласно знаку 5.1 по автомагистрали. Учебная езда на ней разрешена с 2020 года ";
    public final String FTC2 = "Разрешается ли движение по автомагистрали на транспортном средстве, скорость которого по техническому состоянию менее 40 км/ч?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только по крайней правой полосе\n" +
            "3. " +
            "Запрещается";
    public final String FTC2Help = "Разрешается ли движение по автомагистрали на транспортном средстве, скорость которого по техническому состоянию менее 40 км/ч?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только по крайней правой полосе\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 3\n" +
            "На автомагистралях запрещается движение транспортных средств, скорость которых по технической характеристике или их состоянию менее 40 км/ч. (Пункт 16.1 ПДД)";
    public final String FTC3 = "Кто из водителей нарушает Правила?\n" +
            "1. " +
            "Водители грузового автомобиля с разрешенной максимальной массой 3 т и мопеда\n" +
            "2. " +
            "Только водитель мопеда\n" +
            "3. " +
            "Никто не нарушает";
    public final String FTC3Help = "Кто из водителей нарушает Правила?\n" +
            "1. " +
            "Водители грузового автомобиля с разрешенной максимальной массой 3 т и мопеда\n" +
            "2. " +
            "Только водитель мопеда\n" +
            "3. " +
            "Никто не нарушает\n\n" +
            "Правильный ответ: 1\n" +
            "Движение по автомагистрали на мопедах запрещено. Запрещается и движение грузовым автомобилям с р.м.м более 2,5 т " +
            "по любой дороге, " +
            "имеющей три полосы движения в данном направлении по крайней левой полосе. Нарушают правила водители грузового " +
            "автомобиля и мопеда. (Пункты 9.4, 16.1 ПДД)";
    public final String FTC4 = "На каких участках автомагистрали запрещается движение задним ходом?\n" +
            "1. " +
            "Только в местах въезда или выезда с нее\n" +
            "2. " +
            "Только в местах остановок маршрутных транспортных средств\n" +
            "3. " +
            "На всем протяжении дороги";
    public final String FTC4Help = "На каких участках автомагистрали запрещается движение задним ходом?\n" +
            "1. " +
            "Только в местах въезда или выезда с нее\n" +
            "2. " +
            "Только в местах остановок маршрутных транспортных средств\n" +
            "3. " +
            "На всем протяжении дороги\n\n" +
            "Правильный ответ: 3\n" +
            "Движение задним ходом на автомагистрали запрещено на всем протяжении дороги. (Пункт 16.1 ПДД)";
    public final String FTC5 = "Нарушил ли водитель Правила при вынужденной остановке на автомагистрали?\n" +
            "1. " +
            "Нарушил\n" +
            "2. " +
            "Нарушил, если не выставил знак аварийной остановки\n" +
            "3. " +
            "Не нарушил";
    public final String FTC5Help = "Нарушил ли водитель Правила при вынужденной остановке на автомагистрали?\n" +
            "1. " +
            "Нарушил\n" +
            "2. " +
            "Нарушил, если не выставил знак аварийной остановки\n" +
            "3. " +
            "Не нарушил\n\n" +
            "Правильный ответ: 2\n" +
            "Водитель совершил вынужденную остановку на автомагистрали. Для проведения ремонтных работ он вывел транспортное средство на " +
            "специально предназначенную полосу. Согласно пунктам 16.2, 7.1, 7.2 ПДД в изображённой " +
            "ситуации следует включить аварийную сигнализацию и выставить знак аварийной остановки на расстоянии не менее 30 м, т.к. " +
            "действие происходит вне населённого пункта.";
}
