package main.topicTickets.caption;

public class LightsHornCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "В каких случаях разрешено применять звуковые сигналы в населённых пунктах?\n" +
            "1. " +
            "Только для предупреждения о намерении произвести обгон\n" +
            "2. " +
            "Только для предотвращения дорожно-транспортного происшествия\n" +
            "3. " +
            "В обоих перечисленных случаях";
    public final String FTC1Help = "В каких случаях разрешено применять звуковые сигналы в населённых пунктах?\n" +
            "1. " +
            "Только для предупреждения о намерении произвести обгон\n" +
            "2. " +
            "Только для предотвращения дорожно-транспортного происшествия\n" +
            "3. " +
            "В обоих перечисленных случаях\n\n" +
            "Правильный ответ: 2\n" +
            "Звуковые сигналы могут применяться только: – для предупреждения других водителей о намерении произвести обгон " +
            "вне населенных пунктов; – в случаях, когда это необходимо для предотвращения дорожно-транспортного происшествия. " +
            "(Пункт 19.10 ПДД)";
    public final String FTC2 = "Какие внешние световые приборы должны использоваться при движении в тёмное время суток" +
            " на освещённых участках дорог населённого пункта?\n" +
            "1. " +
            "Только габаритные огни\n" +
            "2. " +
            "Фары ближнего света\n" +
            "3. " +
            "Габаритные огни или фары ближнего света";
    public final String FTC2Help = "Какие внешние световые приборы должны использоваться при движении в тёмное время суток" +
            " на освещённых участках дорог населённого пункта?\n" +
            "1. " +
            "Только габаритные огни\n" +
            "2. " +
            "Фары ближнего света\n" +
            "3. " +
            "Габаритные огни или фары ближнего света\n\n" +
            "Правильный ответ: 2\n" +
            "В тёмное время суток на освещённых участках дорог, расположенных в населённом пункте, при движении водитель " +
            "должен включить фары ближнего света. (Пункт 19.2 ПДД)";
    public final String FTC3 = "При движении в условиях недостаточной видимости можно использовать противотуманные фары:\n" +
            "1. " +
            "Только отдельно от ближнего или дальнего света фар\n" +
            "2. " +
            "Только совместно с ближним или дальним светом фар\n" +
            "3. " +
            "Как отдельно, так и совместно с ближним или дальним светом фар";
    public final String FTC3Help = "При движении в условиях недостаточной видимости можно использовать противотуманные фары:\n" +
            "1. " +
            "Только отдельно от ближнего или дальнего света фар\n" +
            "2. " +
            "Только совместно с ближним или дальним светом фар\n" +
            "3. " +
            "Как отдельно, так и совместно с ближним или дальним светом фар\n\n" +
            "Правильный ответ: 2\n" +
            "Противотуманные фары могут использоваться в условиях недостаточной видимости только совместно с ближним или дальним светом фар. (Пункт 19.4 ПДД)";
    public final String FTC4 = "При движении в темное время суток вне населенных пунктов необходимо использовать:\n" +
            "1. " +
            "Только фары ближнего света\n" +
            "2. " +
            "Только фары дальнего света\n" +
            "3. " +
            "Фары ближнего или дальнего света";
    public final String FTC4Help = "При движении в темное время суток вне населенных пунктов необходимо использовать:\n" +
            "1. " +
            "Только фары ближнего света\n" +
            "2. " +
            "Только фары дальнего света\n" +
            "3. " +
            "Фары ближнего или дальнего света\n\n" +
            "Правильный ответ: 3\n" +
            "На всех механических ТС в темное время суток и в условиях недостаточной видимости должны " +
            "быть включены фары дальнего или ближнего света (Пункт 19.1 ПДД). Дальний свет должен быть переключен на " +
            "ближний согласно Пункта 19.2 ПДД.";
    public final String FTC5 = "Противотуманные фары и задние противотуманные фонари могут быть включены одновременно:\n" +
            "1. " +
            "Только в тумане\n" +
            "2. " +
            "В условиях недостаточной видимости\n" +
            "3. " +
            "В условиях ограниченной видимости";
    public final String FTC5Help = "Противотуманные фары и задние противотуманные фонари могут быть включены одновременно:\n" +
            "1. " +
            "Только в тумане\n" +
            "2. " +
            "В условиях недостаточной видимости\n" +
            "3. " +
            "В условиях ограниченной видимости\n\n" +
            "Правильный ответ: 2\n" +
            "В условиях «недостаточной видимости» - видимости дороги менее 300 м в условиях тумана, дождя, снегопада и т. п., а также в сумерки, " +
            "согласно пунктов 19.4 и 19.7 ПДД могут применяться противотуманные фары и задние противотуманные фонари, как " +
            "раздельно, так и одновременно. (Пункты 19.4, 19.7 ПДД)";
}
