package main.topicTickets.caption;

public class MaintenanceCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "При какой неисправности тормозной системы запрещается эксплуатация транспортного средства?\n" +
            "1. " +
            "Не включается контрольная лампа стояночной тормозной системы\n" +
            "2." +
            "Стояночная тормозная система не обеспечивает неподвижное состояние транспортного средства с полной нагрузкой на уклоне до 16% включительно\n" +
            "3. " +
            "Уменьшен свободный ход педали тормоза";
    public final String FTC1Help = "При какой неисправности тормозной системы запрещается эксплуатация транспортного средства?\n" +
            "1. " +
            "Не включается контрольная лампа стояночной тормозной системы\n" +
            "2. " +
            "Стояночная тормозная система не обеспечивает неподвижное состояние транспортного средства с полной нагрузкой на уклоне до 16% включительно\n" +
            "3. " +
            "Уменьшен свободный ход педали тормоза\n\n" +
            "Правильный ответ: 2\n" +
            "Запрещается эксплуатация транспортного средства, если стояночная тормозная система не обеспечивает" +
            " неподвижное состояние транспортных средств с полной нагрузкой на уклоне до 16 процентов включительно. («Перечень неисправностей» пункт 1.5)";
    public final String FTC2 = "При возникновении какой неисправности запрещено дальнейшее движение транспортного средства даже до места ремонта или стоянки?\n" +
            "1. " +
            "Не работает стеклоподъемник\n" +
            "2. " +
            "Неисправно рулевое управление\n" +
            "3. " +
            "Неисправен глушитель";
    public final String FTC2Help = "При возникновении какой неисправности запрещено дальнейшее движение транспортного средства даже до места ремонта или стоянки?\n" +
            "1. " +
            "Не работает стеклоподъемник\n" +
            "2. " +
            "Неисправно рулевое управление\n" +
            "3. " +
            "Неисправен глушитель\n\n" +
            "Правильный ответ: 2\n" +
            "При неисправности рулевого управления движение представляет явную опасность, поэтому запрещено. (Пункт 2.3.1 ПДД)";
    public final String FTC3 = "В каком из перечисленных случаев разрешается эксплуатация автомобиля?\n" +
            "1. " +
            "Шины имеют отслоения протектора или боковины\n" +
            "2. " +
            "Шины имеют порезы, обнажающие корд\n" +
            "3. " +
            "На задней оси автомобиля установлены шины с восстановленным рисунком протектора";
    public final String FTC3Help = "В каком из перечисленных случаев разрешается эксплуатация автомобиля?\n" +
            "1. " +
            "Шины имеют отслоения протектора или боковины\n" +
            "2. " +
            "Шины имеют порезы, обнажающие корд\n" +
            "3. " +
            "На задней оси автомобиля установлены шины с восстановленным рисунком протектора\n\n" +
            "Правильный ответ: 3\n" +
            "Не запрещается эксплуатация автомобиля с «наварными» шинами, т. е. с восстановленным рисунком протектора. " +
            "С дефектами шин, перечисленными в других ответах, эксплуатация запрещена. («Перечень неисправностей» пункт 5.2)";
    public final String FTC4 = "Эксплуатация мотоцикла запрещается:\n" +
            "1. " +
            "Только при отсутствии предусмотренных конструкцией подножек, поперечных рукояток для пассажиров на седле\n" +
            "2. " +
            "Только при отсутствии предусмотренных конструкцией дуг безопасности\n" +
            "3. " +
            "При отсутствии всего перечисленного оборудования";
    public final String FTC4Help = "Эксплуатация мотоцикла запрещается:\n" +
            "1. " +
            "Только при отсутствии предусмотренных конструкцией подножек, поперечных рукояток для пассажиров на седле\n" +
            "2. " +
            "Только при отсутствии предусмотренных конструкцией дуг безопасности\n" +
            "3. " +
            "При отсутствии всего перечисленного оборудования\n\n" +
            "Правильный ответ: 3\n" +
            "Пункты 7.16 и 7.17 «Перечня неисправностей» запрещают эксплуатацию мотоцикла при отсутствии всего перечисленного оборудования.";
    public final String FTC5 = "Запрещается эксплуатация легкового автомобиля, если стояночная тормозная система не обеспечивает неподвижное состояние автомобиля в снаряженном состоянии на уклоне:\n" +
            "1. " +
            "До 16% включительно\n" +
            "2. " +
            "До 23% включительно\n" +
            "3. " +
            "До 31% включительно";
    public final String FTC5Help = "Запрещается эксплуатация легкового автомобиля, если стояночная тормозная система не обеспечивает " +
            "неподвижное состояние автомобиля в снаряженном состоянии на уклоне:\n" +
            "1. " +
            "До 16% включительно\n" +
            "2. " +
            "До 23% включительно\n" +
            "3. " +
            "До 31% включительно\n\n" +
            "Правильный ответ: 2\n" +
            "«Перечень неисправностей» запрещает эксплуатацию легковых автомобилей, если стояночная тормозная система " +
            "не обеспечивает неподвижное состояние их на уклоне до 23 процентов включительно. (Пункт 1.5 «Перечень неисправностей»)";
}
