package main.topicTickets.caption;

public class OvertakingCaption {
    public final String FTP1 = "https://imgur.com/9n8W95G";
    public final String FTP2 = "https://imgur.com/ugvafJY";
    public final String FTP3 = "https://imgur.com/55SzBpD";
    public final String FTP4 = "https://imgur.com/BlqLHAK";
    public final String FTP5 = "https://imgur.com/R8bhtvV";

    public final String FTC1 = "Разрешен ли Вам обгон?\n" +
            "1. " +
            "Разрешен\n" +
            "2. " +
            "Разрешен, если обгон будет завершен до перекрестка\n" +
            "3. " +
            "Запрещен";
    public final String FTC1Help = "Разрешен ли Вам обгон?\n" +
            "1. " +
            "Разрешен\n" +
            "2. " +
            "Разрешен, если обгон будет завершен до перекрестка\n" +
            "3. " +
            "Запрещен\n\n" +
            "Правильный ответ: 1\n" +
            "Обгон запрещён на равнозначных перекрёстках. Вы же, согласно знаку 2.3.1 «Пересечение со " +
            "второстепенной дорогой», двигаетесь по направлению главной дороги. Можете совершить обгон.";
    public final String FTC2 = "Как Вам следует поступить в данной ситуации?\n" +
            "1. " +
            "Уступить дорогу встречному автомобилю\n" +
            "2. " +
            "Проехать первым\n" +
            "3. " +
            "Действовать по взаимной договоренности с водителем встречного автомобиля";
    public final String FTC2Help = "Как Вам следует поступить в данной ситуации?\n" +
            "1. " +
            "Уступить дорогу встречному автомобилю\n" +
            "2. " +
            "Проехать первым\n" +
            "3. " +
            "Действовать по взаимной договоренности с водителем встречного автомобиля\n\n" +
            "Правильный ответ: 1\n" +
            "На Вашей стороне проезжей части помеха – препятствие в виде неисправного автомобиля. Вы должны уступить дорогу. " +
            "Если бы аналогичная ситуация сложилась на уклоне, обозначенном знаками 1.13 «Крутой спуск», 1.14 «Крутой подъем»," +
            " то уступить дорогу должен был бы автомобиль, движущийся на спуск, т.е. вниз.";
    public final String FTC3 = "Разрешается ли Вам в конце подъёма перестроиться на среднюю полосу для опережения грузового автомобиля?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только при видимости дороги не менее 100 м\n" +
            "3. " +
            "Запрещается";
    public final String FTC3Help = "Разрешается ли Вам в конце подъёма перестроиться на среднюю полосу для опережения грузового автомобиля?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только при видимости дороги не менее 100 м\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 1\n" +
            "В данной ситуации четкое разграничение дороги по полосам. Одна полоса со встречным движением и две полосы движения в Вашем направлении. " +
            "Поэтому можете совершать опережение и в конце подъёма. Но всегда проявляйте в таких ситуациях осторожность, т. к. что происходит на дороге " +
            "за поперечным переломом её не видно, неизвестно.";
    public final String FTC4 = "Можно ли Вам обогнать трактор?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно, если обгон будет завершен не ближе чем за 100 м до переезда\n" +
            "3. " +
            "Нельзя";
    public final String FTC4Help = "Можно ли Вам обогнать трактор?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно, если обгон будет завершен не ближе чем за 100 м до переезда\n" +
            "3. " +
            "Нельзя\n\n" +
            "Правильный ответ: 2\n" +
            "Обгон запрещён на железнодорожных переездах и ближе, чем за 100 м перед ними. В данной ситуации действие " +
            "происходит вне населённого пункта, согласно знаку 1.4.1 «Приближение к железнодорожному переезду» до железнодорожного " +
            "переезда расстояние не менее 150-300 м. Поэтому вы можете совершить обгон трактора, если уверены, что успеете " +
            "его завершить за 100 м до переезда.";
    public final String FTC5 = "Сколько транспортных средств Вам можно обогнать одновременно после проезда пешеходного перехода?\n" +
            "1. " +
            "Только одно\n" +
            "2. " +
            "Только два\n" +
            "3. " +
            "Все три";
    public final String FTC5Help = "Сколько транспортных средств Вам можно обогнать одновременно после проезда пешеходного перехода?\n" +
            "1. " +
            "Только одно\n" +
            "2. " +
            "Только два\n" +
            "3. " +
            "Все три\n\n" +
            "Правильный ответ: 3\n" +
            "Правилами не оговаривается количество обгоняемых транспортных средств. Запрещается обгон на пешеходных переходах." +
            " Факторов, запрещающих обгон, нет. Можете обогнать все три ТС. Но всегда следует помнить: обгон – классический вид риска водителя. ";
}
