package main.topicTickets.caption;

public class ParkingCaption {
    public final String FTP1 = "https://imgur.com/wrsqKgb";
    public final String FTP2 = "https://imgur.com/Cbsf8Dq";
    public final String FTP3 = "https://imgur.com/inbD5yi";
    public final String FTP4 = "https://imgur.com/RAByilv";
    public final String FTP5 = "https://imgur.com/RZuOtb9";

    public final String FTC1 = "Можно ли водителю поставить грузовой автомобиль на стоянку в этом месте указанным способом?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно, если разрешённая максимальная масса автомобиля не более 3,5 т\n" +
            "3. " +
            "Нельзя";
    public final String FTC1Help = "Можно ли водителю поставить грузовой автомобиль на стоянку в этом месте указанным способом?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно, если разрешённая максимальная масса автомобиля не более 3,5 т\n" +
            "3. " +
            "Нельзя\n\n" +
            "Правильный ответ: 3\n" +
            "Водителям грузовых автомобилей при наличии знака 6.4 «Парковка (парковочное место)» с одной из табличек 8.6.2 - 8.6.9 " +
            "«Способ постановки транспортных средств на стоянку» стоять в зоне действия этого знака нельзя. Не допускает стоянку на краю " +
            "тротуара любым грузовым автомобилям и пункт 12.2 ПДД и в иных местах, не обозначенных знаками. Поэтому ответ однозначен – водитель грузовика нарушает Правила.";
    public final String FTC2 = "Кто из водителей нарушил правила стоянки:\n" +
            "1. " +
            "Водители мотоцикла и грузового автомобиля\n" +
            "2. " +
            "Только водитель мотоцикла\n" +
            "3. " +
            "Только водитель грузового автомобиля\n" +
            "4. " +
            "Никто не нарушил";
    public final String FTC2Help = "Кто из водителей нарушил правила стоянки:\n" +
            "1. " +
            "Водители мотоцикла и грузового автомобиля\n" +
            "2. " +
            "Только водитель мотоцикла\n" +
            "3. " +
            "Только водитель грузового автомобиля\n" +
            "4. " +
            "Никто не нарушил\n\n" +
            "Правильный ответ: 3\n" +
            "Водителям любых грузовых автомобилей остановка и стоянка с заездом на тротуар, граничащий с проезжей частью, запрещена. " +
            "Водитель данного грузового автомобиля явно нарушает Правила. " +
            "Водители легкового автомобиля и мотоцикла согласно знаку 6.4 «Парковка (парковочное место)» и таблички 8.6.3 абсолютно верно выполнили требования Правил.";
    public final String FTC3 = "Можно ли Вам поставить автомобиль на стоянку за путепроводом?\n" +
            "1.  " +
            "Можно\n" +
            "2. " +
            "Можно не ближе 5 м от опоры путепровода\n" +
            "3. " +
            "Нельзя";
    public final String FTC3Help = "Можно ли Вам поставить автомобиль на стоянку за путепроводом?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно не ближе 5 м от опоры путепровода\n" +
            "3. " +
            "Нельзя\n\n" +
            "Правильный ответ: 3\n" +
            "В указанном месте стоянка запрещена знаком 3.28 «Стоянка запрещена», " +
            "действие которого распространяется до ближайшего перекрёстка. Путепровод не может прекращать действие данного знака. («Дорожные знаки»)";
    public final String FTC4 = "Поставить на стоянку указанным на табличке способом можно:\n" +
            "1. " +
            "Только легковые автомобили и мотоциклы\n" +
            "2. " +
            "Все транспортные средства, кроме грузовых автомобилей с разрешенной максимальной массой более 3,5 т\n" +
            "3. " +
            "Любые транспортные средства";
    public final String FTC4Help = "Поставить на стоянку указанным на табличке способом можно:\n" +
            "1. " +
            "Только легковые автомобили и мотоциклы\n" +
            "2. " +
            "Все транспортные средства, кроме грузовых автомобилей с разрешенной максимальной массой более 3,5 т\n" +
            "3. " +
            "Любые транспортные средства\n\n" +
            "Правильный ответ: 1\n" +
            "Табличка 8.6.3 «Способ постановки транспортного средства на стоянку» указывает, как должны располагаться " +
            "легковые автомобили и мотоциклы на краю тротуара в месте, обозначенном знаком 6.4 «Парковка (парковочное место)».";
    public final String FTC5 = "Кто из водителей нарушил правила стоянки?\n" +
            "1. " +
            "Оба\n" +
            "2. " +
            "Только водитель автомобиля\n" +
            "3. " +
            "Только водитель мотоцикла\n" +
            "4. " +
            "Никто не нарушил";
    public final String FTC5Help = "Кто из водителей нарушил правила стоянки?\n" +
            "1. " +
            "Оба\n" +
            "2. " +
            "Только водитель автомобиля\n" +
            "3. " +
            "Только водитель мотоцикла\n" +
            "4. " +
            "Никто не нарушил\n\n" +
            "Правильный ответ: 2\n" +
            "Водитель легкового автомобиля может заезжать на прилегающий к проезжей части тротуар только в местах, " +
            "обозначенных знаком 6.4 «Парковка (парковочное место)», с одной из табличек 8.6.2, 8.6.3, 8.6.6-8.6.9 «Способ постановки транспортного средства на стоянку». " +
            "В данной ситуации таких знаков нет, соответственно водитель - «нарушитель». Водитель мотоцикла не нарушает правила остановки и стоянки, т. к. " +
            "правила запрещают это делать в условиях, когда расстояние между сплошной линией разметки и остановившимся транспортным средством менее З м. " +
            "Здесь же действие происходит со стороны прерывистой линии, что Правилам не противоречит.";
}
