package main.topicTickets.caption;

public class RailwayCaption {
    public final String FTP1 = "https://imgur.com/8cln9hY";
    public final String FTP2 = "https://imgur.com/PRXWgg9";
    public final String FTP3 = "https://imgur.com/PvIbrJV";
    public final String FTP4 = "https://imgur.com/uVfXngT";
    public final String FTP5 = "https://imgur.com/dOZ6W0e";

    public final String FTC1 = "Разрешено ли Вам проехать железнодорожный переезд?\n" +
            "1. " +
            "Разрешено, поскольку дежурный по переезду запрещает движение только встречному автомобилю\n" +
            "2. " +
            "Разрешено, если отсутствует приближающийся поезд\n" +
            "3. " +
            "Запрещено";
    public final String FTC1Help = "Разрешено ли Вам проехать железнодорожный переезд?\n" +
            "1. " +
            "Разрешено, поскольку дежурный по переезду запрещает движение только встречному автомобилю\n" +
            "2. " +
            "Разрешено, если отсутствует приближающийся поезд\n" +
            "3. " +
            "Запрещено\n\n" +
            "Правильный ответ: 3\n" +
            "Запрещающим сигналом дежурного по переезду является его обращение к водителям с поднятым над головой жезлом, " +
            "красным фонарём или флажком, либо с вытянутыми в сторону руками." +
            " При этом выезд на переезд и со стороны груди, и со стороны спины запрещен. (Пункт 15.3 ПДД)";
    public final String FTC2 = "Разрешён ли Вам въезд на железнодорожный переезд в данной ситуации?\n" +
            "1. " +
            "Разрешен\n" +
            "2. " +
            "Разрешен, если отсутствует приближающийся поезд\n" +
            "3. " +
            "Запрещен";
    public final String FTC2Help = "Разрешён ли Вам въезд на железнодорожный переезд в данной ситуации?\n" +
            "1. " +
            "Разрешен\n" +
            "2. " +
            "Разрешен, если отсутствует приближающийся поезд\n" +
            "3. " +
            "Запрещен\n\n" +
            "Правильный ответ: 3\n" +
            "Запрещается выезжать на переезд при запрещающем сигнале светофора, независимо от положения и наличия шлагбаума. " +
            "(Пункт 15.3 ПДД). Нарушение правил проезда железнодорожных переездов относится к грубейшим нарушениям Правил." +
            " Имейте ввиду, что согласно статьи 12.10 часть 1 КоАП РФ за проезд ж/д переезда " +
            "на запрещающий сигнал, переезд ж/д путей вне переезда, остановку и стоянку на нем предусмотрено наказание - " +
            "штраф 1000 руб. или лишение прав на 3-6 месяцев.";
    public final String FTC3 = "В данной ситуации Вы должны остановиться:\n" +
            "1. " +
            "У знака «Движение без остановки запрещено»\n" +
            "2. " +
            "У знака «Однопутная железная дорога»\n" +
            "3. " +
            "За 5 м до ближайшего рельса";
    public final String FTC3Help = "В данной ситуации Вы должны остановиться:\n" +
            "1. " +
            "У знака «Движение без остановки запрещено»\n" +
            "2. " +
            "У знака «Однопутная железная дорога»\n" +
            "3. " +
            "За 5 м до ближайшего рельса\n\n" +
            "Правильный ответ: 1\n" +
            "Знак 2.5 – «Движение без остановки запрещено» установлен перед железнодорожным переездом. " +
            "В этом случае при запрещении движения водитель должен " +
            "остановиться перед стоп-линией, а при ее отсутствии (как в данной ситуации) – перед знаком. " +
            "Выезд за знак будет грубым нарушением Правил. («Дорожные знаки», пункт 15.4 ПДД)";
    public final String FTC4 = "В данной ситуации Вы:\n" +
            "1. " +
            "Можете объехать шлагбаум, так как светофор не запрещает движение\n" +
            "2. " +
            "Должны остановиться и можете продолжить движение только при открытом шлагбауме";
    public final String FTC4Help = "В данной ситуации Вы:\n" +
            "1. " +
            "Можете объехать шлагбаум, так как светофор не запрещает движение\n" +
            "2. " +
            "Должны остановиться и можете продолжить движение только при открытом шлагбауме\n\n" +
            "Правильный ответ: 2\n" +
            "Запрещается выезд на переезд при закрытом шлагбауме независимо от сигнала светофора. (Пункт 15.3 ПДД)";
    public final String FTC5 = "Как Вам следует поступить в данной ситуации?\n" +
            "1. " +
            "Проехать железнодорожный переезд без остановки перед знаком\n" +
            "2. " +
            "Остановиться перед знаком и продолжить движение сразу же после проезда поезда\n" +
            "3. " +
            "Остановиться перед знаком и продолжить движение, убедившись в отсутствии приближающегося поезда";
    public final String FTC5Help = "Как Вам следует поступить в данной ситуации?\n" +
            "1. " +
            "Проехать железнодорожный переезд без остановки перед знаком\n" +
            "2. " +
            "Остановиться перед знаком и продолжить движение сразу же после проезда поезда\n" +
            "3. " +
            "Остановиться перед знаком и продолжить движение, убедившись в отсутствии приближающегося поезда\n\n" +
            "Правильный ответ: 3\n" +
            "На пути движения многопутная железная дорога. Вам необходимо остановиться перед знаком 2.5 " +
            "«Движение без остановки запрещено», дождаться проезда поезда и, " +
            "убедившись в отсутствии приближающихся поездов с обоих направлений, продолжить дальнейшее движение." +
            " («Дорожные знаки», пункты 15.1, 15.2, 15.3, 15.4 ПДД)";
}
