package main.topicTickets.caption;

public class ResidentialAreaCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Какие из перечисленных действий запрещены водителям транспортных средств в жилой зоне?\n" +
            "1. " +
            "Сквозное движение\n" +
            "2. " +
            "Учебная езда\n" +
            "3. " +
            "Стоянка с работающим двигателем\n" +
            "4. " +
            "Все перечисленные действия";
    public final String FTC1Help = "Какие из перечисленных действий запрещены водителям транспортных средств в жилой зоне?\n" +
            "1. " +
            "Сквозное движение\n" +
            "2. " +
            "Учебная езда\n" +
            "3. " +
            "Стоянка с работающим двигателем\n" +
            "4. " +
            "Все перечисленные действия\n\n" +
            "Правильный ответ: 4\n" +
            "Все действия, перечисленные в ответах, в жилой зоне, на дворовых территориях запрещены. (Пункты 17.2, 17.4 ПДД)";
    public final String FTC2 = "Где могут двигаться пешеходы в жилой зоне?\n" +
            "1. " +
            "Только по тротуарам\n" +
            "2. " +
            "По тротуарам и в один ряд по краю проезжей части\n" +
            "3. " +
            "По тротуарам и по всей ширине проезжей части";
    public final String FTC2Help = "Где могут двигаться пешеходы в жилой зоне?\n" +
            "1. " +
            "Только по тротуарам\n" +
            "2. " +
            "По тротуарам и в один ряд по краю проезжей части\n" +
            "3. " +
            "По тротуарам и по всей ширине проезжей части\n\n" +
            "Правильный ответ: 3\n" +
            "В жилой зоне, на дворовых территориях пешеходы имеют " +
            "преимущество перед транспортными средствами. Их движение разрешается как по тротуарам, " +
            "так и по всей ширине проезжей части. (Пункты 17.1, 17.4 ПДД)";
    public final String FTC3 = "С какой максимальной скоростью разрешается движение транспортных средств в жилых зонах и на дворовых территориях?\n" +
            "1. " +
            "10 км/ч\n" +
            "2. " +
            "20 км/ч\n" +
            "3. " +
            "40 км/ч";
    public final String FTC3Help = "С какой максимальной скоростью разрешается движение транспортных средств в жилых зонах и на дворовых территориях?\n" +
            "1. " +
            "10 км/ч\n" +
            "2. " +
            "20 км/ч\n" +
            "3. " +
            "40 км/ч\n\n" +
            "Правильный ответ: 2\n" +
            "Движение в жилой зоне, на дворовых территориях имеет ряд ограничений. К таким ограничениям относится и " +
            "скорость, которая не должна превышать 20 км/ч. (Пункт 10.2 ПДД)";
    public final String FTC4 = "При выезде из жилой зоны необходимо уступить дорогу:\n" +
            "1. " +
            "Только транспортным средствам с включенным проблесковым маячком\n" +
            "2. " +
            "Только транспортным средствам, приближающимся слева\n" +
            "3. " +
            "Только транспортным средствам, приближающимся справа\n" +
            "4. " +
            "Всем транспортным средствам";
    public final String FTC4Help = "При выезде из жилой зоны необходимо уступить дорогу:\n" +
            "1. " +
            "Только транспортным средствам с включенным проблесковым маячком\n" +
            "2. " +
            "Только транспортным средствам, приближающимся слева\n" +
            "3. " +
            "Только транспортным средствам, приближающимся справа\n" +
            "4. " +
            "Всем транспортным средствам\n\n" +
            "Правильный ответ: 4\n" +
            "При выезде из жилой зоны водители должны уступить дорогу другим участникам движения, в том числе всем транспортным средствам. (Пункт 17.3 ПДД)";
    public final String FTC5 = "Водители должны уступать дорогу другим участникам движения:\n" +
            "1. " +
            "При выезде из жилой зоны\n" +
            "2. " +
            "При выезде с дворовой территории\n" +
            "3. " +
            "В обоих перечисленных случаях";
    public final String FTC5Help = "Водители должны уступать дорогу другим участникам движения:\n" +
            "1. " +
            "При выезде из жилой зоны\n" +
            "2. " +
            "При выезде с дворовой территории\n" +
            "3. " +
            "В обоих перечисленных случаях\n\n" +
            "Правильный ответ: 3\n" +
            "При выезде из жилой зоны, дворовой территории водители должны уступать дорогу другим участникам движения. " +
            "Правильный ответ - в обоих перечисленных случаях. (Пункты 17.3, 17.4 ПДД)";
}
