package main.topicTickets.caption;

public class ResponsibilityCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "При наличии каких условий в случаях вынужденной остановки транспортного средства или" +
            " дорожно-транспортного происшествия водитель обязан быть одетым в куртку, жилет или жилет-накидку с полосами " +
            "световозвращающего материала?\n" +
            "1. " +
            "Если это произошло вне населенных пунктов\n" +
            "2. " +
            "Если это произошло в темное время суток либо в условиях ограниченной видимости\n" +
            "3. " +
            "Если водитель находится на проезжей части или обочине\n" +
            "4. " +
            "При наличии всех перечисленных условий";
    public final String FTC1Help = "При наличии каких условий в случаях вынужденной остановки транспортного средства или" +
            " дорожно-транспортного происшествия водитель обязан быть одетым в куртку, жилет или жилет-накидку с полосами " +
            "световозвращающего материала?\n" +
            "1. " +
            "Если это произошло вне населенных пунктов\n" +
            "2. " +
            "Если это произошло в темное время суток либо в условиях ограниченной видимости\n" +
            "3. " +
            "Если водитель находится на проезжей части или обочине\n" +
            "4. " +
            "При наличии всех перечисленных условий\n\n" +
            "Правильный ответ: 4\n" +
            "В темное время суток, либо в условиях ограниченной видимости за пределами населенных " +
            "пунктов при нахождении на проезжей части или обочине нужно быть одетым в куртку, жилет или жилет-накидку " +
            "с полосами световозвращающего материала 2.3.4.";
    public final String FTC2 = "Какие условия являются обязательными для оформления документа о дорожно-транспортном " +
            "происшествии (ДТП) без участия уполномоченных на то сотрудников полиции?\n" +
            "1. " +
            "В результате взаимодействия (столкновения) двух транспортных средств (в том числе с прицепами к ним) вред причинен только им\n" +
            "2. " +
            "Гражданская ответственность владельцев транспортных средств застрахована в соответствии с законодательством\n" +
            "3. " +
            "Обстоятельства причинения вреда в связи с повреждением транспортных средств, характер и перечень видимых " +
            "повреждений зафиксированы в соответствии с правилами обязательного страхования\n" +
            "4. " +
            "Все перечисленные условия";
    public final String FTC2Help = "Какие условия являются обязательными для оформления документа о дорожно-транспортном " +
            "происшествии (ДТП) без участия уполномоченных на то сотрудников полиции?\n" +
            "1. " +
            "В результате взаимодействия (столкновения) двух транспортных средств (в том числе с прицепами к ним) вред причинен только им\n" +
            "2. " +
            "Гражданская ответственность владельцев транспортных средств застрахована в соответствии с законодательством\n" +
            "3. " +
            "Обстоятельства причинения вреда в связи с повреждением транспортных средств, характер и перечень видимых " +
            "повреждений зафиксированы в соответствии с правилами обязательного страхования\n" +
            "4. " +
            "Все перечисленные условия\n\n" +
            "Правильный ответ: 4\n" +
            "Согласно пункта 2.6.1 ПДД и ч. 1 ст. 11.1 ФЗ «Об обязательном страховании гражданской ответственности владельцев " +
            "транспортных средств\" водители, причастные к ДТП при наличии всех перечисленных условий, указанных в ответах могут" +
            " оформить документы о дорожно-транспортном происшествии без участия уполномоченных на то сотрудников полиции.";
    public final String FTC3 = "Разрешается ли водителю пользоваться телефоном во время движения?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только при использовании технического устройства, позволяющего вести переговоры без использования рук\n" +
            "3. " +
            "Разрешается только при движении со скоростью менее 20 км/ч\n" +
            "4. " +
            "Запрещается";
    public final String FTC3Help =  "Разрешается ли водителю пользоваться телефоном во время движения?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только при использовании технического устройства, позволяющего вести переговоры без использования рук\n" +
            "3. " +
            "Разрешается только при движении со скоростью менее 20 км/ч\n" +
            "4. " +
            "Запрещается\n\n" +
            "Правильный ответ: 2\n" +
            "Водителю запрещается пользоваться во время движения телефоном, не оборудованном техническим устройством, " +
            "позволяющим вести переговоры без использования рук.";
    public final String FTC4 = "При движении на легковом автомобиле, оборудованном ремнями безопасности, должны быть пристегнуты:\n" +
            "1. " +
            "Только водитель\n" +
            "2. " +
            "Водитель и пассажир на переднем сиденье\n" +
            "3. " +
            "Все лица, находящиеся в автомобиле";
    public final String FTC4Help = "При движении на легковом автомобиле, оборудованном ремнями безопасности, должны быть пристегнуты:\n" +
            "1. " +
            "Только водитель\n" +
            "2. " +
            "Водитель и пассажир на переднем сиденье\n" +
            "3. " +
            "Все лица, находящиеся в автомобиле\n\n" +
            "Правильный ответ: 3\n" +
            "При движении на транспортном средстве, оборудованном ремнями безопасности, водитель должен быть " +
            "пристегнутым и не перевозить пассажиров, не пристегнутых ремнями. Правильный ответ – все лица, находящиеся в автомобиле. ";
    public final String FTC5 = "Обязан ли водитель предоставить транспортное средство медицинским и фармацевтическим " +
            "работникам для перевозки граждан в ближайшее лечебно-профилактическое учреждение в случаях, угрожающих их жизни?\n" +
            "1. " +
            "Обязан\n" +
            "2. " +
            "Обязан только при движении в попутном направлении\n" +
            "3. " +
            "Не обязан";
    public final String FTC5Help = "Обязан ли водитель предоставить транспортное средство медицинским и фармацевтическим " +
            "работникам для перевозки граждан в ближайшее лечебно-профилактическое учреждение в случаях, угрожающих их жизни?\n" +
            "1. " +
            "Обязан\n" +
            "2. " +
            "Обязан только при движении в попутном направлении\n" +
            "3. " +
            "Не обязан\n\n" +
            "Правильный ответ: 1\n" +
            "Оказывать такую транспортную услугу медицинским и фармацевтическим работникам обязывает пункт 2.3.3 ПДД.";
}
