package main.topicTickets.caption;

public class RoadMarksCaption {
    public final String FTP1 = "https://s.drom.ru/i24227/pdd/tickets/2016/1542608354.jpg";
    public final String FTP2 = "https://s.drom.ru/i24227/pdd/tickets/2016/1542608218.jpg";
    public final String FTP3 = "https://s.drom.ru/i24227/pdd/tickets/2016/1542608240.jpg";
    public final String FTP4 = "https://s.drom.ru/i24227/pdd/tickets/2016/1542608265.jpg";
    public final String FTP5 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Разрешено ли Вам произвести остановку в указанном месте?\n" +
            "1. " +
            "Разрешено\n" +
            "2. " +
            "Разрешено только для посадки или высадки пассажиров\n" +
            "3. " +
            "Запрещено";
    public final String FTC1Help = "Разрешено ли Вам произвести остановку в указанном месте?\n" +
            "1. " +
            "Разрешено\n" +
            "2. " +
            "Разрешено только для посадки или высадки пассажиров\n" +
            "3. " +
            "Запрещено\n\n" +
            "Правильный ответ: 1\n" +
            "Сплошная линия разметки 1.4 жёлтого цвета обозначает места, где запрещена остановка. " +
            "Применяется самостоятельно или в сочетании со знаком 3.27 «Остановка запрещена», как в данном случае. В указанном месте Вы можете произвести остановку";
    public final String FTC2 = "Вы намерены повернуть налево. Где остановиться, чтобы уступить дорогу легковому автомобилю: \n\n" +
            "1. Перед знаком. \n" +
            "2. Перед знаком у линии разметки. \n" +
            "3. На перекрестке перед прерывистой линией разметки. \n" +
            "4. В любом месте по усмотрению водителя. ";
    public final String FTC2Help = "Вы намерены повернуть налево. Где остановиться, чтобы уступить дорогу легковому автомобилю: \n\n" +
            "1. Перед знаком. \n" +
            "2. Перед знаком у линии разметки. \n" +
            "3. На перекрестке перед прерывистой линией разметки. \n" +
            "4. В любом месте по усмотрению водителя. \n\n" +
            "Правильный ответ: 2\n" +
            "Согласно знаку 2.4 «Уступите дорогу» водители должны пропускать транспорт, движущийся по пересекаемой дороге. " +
            "Разметка 1.13 в виде треугольников указывает место, где при необходимости следует остановиться. " +
            "У Вас такая необходимость есть, так как при повороте налево Вы уступаете дорогу легковому автомобилю.";
    public final String FTC3 = "Разрешен ли Вам выезд на полосу с реверсивным движением, если реверсивный светофор выключен?\n" +
            "1. " +
            "Разрешен\n" +
            "2. " +
            "Разрешен, если скорость автобуса менее 30 км/ч\n" +
            "3. " +
            "Запрещен";
    public final String FTC3Help = "Разрешен ли Вам выезд на полосу с реверсивным движением, если реверсивный светофор выключен?\n" +
            "1. " +
            "Разрешен\n" +
            "2. " +
            "Разрешен, если скорость автобуса менее 30 км/ч\n" +
            "3. " +
            "Запрещен\n\n" +
            "Правильный ответ: 3\n" +
            "При выключенных сигналах реверсивного светофора, который расположен над полосой, обозначенной с обеих сторон разметкой 1.9, въезд на эту полосу запрещен. (Пункт 6.7 ПДД)";
    public final String FTC4 = "Можно ли Вам остановиться в этом месте для посадки или высадки пассажиров?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно, если при этом не будут созданы помехи движению маршрутных транспортных средств\n" +
            "3. " +
            "Нельзя";
    public final String FTC4Help = "Можно ли Вам остановиться в этом месте для посадки или высадки пассажиров?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно, если при этом не будут созданы помехи движению маршрутных транспортных средств\n" +
            "3. " +
            "Нельзя\n\n" +
            "Правильный ответ: 2\n" +
            "В данном случае место остановки маршрутных транспортных средств обозначено соответствующим знаком и жёлтой зигзагообразной разметкой 1.17. " +
            "Остановка в указанном месте допускается, " +
            "если Вы произведёте ее для посадки или высадки пассажиров и в это время не создадите помех движению маршрутных транспортных средств.";
    public final String FTC5 = "Что означает разметка в виде надписи «СТОП» на проезжей части?\n" +
            "1. " +
            "Предупреждает о приближении к стоп-линии перед регулируемым перекрёстком\n" +
            "2. " +
            "Предупреждает о приближении к стоп-линии и знаку «Движение без остановки запрещено»\n" +
            "3. " +
            "Предупреждает о приближении к знаку «Уступите дорогу»";
    public final String FTC5Help = "Что означает разметка в виде надписи «СТОП» на проезжей части?\n" +
            "1. " +
            "Предупреждает о приближении к стоп-линии перед регулируемым перекрёстком\n" +
            "2. " +
            "Предупреждает о приближении к стоп-линии и знаку «Движение без остановки запрещено»\n" +
            "3. " +
            "Предупреждает о приближении к знаку «Уступите дорогу»\n\n" +
            "Правильный ответ: 2\n" +
            "Разметка 1.21 (надпись «СТОП») предупреждает о приближении к стоп-линии (разметке 1.12), когда она применяется в сочетании со знаком 2.5 «Движение без остановки запрещено».";
}
