package main.topicTickets.caption;

public class RoadSignsCaption {
    public final String FTP1 = "https://s.drom.ru/i24227/pdd/tickets/2016/1542608421.jpg";
    public final String FTP2 = "https://s.drom.ru/i24227/pdd/tickets/2016/1542608442.jpg";
    public final String FTP3 = "https://s.drom.ru/i24227/pdd/tickets/2016/1542608467.jpg";
    public final String FTP4 = "https://s.drom.ru/i24227/pdd/tickets/2016/1542608493.jpg";
    public final String FTP5 = "https://s.drom.ru/i24227/pdd/tickets/2016/1542608516.jpg";


    public final String FTC1 = "Какие из указанных знаков распространяют своё действие только на период времени, когда покрытие проезжей части влажное?\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "А и Б\n" +
            "3. " +
            "Все";
    public final String FTC1Help = "Какие из указанных знаков распространяют своё действие только на период времени, когда покрытие проезжей части влажное?\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "А и Б\n" +
            "3. " +
            "Все\n\n" +
            "Правильный ответ: 1\n" +
            "Только комбинация знаков «А» - 3.24 «Ограничение максимальной скорости» с табличкой 8.16 «Влажное покрытие», указывающей, " +
            "что действие знака распространяется на период, когда покрытие проезжей части влажное - является правильным ответом";
    public final String FTC2 = "Двигаясь в населенном пункте, вы можете продолжить движение:\n" +
            "1. " +
            "Только в направлении Б\n" +
            "2. " +
            "В направлениях А или Б\n" +
            "3. " +
            "В любом направлении из указанных";
    public final String FTC2Help = "Двигаясь в населенном пункте, вы можете продолжить движение:\n" +
            "1. " +
            "Только в направлении Б\n" +
            "2. " +
            "В направлениях А или Б\n" +
            "3. " +
            "В любом направлении из указанных\n\n" +
            "Правильный ответ: 1\n" +
            "Знак 4.1.4 «Движение прямо или направо» распространяет свое действие на первое пересечение проезжих частей, перед которыми он установлен. " +
            "От действия знака могут отступать маршрутные транспортные средства";
    public final String FTC3 = "Этот знак:\n" +
            "1. " +
            "Предупреждает Вас о наличии узкого участка дороги, но не устанавливает очередность движения\n" +
            "2. " +
            "Запрещает Вам проезд через мост\n" +
            "3. " +
            "Обязывает Вас уступить дорогу встречному транспортному средству";
    public final String FTC3Help = "Этот знак:\n" +
            "1. " +
            "Предупреждает Вас о наличии узкого участка дороги, но не устанавливает очередность движения\n" +
            "2. " +
            "Запрещает Вам проезд через мост\n" +
            "3. " +
            "Обязывает Вас уступить дорогу встречному транспортному средству\n\n" +
            "Правильный ответ: 3\n" +
            "Знак 2.6 «Преимущество встречного движения» запрещает выезд на узкий участок дороги, если это может затруднить встречное движение. " +
            "Поэтому Вам следует уступить дорогу грузовику, подъезжающему к мосту. ";
    public final String FTC4 = "Как следует поступить, если Вам необходимо развернуться?\n" +
            "1. " +
            "Развернуться на этом перекрёстке при отсутствии на нём других транспортных средств\n" +
            "2. " +
            "Проехать прямо и развернуться за перекрёстком\n" +
            "3. " +
            "Проехать прямо и развернуться только на следующем перекрёстке";
    public final String FTC4Help = "Как следует поступить, если Вам необходимо развернуться?\n" +
            "1. " +
            "Развернуться на этом перекрёстке при отсутствии на нём других транспортных средств\n" +
            "2. " +
            "Проехать прямо и развернуться за перекрёстком\n" +
            "3. " +
            "Проехать прямо и развернуться только на следующем перекрёстке\n\n" +
            "Правильный ответ: 2\n" +
            "Действие знака 4.1.1 «Движение прямо», установленного перед пересечением проезжих частей, распространяется на первое пересечение за знаком. " +
            "В данном случае действует на весь перекрёсток. " +
            "Поэтому, если Вы решили развернуться, Вам ничего не остаётся, как проехать перекрёсток и развернуться на последующем за ним участке дороги, т.е. за перекрестком.";
    public final String FTC5 = "О чем предупреждают Вас эти знаки:\n" +
            "1. " +
            "Остановка транспортных средств на обочине запрещена\n" +
            "2. " +
            "Съезд на обочину опасен в связи с проведением на ней дорожных работ\n" +
            "3. " +
            "В месте производства дорожных работ стоянка запрещена";
    public final String FTC5Help = "О чем предупреждают Вас эти знаки:\n" +
            "1. " +
            "Остановка транспортных средств на обочине запрещена\n" +
            "2. " +
            "Съезд на обочину опасен в связи с проведением на ней дорожных работ\n" +
            "3. " +
            "В месте производства дорожных работ стоянка запрещена\n\n" +
            "Правильный ответ: 2\n" +
            "Знак 1.25 «Дорожные работы» в сочетании с табличкой 8.12 «Опасная обочина» предупреждает водителей, что съезд на обочину опасен в связи с проведением на ней дорожных (ремонтных) работ.";

}
