package main.topicTickets.caption;

public class SafeDriveCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Вопрос 1.\n" +
            "Как следует поступить водителю при высадке из автомобиля, стоящего у тротуара или на обочине?\n" +
            "1. " +
            "Обойти автомобиль спереди\n" +
            "2. " +
            "Обойти автомобиль сзади\n" +
            "3. " +
            "Допустимы оба варианта действий";
    public final String FTC1Help = "Вопрос 1.\n" +
            "Как следует поступить водителю при высадке из автомобиля, стоящего у тротуара или на обочине?\n" +
            "1. " +
            "Обойти автомобиль спереди\n" +
            "2. " +
            "Обойти автомобиль сзади\n" +
            "3. " +
            "Допустимы оба варианта действий\n\n" +
            "Правильный ответ: 2\n" +
            "Правила не регламентируют действия водителя при его высадке из автомобиля. Но учитывая условия обеспечения " +
            "безопасности дорожного движения в подобных ситуациях в большинстве случаев следует обойти автомобиль сзади, " +
            "чтобы иметь возможность видеть ТС, движущиеся в попутном направлении. " +
            "Главное условие безопасности при выходе из автомобиля в подобных ситуациях – действия водителя и других лиц " +
            "не должны быть неожиданностью для других водителей.";
    public final String FTC2 = "Двигаться по глубокому снегу на грунтовой дороге следует:\n" +
            "1. " +
            "Изменяя скорость движения и передачу в зависимости от состояния дороги\n" +
            "2. " +
            "На заранее выбранной пониженной передаче, без резких поворотов и остановок\n" +
            "3. " +
            "На заранее выбранной повышенной передаче, без резких поворотов и остановок";
    public final String FTC2Help = "Двигаться по глубокому снегу на грунтовой дороге следует:\n" +
            "1. " +
            "Изменяя скорость движения и передачу в зависимости от состояния дороги\n" +
            "2. " +
            "На заранее выбранной пониженной передаче, без резких поворотов и остановок\n" +
            "3. " +
            "На заранее выбранной повышенной передаче, без резких поворотов и остановок\n\n" +
            "Правильный ответ: 2\n" +
            "Если и дорога, и снежный покров ровные, а участок дороги продолжительный, то следует двигаться на пониженной передаче.";
    public final String FTC3 = "Двигаясь в прямом направлении, Вы внезапно попали на небольшой участок скользкой дороги. Что следует предпринять?\n" +
            "1. " +
            "Плавно затормозить\n" +
            "2. " +
            "Повернуть руль, чтобы съехать с этого участка дороги\n" +
            "3. " +
            "Не менять траектории и скорости движения";
    public final String FTC3Help = "Двигаясь в прямом направлении, Вы внезапно попали на небольшой участок скользкой дороги. Что следует предпринять?\n" +
            "1. " +
            "Плавно затормозить\n" +
            "2. " +
            "Повернуть руль, чтобы съехать с этого участка дороги\n" +
            "3. " +
            "Не менять траектории и скорости движения\n\n" +
            "Правильный ответ: 3\n" +
            "Если это действительно небольшой участок дороги, то необходимо не менять траекторию и скорость, чтобы избежать возникновения заноса.";
    public final String FTC4 = "Как влияет длительный разгон транспортного средства с включенной первой передачей на расход топлива?\n" +
            "1. " +
            "Расход топлива увеличивается\n" +
            "2. " +
            "Расход топлива не изменяется\n" +
            "3. " +
            "Расход топлива уменьшается";
    public final String FTC4Help = "Как влияет длительный разгон транспортного средства с включенной первой передачей на расход топлива?\n" +
            "1. " +
            "Расход топлива увеличивается\n" +
            "2. " +
            "Расход топлива не изменяется\n" +
            "3. " +
            "Расход топлива уменьшается\n\n" +
            "Правильный ответ: 1\n" +
            "Движение без необходимости на пониженных передачах увеличивает расход топлива.";
    public final String FTC5 = "Как следует выбирать передачу при торможении двигателем с учетом крутизны спуска?\n" +
            "1. " +
            "Чем круче спуск, тем выше передача\n" +
            "2. " +
            "Чем круче спуск, тем ниже передача\n" +
            "3. " +
            "Выбор передачи не зависит от крутизны спуска";
    public final String FTC5Help = "Как следует выбирать передачу при торможении двигателем с учетом крутизны спуска?\n" +
            "1. " +
            "Чем круче спуск, тем выше передача\n" +
            "2. " +
            "Чем круче спуск, тем ниже передача\n" +
            "3. " +
            "Выбор передачи не зависит от крутизны спуска\n\n" +
            "Правильный ответ: 2\n" +
            "Такую зависимость эффективности торможения водитель может использовать на крутых спусках, на автомобиле, " +
            "имеющем механическую коробку перемены передач или перейти в ручной режим для выбора передачи на автоматизированных КПП.";
}
