package main.topicTickets.caption;

public class SpecialSignalsCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP2 = "https://imgur.com/Htt0ukD";
    public final String FTP3 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP4 = "https://imgur.com/PG6D3FA";
    public final String FTP5 = "https://imgur.com/lI7eTlB";

    public final String FTC1 = "В каких случаях необходимо уступить дорогу транспортному средству, имеющему нанесенные " +
            "на наружные поверхности специальные цветографические схемы?\n" +
            "1. " +
            "Если его водитель включил проблесковый маячок синего цвета и специальный звуковой сигнал\n" +
            "2. " +
            "Если его водитель включил проблесковый маячок синего цвета\n" +
            "3. " +
            "Во всех случаях";
    public final String FTC1Help = "В каких случаях необходимо уступить дорогу транспортному средству," +
            "имеющему нанесенные на наружные поверхности специальные цветографические схемы?\n" +
            "1. " +
            "Если его водитель включил проблесковый маячок синего цвета и специальный звуковой сигнал\n" +
            "2. " +
            "Если его водитель включил проблесковый маячок синего цвета\n" +
            "3. " +
            "Во всех случаях\n\n" +
            "Правильный ответ: 1\n" +
            "Для получения преимущества «оперативник» должен включить проблесковый маячок синего цвета " +
            "и специальный звуковой сигнал. (Пункт 3.1 ПДД)";
    public final String FTC2 = "Как следует поступить водителю легкового автомобиля при приближении автомобиля оперативной службы?\n" +
            "1. " +
            "Продолжить движение по левой полосе\n" +
            "2. " +
            "Перестроиться на правую полосу\n" +
            "3. " +
            "Остановиться справа у тротуара";
    public final String FTC2Help = "Как следует поступить водителю легкового автомобиля при приближении автомобиля оперативной службы?\n" +
            "1. " +
            "Продолжить движение по левой полосе\n" +
            "2. " +
            "Перестроиться на правую полосу\n" +
            "3. " +
            "Остановиться справа у тротуара\n\n" +
            "Правильный ответ: 2\n" +
            "Автомобилям оперативной службы, едущим с включенным проблесковым маячком синего цвета и специальным звуковым " +
            "сигналом, следует " +
            "уступать дорогу, обеспечив беспрепятственный проезд. Водителю легкового автомобиля следует перестроиться на " +
            "правую полосу и продолжить движение. (Пункт 3.2 ПДД)";
    public final String FTC3 = "Преимущество перед другими участниками движения имеет водитель автомобиля:\n" +
            "1. " +
            "Только с включенным проблесковым маячком синего или бело-лунного цвета\n" +
            "2. " +
            "Только с включенным проблесковым маячком оранжевого или желтого цвета\n" +
            "3. " +
            "Только с включенными проблесковым маячком синего (синего и красного) цвета и специальным звуковым сигналом\n" +
            "4. " +
            "Любого из перечисленных";
    public final String FTC3Help = "Преимущество перед другими участниками движения имеет водитель автомобиля:\n" +
            "1. " +
            "Только с включенным проблесковым маячком синего или бело-лунного цвета\n" +
            "2. " +
            "Только с включенным проблесковым маячком оранжевого или желтого цвета\n" +
            "3. " +
            "Только с включенными проблесковым маячком синего (синего и красного) цвета и специальным звуковым сигналом\n\n" +
            "4. " +
            "Любого из перечисленных\n\n" +
            "Правильный ответ: 3\n" +
            "Для получения преимущества «оперативное» транспортное средство должно " +
            "обязательно применить сочетание проблескового маячка синего цвета или синего и красного и специального звукового сигнала. (Пункт 3.1 ПДД)";
    public final String FTC4 = "При движении в каком направлении Вы должны уступить дорогу автомобилю с включенными " +
            "проблесковым маячком и специальным звуковым сигналом?\n" +
            "1. " +
            "Только налево\n" +
            "2. " +
            "Налево и в обратном направлении\n" +
            "3. " +
            "В любом";
    public final String FTC4Help = "При движении в каком направлении Вы должны уступить дорогу автомобилю с включенными " +
            "проблесковым маячком и специальным звуковым сигналом?\n" +
            "1. " +
            "Только налево\n" +
            "2. " +
            "Налево и в обратном направлении\n" +
            "3. " +
            "В любом\n\n" +
            "Правильный ответ: 3\n" +
            "Вы обязаны обеспечить беспрепятственный проезд перекрёстка «оперативнику» с включенными специальными " +
            "сигналами независимо от направления его движения. Сделать это необходимо при движении в любом направлении. (Пункты 3.1, 3.2 ПДД)";
    public final String FTC5 = "В каком случае Вы должны будете уступить дорогу автомобилю ДПС?\n" +
            "1. " +
            "Если на автомобиле ДПС будут включены проблесковые маячки синего цвета\n" +
            "2. " +
            "Если на автомобиле ДПС одновременно будут включены проблесковые маячки синего цвета и специальный звуковой сигнал\n" +
            "3. " +
            "В любом";
    public final String FTC5Help = "В каком случае Вы должны будете уступить дорогу автомобилю ДПС?\n" +
            "1. " +
            "Если на автомобиле ДПС будут включены проблесковые маячки синего цвета\n" +
            "2. " +
            "Если на автомобиле ДПС одновременно будут включены проблесковые маячки синего цвета и специальный звуковой сигнал\n" +
            "3. " +
            "В любом\n\n" +
            "Правильный ответ: 2\n" +
            "В данном случае Вы должны уступить дорогу «оперативнику», " +
            "если на данном автомобиле одновременно будут включены проблесковые маячки синего цвета и специальный звуковой сигнал. (Пункт 3.2 ПДД)";
}
