package main.topicTickets.caption;

public class SpeedCaption {
    public final String FTP1 = "https://imgur.com/YbIfWJT";
    public final String FTP2 = "https://imgur.com/4fpgGmS";
    public final String FTP3 = "https://imgur.com/hvSP8eK";
    public final String FTP4 = "https://imgur.com/hlTfJKc";
    public final String FTP5 = "https://imgur.com/r8ZLVI8";

    public final String FTC1 = "На грузовом автомобиле с разрешенной максимальной массой не более 3,5 т можно двигаться со скоростью:\n" +
            "1. " +
            "Не более 50 км/ч\n" +
            "2. " +
            "Не более 70 км/ч\n" +
            "3. " +
            "Не более 90 км/ч";
    public final String FTC1Help = "На грузовом автомобиле с разрешенной максимальной массой не более 3,5 т можно двигаться со скоростью:\n" +
            "1. " +
            "Не более 50 км/ч\n" +
            "2. " +
            "Не более 70 км/ч\n" +
            "3. " +
            "Не более 90 км/ч\n\n" +
            "Правильный ответ: 3\n" +
            "Табличка под знаком 8.4.1 «Вид транспортного средства» распространяет действие знака на грузовые автомобили, " +
            "в том числе с прицепом, с разрешённой максимальной массой более 3,5 т. Ваш автомобиль к ним не относится, продолжаете движение с разрешённой " +
            "Вам скоростью – не более 90 км/ч, так как действие происходит вне населённого пункта. («Дорожные знаки», пункт 10.3 ПДД)";
    public final String FTC2 = "С какой максимальной скоростью Вы имеете право продолжить движение на легковом автомобиле с прицепом вне населенного пункта?\n" +
            "1. " +
            "50 км/ч\n" +
            "2. " +
            "60 км/ч\n" +
            "3. " +
            "70 км/ч\n" +
            "4. " +
            "80 км/ч";
    public final String FTC2Help = "С какой максимальной скоростью Вы имеете право продолжить движение на легковом автомобиле с прицепом вне населенного пункта?\n" +
            "1. " +
            "50 км/ч\n" +
            "2. " +
            "60 км/ч\n" +
            "3. " +
            "70 км/ч\n" +
            "4. " +
            "80 км/ч\n\n" +
            "Правильный ответ: 3\n" +
            "Вне населённого пункта на дорогах, кроме автомагистралей, легковому автомобилю с прицепом разрешается движение со скоростью не более 70 км/ч. (Пункт 10.3 ПДД).";
    public final String FTC3 = "С какой максимальной скоростью Вы имеете право продолжить движение на легковом автомобиле?\n" +
            "1. " +
            "70 км/ч\n" +
            "2. " +
            "90 км/ч\n" +
            "3. " +
            "110 км/ч";
    public final String FTC3Help = "С какой максимальной скоростью Вы имеете право продолжить движение на легковом автомобиле?\n" +
            "1. " +
            "70 км/ч\n" +
            "2. " +
            "90 км/ч\n" +
            "3. " +
            "110 км/ч\n\n" +
            "Правильный ответ: 3\n" +
            "На автомагистрали разрешается более скоростное движение. При этом допустимая максимальная скорость равна 110 км/ч. («Дорожные знаки» 5.1. «Автомагистраль», пункт 10.3 ПДД)";
    public final String FTC4 = "С какой скоростью Вы имеете право продолжить движение в населённом пункте по правой полосе?\n" +
            "1. " +
            "Не более 40 км/ч\n" +
            "2. " +
            "Не более 60 км/ч\n" +
            "3. " +
            "Не менее 40 км/ч и не более 60 км/ч";
    public final String FTC4Help = "С какой скоростью Вы имеете право продолжить движение в населённом пункте по правой полосе?\n" +
            "1. " +
            "Не более 40 км/ч\n" +
            "2. " +
            "Не более 60 км/ч\n" +
            "3. " +
            "Не менее 40 км/ч и не более 60 км/ч\n\n" +
            "Правильный ответ: 2\n" +
            "Предел минимальной скорости согласно табличке распространяется только на левую полосу. " +
            "По правой полосе осуществляется обычный скоростной режим для населённых пунктов – не более 60 км/ч. " +
            "(«Дорожные знаки», пункт 10.2 ПДД)";
    public final String FTC5 = "С какой максимальной скоростью Вы имеете право продолжить движение на легковом автомобиле?\n" +
            "1. " +
            "60 км/ч\n" +
            "2. " +
            "70 км/ч\n" +
            "3. " +
            "90 км/ч\n" +
            "4. " +
            "110 км/ч";
    public final String FTC5Help = "С какой максимальной скоростью Вы имеете право продолжить движение на легковом автомобиле?\n" +
            "1. " +
            "60 км/ч\n" +
            "2. " +
            "70 км/ч\n" +
            "3. " +
            "90 км/ч\n" +
            "4. " +
            "110 км/ч\n\n" +
            "Правильный ответ: 3\n" +
            "Наименование населённого пункта обозначено знаком с синим фоном. Это значит, на данном участке дороги не действуют пункты Правил, " +
            "устанавливающие порядок движения в населённых пунктах. Можете продолжить движение со скоростью не более 90 км/ч.";
}
