package main.topicTickets.caption;

public class TowCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Можно ли буксировать автомобиль с недействующей тормозной системой, " +
            "если фактическая масса этого автомобиля превышает половину фактической массы Вашего автомобиля?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно только при скорости буксировки не более 30 км/ч\n" +
            "3. " +
            "Нельзя";
    public final String FTC1Help = "Можно ли буксировать автомобиль с недействующей тормозной системой, если фактическая масса этого " +
            "автомобиля превышает половину фактической массы Вашего автомобиля?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно только при скорости буксировки не более 30 км/ч\n" +
            "3. " +
            "Нельзя\n\n" +
            "Правильный ответ: 3\n" +
            "Запрещается буксировать автомобиль с недействующей тормозной системой на гибкой сцепке, на жесткой сцепке, путём частичной погрузки - " +
            "во всех случаях, если фактическая масса буксируемого ПРЕВЫШАЕТ ПОЛОВИНУ фактической массы Вашего автомобиля (буксирующего). (Пункт 20.4 ПДД)";
    public final String FTC2 = "Разрешено ли перевозить людей в буксируемом легковом автомобиле?\n" +
            "1. " +
            "Разрешено\n" +
            "2. " +
            "Разрешено только при буксировке на гибкой или жесткой сцепке\n" +
            "3. " +
            "Запрещено";
    public final String FTC2Help = "Разрешено ли перевозить людей в буксируемом легковом автомобиле?\n" +
            "1. " +
            "Разрешено\n" +
            "2. " +
            "Разрешено только при буксировке на гибкой или жесткой сцепке\n" +
            "3. " +
            "Запрещено\n\n" +
            "Правильный ответ: 2\n" +
            "Перевозить людей в буксируемом легковом автомобиле разрешено только при буксировке на гибкой или жесткой сцепке. (Пункт 20.2 ПДД)";
    public final String FTC3 = "При буксировке на гибкой сцепке между буксирующим и буксируемым транспортными средствами должно быть обеспечено расстояние:\n" +
            "1. " +
            "Не более 4 м\n" +
            "2. " +
            "От 4 до 6 м\n" +
            "3. " +
            "От 6 до 8 м";
    public final String FTC3Help = "При буксировке на гибкой сцепке между буксирующим и буксируемым транспортными средствами должно быть обеспечено расстояние:\n" +
            "1. " +
            "Не более 4 м\n" +
            "2. " +
            "От 4 до 6 м\n" +
            "3. " +
            "От 6 до 8 м\n\n" +
            "Правильный ответ: 2\n" +
            "При буксировке на гибкой сцепке должно быть обеспечено расстояние между буксирующим и буксируемым транспортными средствами в пределах 4 – 6 м. (Пункт 20.3 ПДД)";
    public final String FTC4 = "Разрешается ли буксировка в гололедицу, если у буксируемого транспортного средства исправны тормоза и рулевое управление?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только на жёсткой сцепке или методом частичной погрузки\n" +
            "3. " +
            "Запрещается";
    public final String FTC4Help = "Разрешается ли буксировка в гололедицу, если у буксируемого транспортного средства исправны тормоза и рулевое управление?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только на жёсткой сцепке или методом частичной погрузки\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 2\n" +
            "Буксировка в гололедицу на гибкой сцепке при любых обстоятельствах запрещается. Не запрещается буксировка методом частичной погрузки или на жёсткой сцепке. (Пункт 20.4 ПДД)";
    public final String FTC5 = "Разрешается ли перевозка людей в салоне легкового автомобиля, буксирующего неисправное транспортное средство?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только при буксировке на жёсткой сцепке\n" +
            "3. " +
            "Запрещается";
    public final String FTC5Help = "Разрешается ли перевозка людей в салоне легкового автомобиля, буксирующего неисправное транспортное средство?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается только при буксировке на жёсткой сцепке\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 1\n" +
            "Пунктом 20.2 ПДД перевозка людей в салоне легкового автомобиля, буксирующего неисправное транспортное средство не запрещается, т. е. – разрешается.";
}
