package main.topicTickets.caption;

public class TrafficSignalsCaption {
    public final String FTP1 = "https://imgur.com/mWX2dbi";
    public final String FTP2 = "https://imgur.com/z0rTRog";
    public final String FTP3 = "https://imgur.com/59oNIlC";
    public final String FTP4 = "https://imgur.com/bQ5d7c1";
    public final String FTP5 = "https://imgur.com/UW371EE";


    public final String FTC1 = "Разрешается ли Вам перестроиться?\n" +
            "1. " +
            "Разрешается только на соседнюю полосу\n" +
            "2. " +
            "Разрешается, если скорость грузового автомобиля менее 30 км/ч\n" +
            "3. " +
            "Запрещается";
    public final String FTC1Help = "Разрешается ли Вам перестроиться?\n" +
            "1. " +
            "Разрешается только на соседнюю полосу\n" +
            "2. " +
            "Разрешается, если скорость грузового автомобиля менее 30 км/ч\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 1\n" +
            "Реверсивные светофоры выключены. Двойная прерывистая линия разметки 1.9 разделяет транспортные потоки противоположных направлений. " +
            "Прерывистую линию разметки 1.5, находящуюся слева пересекать не запрещается, поэтому Вам можно перестроиться на левую (соседнюю) " +
            "полосу и продолжить движение по ней.";
    public final String FTC2 = "Каким транспортным средствам разрешено движение прямо?\n" +
            "1. " +
            "Только грузовому автомобилю\n" +
            "2. " +
            "Легковому и грузовому автомобилям\n" +
            "3. " +
            "Грузовому автомобилю и автобусу\n" +
            "4. " +
            "Всем перечисленным транспортным средствам";
    public final String FTC2Help = "Каким транспортным средствам разрешено движение прямо?\n" +
            "1. " +
            "Только грузовому автомобилю\n" +
            "2. " +
            "Легковому и грузовому автомобилям\n" +
            "3. " +
            "Грузовому автомобилю и автобусу\n" +
            "4. " +
            "Всем перечисленным транспортным средствам\n\n" +
            "Правильный ответ: 1\n" +
            "Перекрёсток регулируемый. С данной проезжей части осуществляется регулирование по полосам. " +
            "Красный сигнал крайнего правого светофора запрещает движение с крайней правой полосы. " +
            "Со средней полосы разрешается движение прямо. С крайней левой полосы разрешается движение налево и разворот. " +
            "При таких сигналах светофора разрешено движение прямо только грузовому автомобилю.";
    public final String FTC3 = "Вам разрешается движение:\n" +
            "1. " +
            "Только прямо\n" +
            "2. " +
            "Прямо и направо\n" +
            "3. " +
            "В любом направлении";
    public final String FTC3Help = "Вам разрешается движение:\n" +
            "1. " +
            "Только прямо\n" +
            "2. " +
            "Прямо и направо\n" +
            "3. " +
            "В любом направлении\n\n" +
            "Правильный ответ: 2\n" +
            "При наличии регулировщика, сигналы светофора «не работают» Со стороны левого бока при вытянутой правой руке " +
            "регулировщика безрельсовым транспортным средствам разрешается движение во всех направлениях. Но, т.к. Вы находитесь на правой полосе, " +
            "Вам разрешается движение только прямо или направо.";
    public final String FTC4 = "В каких направлениях регулировщик разрешает Вам движение?\n" +
            "1. " +
            "Только прямо\n" +
            "2. " +
            "Прямо и направо\n" +
            "3. " +
            "Во всех направлениях";
    public final String FTC4Help = "В каких направлениях регулировщик разрешает Вам движение?\n" +
            "1. " +
            "Только прямо\n" +
            "2. " +
            "Прямо и направо\n" +
            "3. " +
            "Во всех направлениях\n\n" +
            "Правильный ответ: 2\n" +
            "Безрельсовым транспортным средствам при таком положении регулировщика со стороны левого и правого бока разрешается движение прямо и направо. " +
            "«Грудь, спина – стена» - движение запрещено всем со стороны груди и спины. (Пункт 6.10 ПДД)";
    public final String FTC5 = "В каком месте Вам следует остановиться?\n" +
            "1. " +
            "Перед светофором\n" +
            "2. " +
            "Перед пересекаемой проезжей частью\n" +
            "3. " +
            "В любом из перечисленных";
    public final String FTC5Help = "В каком месте Вам следует остановиться?\n" +
            "1. " +
            "Перед светофором\n" +
            "2. " +
            "Перед пересекаемой проезжей частью\n" +
            "3. " +
            "В любом из перечисленных\n\n" +
            "Правильный ответ: 1\n" +
            "Знак 6.16 «Стоп-линия» указывает место остановки транспортных средств при запрещающем сигнале светофора (регулировщика). " +
            "Вам «горит красный» - останавливаетесь перед светофором. («Дорожные знаки», пункт 6.2 ПДД)";
}
