package main.topicTickets.caption;

public class TrainingBicycleCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Какое оборудование должно иметь механическое транспортное средство, используемое для обучения вождению?\n" +
            "1. " +
            "Дополнительные педали привода сцепления (кроме транспортных средств с автоматической трансмиссией) и тормоза\n" +
            "2. " +
            "Зеркало заднего вида для обучающего вождению\n" +
            "3. " +
            "Опознавательные знаки «Учебное транспортное средство»\n" +
            "4. " +
            "Все перечисленное оборудование";
    public final String FTC1Help = "Какое оборудование должно иметь механическое транспортное средство, используемое для обучения вождению?\n" +
            "1. " +
            "Дополнительные педали привода сцепления (кроме транспортных средств с автоматической трансмиссией) и тормоза\n" +
            "2. " +
            "Зеркало заднего вида для обучающего вождению\n" +
            "3. " +
            "Опознавательные знаки «Учебное транспортное средство»\n" +
            "4. " +
            "Все перечисленное оборудование\n\n" +
            "Правильный ответ: 4\n" +
            "Правильный ответ – все перечисленное оборудование, согласно Пункта 21.5 ПДД и Пункта 5 Основных положений по допуску";
    public final String FTC2 = "В каких случаях водители мопедов нарушают Правила?\n" +
            "1. " +
            "Только если управляют мопедом, не держась за руль хотя бы одной рукой\n" +
            "2. " +
            "Только если двигаются по дороге без застегнутого мотошлема\n" +
            "3. " +
            "В обоих перечисленных случаях";
    public final String FTC2Help = "В каких случаях водители мопедов нарушают Правила?\n" +
            "1. " +
            "Только если управляют мопедом, не держась за руль хотя бы одной рукой\n" +
            "2. " +
            "Только если двигаются по дороге без застегнутого мотошлема\n" +
            "3. " +
            "В обоих перечисленных случаях\n\n" +
            "Правильный ответ: 3\n" +
            "Водителям мопедов запрещается: – управлять мопедом не держать за руль хотя бы одной рукой; " +
            "– двигаться по дороге без застегнутого мотошлема. Правильный ответ - в обоих перечисленных случаях. (Пункт 24.8 ПДД)";
    public final String FTC3 = "Водителям мопедов разрешено двигаться:\n" +
            "1. " +
            "Только по правому краю проезжей части в один ряд\n" +
            "2. " +
            "Только по обочине, если не создаются помехи пешеходам\n" +
            "3. " +
            "Только по полосе для велосипедистов\n" +
            "4. " +
            "Во всех перечисленных случаях";
    public final String FTC3Help = "Водителям мопедов разрешено двигаться:\n" +
            "1. " +
            "Только по правому краю проезжей части в один ряд\n" +
            "2. " +
            "Только по обочине, если не создаются помехи пешеходам\n" +
            "3. " +
            "Только по полосе для велосипедистов\n" +
            "4. " +
            "Во всех перечисленных случаях\n\n" +
            "Правильный ответ: 4\n" +
            "Водителям мопедов разрешено двигаться во всех перечисленных случаях. (Пункт 24.7 ПДД)";
    public final String FTC4 = "Водителям мопедов запрещается поворачивать налево или разворачиваться:\n" +
            "1. " +
            "Только при движении по дороге с трамвайным движением\n" +
            "2. " +
            "Только при движении по дороге, имеющей более одной полосы для движения в данном направлении\n" +
            "3. " +
            "В обоих перечисленных случаях";
    public final String FTC4Help = "Водителям мопедов запрещается поворачивать налево или разворачиваться:\n" +
            "1. " +
            "Только при движении по дороге с трамвайным движением\n" +
            "2. " +
            "Только при движении по дороге, имеющей более одной полосы для движения в данном направлении\n" +
            "3. " +
            "В обоих перечисленных случаях\n\n" +
            "Правильный ответ: 3\n" +
            "Водители мопедов могут двигаться по правому краю проезжей части в один ряд. Им запрещается поворачивать налево " +
            "или разворачиваться на дорогах с " +
            "трамвайными путями и на дорогах, имеющих более одной полосы для движения в данном направлении. " +
            "Правильный ответ - в обоих перечисленных случаях. (Пункты 24.7, 24.8 ПДД)";
}
