package main.topicTickets.caption;

public class TransportationCaption {
    public final String FTP1 = "https://imgur.com/NHeUjjQ";
    public final String FTP2 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP3 = "https://imgur.com/esNLkc2";

    public final String FTC1 = "На каком рисунке изображён автомобиль, водитель которого не нарушает правил перевозки грузов?\n" +
            "1. " +
            "Только на А\n" +
            "2. " +
            "Только на Б\n" +
            "3. " +
            "На обоих";
    public final String FTC1Help = "На каком рисунке изображён автомобиль, водитель которого не нарушает правил перевозки грузов?\n" +
            "1. " +
            "Только на А\n" +
            "2. " +
            "Только на Б\n" +
            "3. " +
            "На обоих\n\n" +
            "Правильный ответ: 3\n" +
            "Оба водителя не нарушают правила перевозки грузов. На левом рисунке выступающий груз менее 1 м, что допускает " +
            "его перевозку без специального обозначения. На правом рисунке, если действие происходит в дневное время, " +
            "как и должно быть при перевозке груза, выступающего более чем на 1 м, он обозначен опознавательным знаком " +
            "«Крупногабаритный груз». Теоретически и практически эти размеры определяются от внешних световых приборов, " +
            "а не от выступающих частей автомобиля. (Пункт 23.4 ПДД)";
    public final String FTC2 = "Какие из перечисленных требований являются обязательными при перевозке детей?\n" +
            "1. " +
            "Перевозка детей в возрасте до 11 лет (включительно) на переднем сиденье легкового автомобиля должна осуществляться только с использованием соответствующих детских удерживающих систем (устройств)\n" +
            "2. " +
            "Запрещается перевозка детей в возрасте младше 12 лет на заднем сиденье мотоцикла\n" +
            "3. " +
            "Оба требования являются обязательными";
    public final String FTC2Help = "Какие из перечисленных требований являются обязательными при перевозке детей?\n" +
            "1. " +
            "Перевозка детей в возрасте до 11 лет (включительно) на переднем сиденье легкового автомобиля должна осуществляться только с использованием соответствующих детских удерживающих систем (устройств)\n" +
            "2. " +
            "Запрещается перевозка детей в возрасте младше 12 лет на заднем сиденье мотоцикла\n" +
            "3. " +
            "Оба требования являются обязательными\n\n" +
            "Правильный ответ: 3\n" +
            "ПДД РФ запрещают перевозить ребёнка до 12 летнего возраста на заднем сиденье мотоцикла, " +
            "а на переднем сиденье легкового автомобиля его можно перевозить только с использованием детского " +
            "удерживающего устройства. Пункт 22.9 ПДД РФ. ";
    public final String FTC3 = "На каком рисунке изображён автомобиль, водитель которого нарушает правила перевозки грузов?\n" +
            "1. " +
            "Только на А\n" +
            "2. " +
            "Только на Б\n" +
            "3. " +
            "На обоих";
    public final String FTC3Help = "На каком рисунке изображён автомобиль, водитель которого нарушает правила перевозки грузов?\n" +
            "1. " +
            "Только на А\n" +
            "2. " +
            "Только на Б\n" +
            "3. " +
            "На обоих\n\n" +
            "Правильный ответ: 1\n" +
            "Правила разрешают движение ТС, габаритные параметры которых по ширине не превышают 2,55 метра. " +
            "Допускается без обозначения опознавательным знаком «Крупногабаритный груз» перевозка груза, выступающего сбоку не более 0,4 м от внешнего края габаритного огня. " +
            "На рисунке «А» это расстояние больше допустимого. На рисунке «Б» расстояние меньше допустимого. " +
            "Нарушает Правила только водитель автомобиля «А». (Пункты 23.4, 23.5 ПДД)";
    public final String FTC4 = "Перевозка груза запрещена, если он:\n" +
            "1. " +
            "Выступает более чем на 1 м за габариты транспортного средства спереди или сзади\n" +
            "2. " +
            "Закрывает внешние световые приборы, световозвращатели, регистрационные и опознавательные знаки\n" +
            "3. " +
            "Установлен на сиденье для пассажиров";
    public final String FTC4Help = "Перевозка груза запрещена, если он:\n" +
            "1. " +
            "Выступает более чем на 1 м за габариты транспортного средства спереди или сзади\n" +
            "2. " +
            "Закрывает внешние световые приборы, световозвращатели, регистрационные и опознавательные знаки\n" +
            "3. " +
            "Установлен на сиденье для пассажиров\n\n" +
            "Правильный ответ: 2\n" +
            "Согласно пункту 23.3 ПДД запрещается перевозка груза, закрывающего внешние световые приборы, световозвращатели, " +
            "регистрационные и опознавательные знаки. При грузе, выступающем более чем на 1 м за габариты транспортного " +
            "средства спереди или сзади, перевозка не запрещается. Но в этом случае груз должен быть обозначен опознавательным " +
            "знаком «Крупногабаритный груз», а в тёмное время суток и в условиях недостаточной видимости осветительными приборами. ";
    public final String FTC5 = "Запрещается перевозка детей в легковом автомобиле без использования соответствующих детских удерживающих систем (устройств):\n" +
            "1. " +
            "Если они перевозятся в возрасте младше 7 лет\n" +
            "2. " +
            "Если они перевозятся в возрасте от 7 до 11 лет (включительно) на переднем сиденье\n" +
            "3. " +
            "В обоих перечисленных случаях";
    public final String FTC5Help = "Запрещается перевозка детей в легковом автомобиле без использования соответствующих детских удерживающих систем (устройств):\n" +
            "1. " +
            "Если они перевозятся в возрасте младше 7 лет\n" +
            "2. " +
            "Если они перевозятся в возрасте от 7 до 11 лет (включительно) на переднем сиденье\n" +
            "3. " +
            "В обоих перечисленных случаях\n\n" +
            "Правильный ответ: 3\n" +
            "В случае перевозки детей в возрасте младше 7 лет в легковом автомобиле, а также в случае перевозки детей в " +
            "возрасте от 7 до 11 лет (включительно) на переднем сиденье легкового автомобиля обязательно должны использоваться" +
            " детские удерживающие системы (устройства), соответствующие весу и росту ребенка.";
}
