package main.tickets.caption;

public class FifthTicketCaption {
    public final String FTP1 = "https://imgur.com/hpT52Gb";
    public final String FTP2 = "https://imgur.com/HzHAoKz";
    public final String FTP3 = "https://imgur.com/AU5YcSi";
    public final String FTP4 = "https://imgur.com/2BQ5slH";
    public final String FTP5 = "https://imgur.com/8r4D5ml";
    public final String FTP6 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP7 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP8 = "https://imgur.com/RJSlzAw";
    public final String FTP9 = "https://imgur.com/bauUbYn";
    public final String FTP10 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP11 = "https://imgur.com/GNZmog4";
    public final String FTP12 = "https://imgur.com/KVgF7vJ";
    public final String FTP13 = "https://imgur.com/QVTBVvu";
    public final String FTP14 = "https://imgur.com/NFNKxWp";
    public final String FTP15 = "https://imgur.com/X9yHWMx";
    public final String FTP16 = "https://imgur.com/rgFeQgX";
    public final String FTP17 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP18 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP19 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP20 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Вопрос #1\nКакой маневр намеревается выполнить водитель легкового автомобиля?\n" +
            "1. " +
            "Обгон\n" +
            "2. " +
            "Перестроение с дальнейшим опережением\n" +
            "3. " +
            "Объезд";
    public final String FTC1Help = "Вопрос #1\nКакой маневр намеревается выполнить водитель легкового автомобиля?\n" +
            "1. " +
            "Обгон\n" +
            "2. " +
            "Перестроение с дальнейшим опережением\n" +
            "3. " +
            "Объезд\n\n" +
            "Правильный ответ: 2\n" +
            "Водитель легкового автомобиля осуществляет «перестроение» в параллельный ряд и дальнейшее «опережение» - " +
            "движение транспортного средства со скоростью большей скорости попутного транспортного средства. " +
            "(Пункт 1.2 ПДД термины «Перестроение», «Опережение»)";
    public final String FTC2 = "Вопрос #2\nЭтот знак:\n" +
            "1. " +
            "Показывает направления движения на перекрёстке\n" +
            "2. " +
            "Указывает, что на пересекаемой дороге движение осуществляется по двум полосам\n" +
            "3. " +
            "Запрещает разворот на перекрестке";
    public final String FTC2Help = "Вопрос #2\nЭтот знак:\n" +
            "1. " +
            "Показывает направления движения на перекрёстке\n" +
            "2. " +
            "Указывает, что на пересекаемой дороге движение осуществляется по двум полосам\n" +
            "3. " +
            "Запрещает разворот на перекрестке\n\n" +
            "Правильный ответ: 1\n" +
            "Предупреждающий знак 1.34.3 «Направление поворота» указывает направления движения на Т-образном перекрёстке.";
    public final String FTC3 = "Вопрос #3\nНа грузовом автомобиле с разрешенной максимальной массой не более 3,5 т можно двигаться со скоростью:\n" +
            "1. " +
            "Не более 50 км/ч\n" +
            "2. " +
            "Не более 70 км/ч\n" +
            "3. " +
            "Не более 90 км/ч";
    public final String FTC3Help = "Вопрос #3\nНа грузовом автомобиле с разрешенной максимальной массой не более 3,5 т можно двигаться со скоростью:\n" +
            "1. " +
            "Не более 50 км/ч\n" +
            "2. " +
            "Не более 70 км/ч\n" +
            "3. " +
            "Не более 90 км/ч\n\n" +
            "Правильный ответ: 3\n" +
            "Табличка под знаком 8.4.1 «Вид транспортного средства» распространяет действие знака на грузовые автомобили," +
            " в том числе с прицепом, с разрешённой максимальной массой более 3,5 т. Ваш автомобиль к ним не относится," +
            " продолжаете движение с разрешённой Вам скоростью – не более 90 км/ч, так как действие происходит вне населённого пункта. ";
    public final String FTC4 = "Вопрос #4\nКакой из знаков указывает протяжённость зоны для разворота?\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "Только Б\n" +
            "3. " +
            "А и Б";
    public final String FTC4Help = "Вопрос #4\nКакой из знаков указывает протяжённость зоны для разворота?\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "Только Б\n" +
            "3. " +
            "А и Б\n\n" +
            "Правильный ответ: 2\n" +
            "Знак «Б» – 6.3.2 «Зона для разворота» применяется для обозначения места на участке дороги, разрешающего разворот, " +
            "и его протяжённость. В данном случае протяжённость зоны для разворота – не более 15 м. Комбинация знаков «А»" +
            " – 6.3.1 «Место для разворота» и табличка 8.1.1 «Расстояние до объекта» указывают, что через 50 м от " +
            "установки знаков по ходу движения будет находиться место, предназначенное только для выполнения разворота.";
    public final String FTC5 = "Вопрос #5\nДанная разметка обозначает:\n" +
            "1. " +
            "Участок дороги, где запрещено движение у тротуара\n" +
            "2. " +
            "Места, где запрещена любая остановка\n" +
            "3. " +
            "Места остановки маршрутных транспортных средств и стоянки такси";
    public final String FTC5Help = "Вопрос #5\nДанная разметка обозначает:\n" +
            "1. " +
            "Участок дороги, где запрещено движение у тротуара\n" +
            "2. " +
            "Места, где запрещена любая остановка\n" +
            "3. " +
            "Места остановки маршрутных транспортных средств и стоянки такси\n\n" +
            "Правильный ответ: 3\n" +
            "Жёлтой зигзагообразной разметкой 1.17 обозначают места остановки маршрутных транспортных средств и стоянки " +
            "такси. («Горизонтальная разметка»)";
    public final String FTC6 = "Вопрос #6\nВ каких случаях необходимо уступить дорогу транспортному средству, имеющему нанесенные на наружные поверхности специальные цветографические схемы?\n" +
            "1. " +
            "Если его водитель включил проблесковый маячок синего цвета и специальный звуковой сигнал\n" +
            "2. " +
            "Если его водитель включил проблесковый маячок синего цвета\n" +
            "3. " +
            "Во всех случаях";
    public final String FTC6Help = "Вопрос #6\nВ каких случаях необходимо уступить дорогу транспортному средству, имеющему нанесенные на наружные поверхности специальные цветографические схемы?\n" +
            "1. " +
            "Если его водитель включил проблесковый маячок синего цвета и специальный звуковой сигнал\n" +
            "2. " +
            "Если его водитель включил проблесковый маячок синего цвета\n" +
            "3. " +
            "Во всех случаях\n\n" +
            "Правильный ответ: 1\n" +
            "Для получения преимущества «оперативник» должен включить проблесковый маячок синего цвета и специальный звуковой сигнал. (Пункт 3.1 ПДД)";
    public final String FTC7 = "Вопрос #7\nДаёт ли преимущество в движении подача сигнала указателями поворота?\n" +
            "1. " +
            "Дает преимущество\n" +
            "2. " +
            "Дает преимущество только при завершении обгона\n" +
            "3. " +
            "Не дает преимущества";
    public final String FTC7Help = "Вопрос #7\nДаёт ли преимущество в движении подача сигнала указателями поворота?\n" +
            "1. " +
            "Дает преимущество\n" +
            "2. " +
            "Дает преимущество только при завершении обгона\n" +
            "3. " +
            "Не дает преимущества\n\n" +
            "Правильный ответ: 3\n" +
            "Подача сигнала указателями поворота не дает водителю преимущества и не освобождает его от принятия мер предосторожности. (Пункт 8.2 ПДД)";
    public final String FTC8 = "Вопрос #8\nРазрешается ли Вам выполнить поворот направо по указанной траектории в данной ситуации?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Запрещается";
    public final String FTC8Help = "Вопрос #8\nРазрешается ли Вам выполнить поворот направо по указанной траектории в данной ситуации?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Запрещается\n\n" +
            "Правильный ответ: 1\n" +
            "При повороте направо транспортное средство должно двигаться по возможности ближе к правому краю проезжей части, " +
            "т.е. по крайней правой полосе. В данном случае у Вас такой возможности нет по причине остановки на этой полосе " +
            "легкового автомобиля. Продолжаете движение по указанной траектории. (Пункт 8.6 ПДД)";
    public final String FTC9 = "Вопрос #9\nМожно ли Вам выполнить разворот?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно только по траектории А\n" +
            "3. " +
            "Можно только по траектории Б\n" +
            "4. " +
            "Нельзя";
    public final String FTC9Help = "Вопрос #9\nМожно ли Вам выполнить разворот?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно только по траектории А\n" +
            "3. " +
            "Можно только по траектории Б\n" +
            "4. " +
            "Нельзя\n\n" +
            "Правильный ответ: 4\n" +
            "Вы находитесь на дороге с односторонним движением, по которой встречное движение запрещено." +
            " По указанным траекториям продолжать движение нельзя. («Дорожные знаки» 5.6, 1.21)";
    public final String FTC10 = "Вопрос #10\nВ каких случаях на дорогах с двусторонним движением запрещается движение по полосе, предназначенной для встречного движения?\n" +
            "1. " +
            "Если она отделена трамвайными путями\n" +
            "2. " +
            "Если она отделена разделительной полосой\n" +
            "3. " +
            "Если она отделена разделительной разметкой 1.1 или 1.3, либо разметкой 1.11, прерывистая линия которой расположена слева\n" +
            "4. " +
            "Во всех перечисленных случаях";
    public final String FTC10Help = "Вопрос #10\nВ каких случаях на дорогах с двусторонним движением запрещается движение по полосе, предназначенной для встречного движения?\n" +
            "1. " +
            "Если она отделена трамвайными путями\n" +
            "2. " +
            "Если она отделена разделительной полосой\n" +
            "3. " +
            "Если она отделена разделительной разметкой 1.1 или 1.3, либо разметкой 1.11, прерывистая линия которой расположена слева\n" +
            "4. " +
            "Во всех перечисленных случаях\n\n" +
            "Правильный ответ: 4\n" +
            "На любых дорогах с двусторонним движением запрещается движение по полосе, предназначенной для встречного движения," +
            " если она отделена трамвайными путями, разделительной полосой, разметкой 1.1, разметкой 1.3 или разметкой 1.11, прерывистая линия которой расположена слева. (Пункт 9.1(1) ПДД) ";
    public final String FTC11 = "Вопрос #11\nРазрешается ли Вам обогнать грузовой автомобиль в конце подъема?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается, если скорость грузового автомобиля не более 30 км/ч\n" +
            "3. " +
            "Запрещается";
    public final String FTC11Help = "Вопрос #11\nРазрешается ли Вам обогнать грузовой автомобиль в конце подъема?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается, если скорость грузового автомобиля не более 30 км/ч\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 3\n" +
            "Перелом дороги ограничивает видимость в конце подъёма. Поэтому обгон запрещён. (Пункт 11.4 ПДД) Не забываем " +
            "главное условие обгона - «Путь, необходимый для обгона, никогда не должен превышать половины видимого отрезка пути».";
    public final String FTC12 = "Вопрос #12\nРазрешено ли Вам поставить автомобиль на стоянку в этом месте при наличии узкой обочины?\n" +
            "1. " +
            "Разрешено\n" +
            "2. " +
            "Разрешено только в светлое время суток\n" +
            "3. " +
            "Запрещено";
    public final String FTC12Help = "Вопрос #12\nРазрешено ли Вам поставить автомобиль на стоянку в этом месте при наличии узкой обочины?\n" +
            "1. " +
            "Разрешено\n" +
            "2. " +
            "Разрешено только в светлое время суток\n" +
            "3. " +
            "Запрещено\n\n" +
            "Правильный ответ: 3\n" +
            "Стоянка вне населённых пунктов на проезжей части дорог, обозначенных знаком 2.1 «Главная дорога», запрещается. (Пункт 12.5 ПДД)";
    public final String FTC13 = "Вопрос #13\nКак Вам следует поступить при повороте направо?\n" +
            "1. " +
            "Проехать перекресток первым\n" +
            "2. " +
            "Уступить дорогу только трамваю А\n" +
            "3. " +
            "Уступить дорогу только трамваю Б\n" +
            "4. " +
            "Уступить дорогу обоим трамваям";
    public final String FTC13Help = "Вопрос #13\nКак Вам следует поступить при повороте направо?\n" +
            "1. " +
            "Проехать перекресток первым\n" +
            "2. " +
            "Уступить дорогу только трамваю А\n" +
            "3. " +
            "Уступить дорогу только трамваю Б\n" +
            "4. " +
            "Уступить дорогу обоим трамваям\n\n" +
            "Правильный ответ: 4\n" +
            "Для поворота направо Вы должны пересечь трамвайные пути. Оба трамвая так же, как и Вы, имеют право на движение," +
            " они двигаются «по рукам регулировщика». Вы им уступаете, так как при одновременном праве на движение трамвай" +
            " имеет преимущество перед безрельсовыми транспортными средствами. (Пункты 6.10, 13.6 ПДД)";
    public final String FTC14 = "Вопрос #14\nВы намерены повернуть налево. Ваши действия?\n" +
            "1. " +
            "Проедете перекрёсток первым\n" +
            "2. " +
            "Выедете на перекресток первым и, уступив дорогу мотоциклу, завершите поворот\n" +
            "3. " +
            "Уступите дорогу обоим транспортным средствам";
    public final String FTC14Help = "Вопрос #14\nВы намерены повернуть налево. Ваши действия?\n" +
            "1. " +
            "Проедете перекрёсток первым\n" +
            "2. " +
            "Выедете на перекресток первым и, уступив дорогу мотоциклу, завершите поворот\n" +
            "3. " +
            "Уступите дорогу обоим транспортным средствам\n\n" +
            "Правильный ответ: 2\n" +
            "Перекрёсток равнозначный. Водители между собой руководствуются «правилом правой руки». Первым начинаете " +
            "движение Вы, поскольку в первоначальный момент не имеете помехи справа. Выкатившись на перекрёсток," +
            " перед самым поворотом налево останавливаетесь. После этого по траектории движения легкового автомобиля " +
            "будет отсутствовать помеха справа – проезжает через перекрёсток первым, мотоциклист – вторым, Вы – последним. (Пункт 13.11 ПДД)";
    public final String FTC15 = "Вопрос #15\nВы обязаны уступить дорогу при движении прямо:\n" +
            "1. " +
            "Только легковому автомобилю\n" +
            "2. " +
            "Только грузовому автомобилю\n" +
            "3. " +
            "Обоим транспортным средствам";
    public final String FTC15Help = "Вопрос #15\nВы обязаны уступить дорогу при движении прямо:\n" +
            "1. " +
            "Только легковому автомобилю\n" +
            "2. " +
            "Только грузовому автомобилю\n" +
            "3. " +
            "Обоим транспортным средствам\n\n" +
            "Правильный ответ: 3\n" +
            "Перекрёсток неравнозначный. Главная дорога меняет направление. Преимущество имеют транспортные средства," +
            " находящиеся на главной дороге, которые между собой руководствуются «правилом правой руки». " +
            "Вы находитесь на второстепенной дороге, уступаете дорогу обоим транспортным средствам. " +
            "(«Дорожные знаки» 2.4, 8.13; пункты 13.9, 13.10, 13.11 ПДД)";
    public final String FTC16 = "Вопрос #16\nКто из водителей нарушает Правила?\n" +
            "1. " +
            "Водители грузового автомобиля с разрешенной максимальной массой 3 т и мопеда\n" +
            "2. " +
            "Только водитель мопеда\n" +
            "3. " +
            "Никто не нарушает";
    public final String FTC16Help = "Вопрос #16\nКто из водителей нарушает Правила?\n" +
            "1. " +
            "Водители грузового автомобиля с разрешенной максимальной массой 3 т и мопеда\n" +
            "2. " +
            "Только водитель мопеда\n" +
            "3. " +
            "Никто не нарушает\n\n" +
            "Правильный ответ: 1\n" +
            "Движение по автомагистрали на мопедах запрещено. Запрещается и движение грузовым автомобилям с р.м.м более" +
            " 2,5 т по любой дороге, имеющей три полосы движения в данном направлении по крайней левой полосе." +
            " Нарушают правила водители грузового автомобиля и мопеда. (Пункты 9.4, 16.1 ПДД)";
    public final String FTC17 = "Вопрос #17\nПри ослеплении дальним светом фар встречных или движущихся попутно транспортных средств водитель должен:\n" +
            "1. " +
            "Принять вправо к краю проезжей части и остановиться\n" +
            "2. " +
            "Включить аварийную сигнализацию и, не меняя полосы движения, снизить скорость и остановиться\n" +
            "3. " +
            "Подавая звуковой сигнал, остановиться";
    public final String FTC17Help = "Вопрос #17\nПри ослеплении дальним светом фар встречных или движущихся попутно транспортных средств водитель должен:\n" +
            "1. " +
            "Принять вправо к краю проезжей части и остановиться\n" +
            "2. " +
            "Включить аварийную сигнализацию и, не меняя полосы движения, снизить скорость и остановиться\n" +
            "3. " +
            "Подавая звуковой сигнал, остановиться\n\n" +
            "Правильный ответ: 2\n" +
            "Постарайтесь выполнить действия в той последовательности, которая оговорена Правилами, – включить аварийную " +
            "сигнализацию и, не меняя полосы движения, снизить скорость и остановиться. (Пункт 19.2 ПДД)";
    public final String FTC18 = "Вопрос #18\nКакие виды административных наказаний могут применяться к водителям за нарушения Правил?\n" +
            "1. " +
            "Только предупреждение или штраф\n" +
            "2. " +
            "Предупреждение, штраф, лишение права управления транспортными средствами, административный арест\n" +
            "3. " +
            "Предупреждение, штраф, лишение права управления транспортными средствами, конфискация орудия совершения " +
            "или предмета административного правонарушения, административный арест, обязательные работы";
    public final String FTC18Help = "Вопрос #18\nКакие виды административных наказаний могут применяться к водителям за нарушения Правил?\n" +
            "1. " +
            "Только предупреждение или штраф\n" +
            "2. " +
            "Предупреждение, штраф, лишение права управления транспортными средствами, административный арест\n" +
            "3. " +
            "Предупреждение, штраф, лишение права управления транспортными средствами, конфискация орудия совершения " +
            "или предмета административного правонарушения, административный арест, обязательные работы\n\n" +
            "Правильный ответ: 3\n" +
            "Согласно главы 12 КоАП к водителям за нарушение ПДД могут применяться все виды наказаний, перечисленные в" +
            " ответах. Правильный ответ - самый полный";
    public final String FTC19 = "Вопрос #19\nКакие действия водителя приведут к уменьшению центробежной силы, возникающей на повороте?\n" +
            "1. " +
            "Увеличение скорости движения\n" +
            "2. " +
            "Снижение скорости движения\n" +
            "3. " +
            "Уменьшение радиуса прохождения поворота";
    public final String FTC19Help = "Вопрос #19\nКакие действия водителя приведут к уменьшению центробежной силы, возникающей на повороте?\n" +
            "1. " +
            "Увеличение скорости движения\n" +
            "2. " +
            "Снижение скорости движения\n" +
            "3. " +
            "Уменьшение радиуса прохождения поворота\n\n" +
            "Правильный ответ: 2\n" +
            "Самой результативной величиной, влияющей на центробежную силу, является скорость. Она пропорциональна " +
            "квадрату скорости. В то же время, скорость определяется водителем. Её уменьшение приводит к уменьшению" +
            " центробежной силы. Вот почему до вхождения в поворот рекомендуется снижение скорости движения.";
    public final String FTC20 = "Вопрос #20\nКак влияет алкоголь на время реакции водителя?\n" +
            "1. " +
            "Время реакции уменьшается\n" +
            "2. " +
            "Алкоголь на время реакции не влияет\n" +
            "3. " +
            "Время реакции увеличивается";
    public final String FTC20Help = "Вопрос #20\nКак влияет алкоголь на время реакции водителя?\n" +
            "1. " +
            "Время реакции уменьшается\n" +
            "2. " +
            "Алкоголь на время реакции не влияет\n" +
            "3. " +
            "Время реакции увеличивается\n\n" +
            "Правильный ответ: 3\n" +
            "Водителю за рулём требуется не только реакция, которая при употреблении алкоголя увеличивается. " +
            "Самое главное – это постоянная оценка событий и прогнозирование их развития. Под воздействием алкоголя " +
            "мозг даёт неправильные оценки, в этом и заключается главная опасность управления транспортным средством " +
            "в состоянии алкогольного опьянения.";
}
