package main.tickets.caption;

public class FirstTicketCaption {
    public final String FTP1 = "https://i.imgur.com/LfnyHhJ.jpg";
    public final String FTP2 = "https://i.imgur.com/xYhxu1g.jpg";
    public final String FTP3 = "https://imgur.com/BoZVVoL";
    public final String FTP4 = "https://imgur.com/sUVqi0V";
    public final String FTP5 = "https://i.imgur.com/55qKHKn.jpg";
    public final String FTP6 = "https://imgur.com/YT7TViJ";
    public final String FTP7 = "https://i.imgur.com/GiZns71.jpg";
    public final String FTP8 = "https://imgur.com/BVScwFY";
    public final String FTP9 = "https://imgur.com/bBDVHP9";
    public final String FTP10 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP11 = "https://imgur.com/y5uZrvN";
    public final String FTP12 = "https://imgur.com/IJvk3nL";
    public final String FTP13 = "https://imgur.com/rGS9fqc";
    public final String FTP14 = "https://imgur.com/4CqUhQV";
    public final String FTP15 = "https://imgur.com/XwuxfYL";
    public final String FTP16 = "https://imgur.com/XWax4S6";
    public final String FTP17 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP18 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP19 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP20 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Вопрос #1\n" +
            "Сколько полос для движения имеет данная дорога?\n" +
            "1. Две \n" +
            "2. Четыре \n" +
            "3. Пять \n";
    public final String FTC1Help = "Вопрос #1\nСколько полос для движения имеет данная дорога?\n" +
            "1. Две \n" +
            "2. Четыре \n" +
            "3. Пять \n\n" +
            "Правильный ответ: 2\n" +
            "Разделительная полоса делит дорогу на проезжие части. Данная дорога имеет две проезжие части, четыре полосы движения. (Пункт 1.2 ПДД)";
    public final String FTC2 = "Вопрос #2\nМожно ли Вам въехать на мост первым? \n" +
            "1. Можно\n" +
            "2. Можно, если Вы не затрудните движение встречному автомобилю\n" +
            "3. Нельзя\n";
    public final String FTC2Help = "Вопрос #2\nМожно ли Вам въехать на мост первым? \n" +
            "1. Можно\n" +
            "2. Можно, если Вы не затрудните движение встречному автомобилю\n" +
            "3. Нельзя\n\n" +
            "Правильный ответ: 1\n" +
            "Знак 2.7 «Преимущество перед встречным движением» предоставляет Вам право первым проехать через узкий участок дороги, т. е. через мост. " +
            "(«Дорожные знаки», пункт 1.2 термин «Уступить дорогу»)";
    public final String FTC3 = "Вопрос #3\nРазрешено ли Вам произвести остановку для посадки пассажира? \n" +
            "1. Разрешено\n" +
            "2. Разрешено только по чётным числам месяца\n" +
            "3. Разрешено только по нечётным числам месяца\n" +
            "4. Запрещено\n";
    public final String FTC3Help = "Вопрос #3\nРазрешено ли Вам произвести остановку для посадки пассажира? \n" +
            "1. Разрешено\n" +
            "2. Разрешено только по чётным числам месяца\n" +
            "3. Разрешено только по нечётным числам месяца\n" +
            "4. Запрещено\n\n" +
            "Правильный ответ: 1\n" +
            "Знак 3.29 «Стоянка запрещена по нечётным числам месяца» ограничивает только стоянку. " +
            "Остановка в его зоне действия не запрещается в любой период времени. («Дорожные знаки»)";
    public final String FTC4 = "Вопрос #4\nЧто запрещено в зоне действия этого знака?\n" +
            "1. Движение любых транспортных средств\n" +
            "2. Движение всех транспортных средств со скоростью не более 20 км/ч\n" +
            "3. Движение механических транспортных средств\n";
    public final String FTC4Help = "Вопрос #4\nЧто запрещено в зоне действия этого знака?\n" +
            "1. Движение любых транспортных средств\n" +
            "2. Движение всех транспортных средств со скоростью не более 20 км/ч\n" +
            "3. Движение механических транспортных средств\n\n" +
            "Правильный ответ: 3\n" +
            "Знак 5.33 «Пешеходная зона» начало участка дороги, где разрешено движение только пешеходов и велосипедистов в случаях, установленных в п. 24.2 п. 24.3 п. 24.4 Правил (Приложение 1). " +
            "Поэтому запрещено движение всех механических ТС. (Изменения с 25 июля 2017)";
    public final String FTC5 = "Вопрос #5\nРазрешен ли Вам выезд на полосу с реверсивным движением, если реверсивный светофор выключен?\n" +
            "1. Разрешен\n" +
            "2. Разрешен, если скорость автобуса менее 30 км/ч\n" +
            "3. Запрещен\n";
    public final String FTC5Help = "Вопрос #5\nРазрешен ли Вам выезд на полосу с реверсивным движением, если реверсивный светофор выключен?\n" +
            "1. Разрешен\n" +
            "2. Разрешен, если скорость автобуса менее 30 км/ч\n" +
            "3. Запрещен\n\n" +
            "Правильный ответ: 3\n" +
            "При выключенных сигналах реверсивного светофора, который расположен над полосой, обозначенной с обеих сторон разметкой 1.9, въезд на эту полосу запрещен. (Пункт 6.7 ПДД)";
    public final String FTC6 = "Вопрос #6\nВ каких направлениях Вам разрешается продолжить движение?\n" +
            "1. Только налево\n" +
            "2. Прямо и налево\n" +
            "3. Налево и в обратном направлении\n";
    public final String FTC6Help = "Вопрос #6\nВ каких направлениях Вам разрешается продолжить движение?\n" +
            "1. Только налево\n" +
            "2. Прямо и налево\n" +
            "3. Налево и в обратном направлении\n\n" +
            "Правильный ответ: 1\n" +
            "Сигнал светофора разрешает Вам движение налево. Разворот Вы могли бы осуществить, если находились бы на левой полосе. " +
            "(«Дорожные знаки», пункты 6.3, 8.5 ПДД, «Горизонтальная разметка» 1.18).";
    public final String FTC7 = "Вопрос #7\nПоднятая вверх рука водителя легкового автомобиля является сигналом, информирующим Вас о его намерении: \n" +
            "1. Повернуть направо\n" +
            "2. Продолжить движение прямо\n" +
            "3. Снизить скорость, чтобы остановиться и уступить дорогу мотоциклу\n";
    public final String FTC7Help = "Вопрос #7\nПоднятая вверх рука водителя легкового автомобиля является сигналом, информирующим Вас о его намерении: \n" +
            "1. Повернуть направо\n" +
            "2. Продолжить движение прямо\n" +
            "3. Снизить скорость, чтобы остановиться и уступить дорогу мотоциклу\n\n" +
            "Правильный ответ: 3\n" +
            "У водителя не работает световая сигнализация, поэтому он вынужден подавать соответствующие сигналы рукой. " +
            "Согласно знаку 2.4 «Уступите дорогу» мотоциклист имеет преимущество. Поднятая вверх рука информирует о намерении притормозить для того, чтобы уступить дорогу мотоциклисту. " +
            "(«Дорожные знаки», пункт 8.1 ПДД).";
    public final String FTC8 = "Вопрос #8\nДвигаясь по левой полосе, водитель намерен перестроиться на правую. На каком из рисунков показана ситуация, в которой он обязан уступить дорогу?\n" +
            "1. На левом\n" +
            "2. На правом\n" +
            "3. На обоих\n";
    public final String FTC8Help = "Вопрос #8\nДвигаясь по левой полосе, водитель намерен перестроиться на правую. На каком из рисунков показана ситуация, в которой он обязан уступить дорогу?\n" +
            "1. На левом\n" +
            "2. На правом\n" +
            "3. На обоих\n\n" +
            "Правильный ответ: 3\n" +
            "На левом рисунке преимущество у автомобиля, двигающегося попутно по полосе без изменения направления движения, т.е. у «хозяина полосы». В" +
            "одитель, двигающийся по левой полосе уступает. На правом рисунке одновременное перестроение. Водители руководствуются «правилом правой руки», т.е. у кого помеха справа, тот и уступает. " +
            "Помеха справа у водителя, двигающего также по левой полосе. " +
            "Он уступает дорогу и в этой ситуации. (Пункт 8.4 ПДД)";
    public final String FTC9 = "Вопрос #9\nМожно ли Вам выполнить разворот в этом месте?\n" +
            "1. Можно\n" +
            "2. Можно только при отсутствии приближающегося поезда\n" +
            "3. Нельзя\n";
    public final String FTC9Help = "Вопрос #9\nМожно ли Вам выполнить разворот в этом месте?\n" +
            "1. Можно\n" +
            "2. Можно только при отсутствии приближающегося поезда\n" +
            "3. Нельзя\n\n" +
            "Правильный ответ: 1\n" +
            "Разворот запрещён на железнодорожном переезде, границами которого являются шлагбаумы, а при их отсутствии - знаки 1.3.1 «Однопутная железная дорога» или 1.3.2 «Многопутная железная дорога». " +
            "В нашем случае железнодорожный переезд без шлагбаума. Вы можете совершить разворот по указанной траектории, так как совершаете его на безопасном удалении от железнодорожных путей. (Пункт 8.11 ПДД)";
    public final String FTC10 = "Вопрос #10\nВ каких случаях разрешается наезжать на прерывистые линии разметки, разделяющие проезжую часть на полосы движения?\n" +
            "1. Только если на дороге нет других транспортных средств\n" +
            "2. Только при движении в темное время суток\n" +
            "3. Только при перестроении\n" +
            "4. Во всех перечисленных случаях\n";
    public final String FTC10Help = "Вопрос #10\nВ каких случаях разрешается наезжать на прерывистые линии разметки, разделяющие проезжую часть на полосы движения?\n" +
            "1. Только если на дороге нет других транспортных средств\n" +
            "2. Только при движении в темное время суток\n" +
            "3. Только при перестроении\n" +
            "4. Во всех перечисленных случаях\n\n" +
            "Правильный ответ: 3\n" +
            "Наезжать на прерывистые линии разметки разрешается лишь при перестроении. (Пункт 9.7 ПДД)";
    public final String FTC11 = "Вопрос #11\nРазрешено ли Вам обогнать мотоцикл?\n" +
            "1. Разрешено\n" +
            "2. Разрешено, если водитель мотоцикла снизил скорость\n" +
            "3. Запрещено \n";
    public final String FTC11Help = "Вопрос #11\nРазрешено ли Вам обогнать мотоцикл?\n" +
            "1. Разрешено\n" +
            "2. Разрешено, если водитель мотоцикла снизил скорость\n" +
            "3. Запрещено \n\n" +
            "Правильный ответ: 3\n" +
            "Перекресток равнозначный. На равнозначных перекрёстках обгон запрещён всех видов транспорта всеми транспортными средствами. " +
            "Мотоциклист притормаживает, он уступает помехе справа. То же самое делаете и Вы. " +
            "В противном случае Вы нарушите и правила обгона, и правила проезда перекрёстков. (Пункты 11.4, 13.11 ПДД).";
    public final String FTC12 = "Вопрос #12\nРазрешается ли Вам остановиться в указанном месте?\n" +
            "1. Разрешается\n" +
            "2. Разрешается, если автомобиль будет находиться не ближе 5 м от края пересекаемой проезжей части\n" +
            "3. Запрещается\n";
    public final String FTC12Help = "Вопрос #12\nРазрешается ли Вам остановиться в указанном месте?\n" +
            "1. Разрешается\n" +
            "2. Разрешается, если автомобиль будет находиться не ближе 5 м от края пересекаемой проезжей части\n" +
            "3. Запрещается\n\n " +
            "Правильный ответ: 2\n" +
            "На перекрёстке с круговым движением Вы можете совершить остановку и стоянку, но при этом расстояние между остановившимся транспортным средством и " +
            "краем проезжей части должно быть не менее 5 м. (Пункты 12.4, 12.5 ПДД).";
    public final String FTC13 = "Вопрос #13\nВы намерены повернуть налево. Кому Вы должны уступить дорогу?\n" +
            "1. Только пешеходам\n" +
            "2. Только автобусу\n" +
            "3. Автобусу и пешеходам\n";
    public final String FTC13Help = "Вопрос #13\nВы намерены повернуть налево. Кому Вы должны уступить дорогу?\n" +
            "1. Только пешеходам\n" +
            "2. Только автобусу\n" +
            "3. Автобусу и пешеходам\n\n" +
            "Правильный ответ: 3\n" +
            "Перекрёсток регулируемый. Знаки приоритета «не работают». " +
            "При повороте налево Вы уступаете автобусу, движущемуся прямо со встречного направления, и пешеходам, переходящим проезжую часть дороги, на которую Вы поворачиваете. " +
            "(Пункты 13.1, 13.3, 13.4 ПДД).";
    public final String FTC14 = "Вопрос #14\nВ каком случае Вы имеете преимущество?\n" +
            "1." +
            " Только при повороте направо\n" +
            "2." +
            " Только при повороте налево\n" +
            "3." +
            " В обоих перечисленных случаях";
    public final String FTC14Help = "Вопрос #14\nВ каком случае Вы имеете преимущество?\n" +
            "1." +
            "Только при повороте направо\n" +
            "2." +
            " Только при повороте налево\n" +
            "3." +
            " В обоих перечисленных случаях\n\nПравильный ответ: 3\n" +
            "Перекресток равнозначный. Водители между собой руководствуются «правилом правой руки», т. е. у кого помеха справа, тот и уступает. " +
            "У Вас преимущество и при повороте направо и при повороте налево, т. е. в обоих перечисленных случаях. (Пункт 13.11 ПДД).";
    public final String FTC15 = "Вопрос #15\nОбязан ли водитель мотоцикла уступить Вам дорогу?\n" +
            "1." +
            " Обязан\n" +
            "2." +
            " Не обязан";
    public final String FTC15Help = "Вопрос #15\nОбязан ли водитель мотоцикла уступить Вам дорогу?\n" +
            "1." +
            " Обязан\n" +
            "2." +
            " Не обязан\n\n" +
            "Правильный ответ: 1\n" +
            "Мотоциклист выезжает на дорогу, обозначенную знаком 5.1 «Автомагистраль», которая является главной дорогой по отношению к примыкающей. " +
            "На перекрёстке неравнозначных дорог преимущество имеют транспортные средства, движущиеся по главной дороге. " +
            "Мотоциклист обязан уступить Вам дорогу. (Пункты 1.2, 13.9 ПДД).";
    public final String FTC16 = "Вопрос #16\nРазрешается ли водителю выполнить объезд грузового автомобиля?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается, если между шлагбаумом и остановившимся грузовым автомобилем расстояние более 5 м\n" +
            "3. " +
            "Запрещается";
    public final String FTC16Help = "Вопрос #16\nРазрешается ли водителю выполнить объезд грузового автомобиля?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается, если между шлагбаумом и остановившимся грузовым автомобилем расстояние более 5 м\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 3\n" +
            "Водитель легкового автомобиля хочет объехать стоящий перед закрытым шлагбаумом грузовик. " +
            "Правила, оговаривающие порядок проезда через железнодорожный переезд, такой маневр (с выездом на полосу встречного движения) запрещают. " +
            "(Пункт 15.3 ПДД).";
    public final String FTC17 = "Вопрос #17\nВ каких из перечисленных случаев запрещена буксировка на гибкой сцепке?\n" +
            "1. " +
            "Только на горных дорогах\n" +
            "2. " +
            "Только в гололедицу\n" +
            "3. " +
            "Только в тёмное время суток и в условиях недостаточной видимости\n" +
            "4. " +
            "Во всех перечисленных случаях";
    public final String FTC17Help = "Вопрос #17\nВ каких из перечисленных случаев запрещена буксировка на гибкой сцепке?\n" +
            "1. " +
            "Только на горных дорогах\n" +
            "2. " +
            "Только в гололедицу\n" +
            "3. " +
            "Только в тёмное время суток и в условиях недостаточной видимости\n" +
            "4. " +
            "Во всех перечисленных случаях \n\n" +
            "равильный ответ: 2\n" +
            "Запомните этот ответ. На экзамене часто отвечают, что только на горных дорогах. Видимо, ассоциируется опасность, связанная с высотой. " +
            "Правилами запрещается буксировка на гибкой сцепке только в гололедицу. (Пункт 20.4 ПДД).";
    public final String FTC18 = "Вопрос #18\nЗапрещается эксплуатация мототранспортных средств (категории L), если остаточная глубина рисунка протектора шин (при отсутствии индикаторов износа) составляет не более:\n" +
            "1. " +
            "0,8 мм\n" +
            "2. " +
            "1,0 мм\n" +
            "3. " +
            "1,6 мм\n" +
            "4. " +
            "2,0 мм";
    public final String FTC18Help = "Вопрос #18\nЗапрещается эксплуатация мототранспортных средств (категории L), если остаточная глубина рисунка протектора шин (при отсутствии индикаторов износа) составляет не более:\n" +
            "1. " +
            "0,8 мм\n" +
            "2. " +
            "1,0 мм\n" +
            "3. " +
            "1,6 мм\n" +
            "4. " +
            "2,0 мм\n\n" +
            "Правильный ответ: 1\n" +
            "Для мототранспортных средств, относящихся к категории L, остаточная глубина рисунка протектора шин " +
            "(при отсутствии индикаторов износа) должна быть не более 0,8 мм. («Перечень неисправностей» п. 5.1)";
    public final String FTC19 = "Вопрос #19\nИсключает ли антиблокировочная тормозная система возможность возникновения заноса или сноса при прохождении поворота?\n" +
            "1. " +
            "Полностью исключает возможность возникновения только заноса\n" +
            "2. " +
            "Полностью исключает возможность возникновения только сноса\n" +
            "3. " +
            "Не исключает возможность возникновения сноса или заноса";
    public final String FTC19Help = "Вопрос #19\nИсключает ли антиблокировочная тормозная система возможность возникновения заноса или сноса при прохождении поворота?\n" +
            "1. " +
            "Полностью исключает возможность возникновения только заноса\n" +
            "2. " +
            "Полностью исключает возможность возникновения только сноса\n" +
            "3. " +
            "Не исключает возможность возникновения сноса или заноса\n\n" +
            "Правильный ответ: 3\n" +
            "Антиблокировочные системы (АБС) автомобилей представляют собой системы, оснащённые устройствами управления тормозами с обратной связью, " +
            "которые предотвращают блокировку колёс во время торможения, тем самым сохраняя управляемость и курсовую устойчивость." +
            "Антиблокировочная система в таких ситуациях не может повлиять на возможность возникновения сноса или заноса.";
    public final String FTC20 = "Вопрос #20\nВ каких случаях следует начинать сердечно-легочную реанимацию пострадавшего?\n" +
            "1. " +
            "При наличии болей в области сердца и затрудненного дыхания\n" +
            "2. " +
            "При отсутствии у пострадавшего сознания, независимо от наличия дыхания\n" +
            "3. " +
            "При отсутствии у пострадавшего сознания, дыхания и кровообращения";
    public final String FTC20Help = "Вопрос #20\nВ каких случаях следует начинать сердечно-легочную реанимацию пострадавшего?\n" +
            "1. " +
            "При наличии болей в области сердца и затрудненного дыхания\n" +
            "2. " +
            "При отсутствии у пострадавшего сознания, независимо от наличия дыхания\n" +
            "3. " +
            "При отсутствии у пострадавшего сознания, дыхания и кровообращения\n\n" +
            "Правильный ответ: 3";

}
