package main.tickets.caption;

public class FourthTicketCaption {
    public final String FTP1 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP2 = "https://imgur.com/sfjJmFB";
    public final String FTP3 = "https://imgur.com/E0SDqZB";
    public final String FTP4 = "https://imgur.com/47cThEM";
    public final String FTP5 = "https://imgur.com/1OMPOxo";
    public final String FTP6 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP7 = "https://imgur.com/1pF9md7";
    public final String FTP8 = "https://imgur.com/YcUt8eY";
    public final String FTP9 = "https://imgur.com/AFlVz2G";
    public final String FTP10 = "https://imgur.com/OB9dzdP";
    public final String FTP11 = "https://imgur.com/yAX853x";
    public final String FTP12 = "https://imgur.com/nPKdCXj";
    public final String FTP13 = "https://imgur.com/PgHsXsh";
    public final String FTP14 = "https://imgur.com/0Nq2EMf";
    public final String FTP15 = "https://imgur.com/5hq4Sa1";
    public final String FTP16 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP17 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP18 = "https://i.imgur.com/UDTiiMf.png";
    public final String FTP19 = "https://imgur.com/53EZ1MX";
    public final String FTP20 = "https://i.imgur.com/UDTiiMf.png";

    public final String FTC1 = "Вопрос #1\nЧто называется разрешённой максимальной массой транспортного средства?\n" +
            "1. " +
            "Максимально допустимая для перевозки масса груза, установленная предприятием-изготовителем\n" +
            "2. " +
            "Масса снаряженного транспортного средства без учета массы водителя, пассажиров и груза, установленная предприятием-изготовителем\n" +
            "3. " +
            "Масса снаряженного транспортного средства с грузом, водителем и пассажирами, " +
            "установленная предприятием-изготовителем в качестве максимально допустимой";
    public final String FTC1Help = "Вопрос #1\nЧто называется разрешённой максимальной массой транспортного средства?\n" +
            "1. " +
            "Максимально допустимая для перевозки масса груза, установленная предприятием-изготовителем\n" +
            "2. " +
            "Масса снаряженного транспортного средства без учета массы водителя, пассажиров и груза, установленная предприятием-изготовителем\n" +
            "3. " +
            "Масса снаряженного транспортного средства с грузом, водителем и пассажирами, " +
            "установленная предприятием-изготовителем в качестве максимально допустимой\n\n" +
            "Правильный ответ: 3\n" +
            "Пункт 1.2 ПДД термин «Разрешённая максимальная масса».";
    public final String FTC2 = "Вопрос #2\nВам разрешено продолжить движение?\n" +
            "1. " +
            "Только прямо\n" +
            "2. " +
            "Прямо или в обратном направлении\n" +
            "3. " +
            "Во всех направлениях";
    public final String FTC2Help = "Вопрос #2\nВам разрешено продолжить движение?\n" +
            "1. " +
            "Только прямо\n" +
            "2. " +
            "Прямо или в обратном направлении\n" +
            "3. " +
            "Во всех направлениях\n\nПравильный ответ: 2\n" +
            "Знак 3.18.2 «Поворот налево запрещён» не запрещает производить разворот. " +
            "Поэтому можете по своему усмотрению продолжить движение прямо или развернуться, и продолжить " +
            "движение в обратном направлении. ";
    public final String FTC3 = "Вопрос #3\nКакие из указанных знаков разрешают проезд на автомобиле к месту проживания или работы?\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "Только В\n" +
            "3. " +
            "А и В\n" +
            "4. " +
            "Все";
    public final String FTC3Help = "Вопрос #3\nКакие из указанных знаков разрешают проезд на автомобиле к месту проживания или работы?\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "Только В\n" +
            "3. " +
            "А и В\n" +
            "4. " +
            "Все\n\nПравильный ответ: 3\n" +
            "Разрешают проезд на автомобиле к месту проживания или работы знаки: «А» - 3.2 «Движение запрещено», «В» - 3.3 " +
            "«Движение механических транспортных средств запрещено». Из запрещающих знаков 6 знаков предоставляют такую «льготу»." +
            " В их число не входит знак «Б» - 3.1 «Въезд запрещён», который запрещает въезд под знак всех ТС, кроме маршрутных транспортных средств.";
    public final String FTC4 = "Вопрос #4\nЧто обозначают эти дорожные знаки?\n" +
            "1. " +
            "Парковочное место только для автобусов\n" +
            "2. " +
            "Парковочное место для автобусов и троллейбусов\n" +
            "3. " +
            "Парковочное место, где возможна пересадка на маршрутное транспортное средство (автобус или троллейбус)";
    public final String FTC4Help = "Вопрос #4\nЧто обозначают эти дорожные знаки?\n" +
            "1. " +
            "Парковочное место только для автобусов\n" +
            "2. " +
            "Парковочное место для автобусов и троллейбусов\n" +
            "3. " +
            "Парковочное место, где возможна пересадка на маршрутное транспортное средство (автобус или троллейбус)\n\n" +
            "Правильный ответ: 3\n" +
            "Знак 6.4 «Парковка (парковочное место)» применён с табличкой 8.21.2 «Вид маршрутного транспортного средства». " +
            "Такое сочетание знаков показывает, что с этого места для дальнейшего движения можно воспользоваться маршрутными " +
            "транспортными средствами – автобусом или троллейбусом, а свой автомобиль можно оставить на оборудованной стоянке. ";
    public final String FTC5 = "Вопрос #5\nРазметка в виде треугольника на полосе движения:\n" +
            "1. " +
            "Обозначает опасный участок дороги\n" +
            "2. " +
            "Предупреждает Вас о приближении к месту, где нужно уступить дорогу\n" +
            "3. " +
            "Указывает место, где Вам необходимо остановиться";
    public final String FTC5Help = "Вопрос #5\nРазметка в виде треугольника на полосе движения:\n" +
            "1. " +
            "Обозначает опасный участок дороги\n" +
            "2. " +
            "Предупреждает Вас о приближении к месту, где нужно уступить дорогу\n" +
            "3. " +
            "Указывает место, где Вам необходимо остановиться\n\n" +
            "Правильный ответ: 2\n" +
            "Разметка 1.20 предупреждает о приближении к разметке 1.13, которая указывает место, где водитель должен " +
            "при необходимости остановиться, уступая дорогу транспортным средствам, движущимся по пересекаемой дороге.";
    public final String FTC6 = "Вопрос #6\nРазрешается ли продолжить движение, если регулировщик поднял руку вверх после того, как Вы въехали на перекрёсток?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается, если Вы поворачиваете направо\n" +
            "3. " +
            "Запрещается";
    public final String FTC6Help = "Вопрос #6\nРазрешается ли продолжить движение, если регулировщик поднял руку вверх после того, как Вы въехали на перекрёсток?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается, если Вы поворачиваете направо\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 1\n" +
            "Вы находитесь на перекрёстке. Следует освободить его, иначе будете мешать осуществлять движение " +
            "транспортным средствам, движущимся с других направлений. (Пункт 6.14 ПДД)";
    public final String FTC7 = "Вопрос #7\nВы намерены продолжить движение по главной дороге. Обязаны ли Вы включить указатели левого поворота?\n" +
            "1. " +
            "Обязаны\n" +
            "2. " +
            "Обязаны, если с других направлений приближаются транспортные средства\n" +
            "3. " +
            "Не обязаны";
    public final String FTC7Help = "Вопрос #7\nВы намерены продолжить движение по главной дороге. Обязаны ли Вы включить указатели левого поворота?\n" +
            "1. " +
            "Обязаны\n" +
            "2. " +
            "Обязаны, если с других направлений приближаются транспортные средства\n" +
            "3. " +
            "Не обязаны\n\n" +
            "Правильный ответ: 1\n" +
            "Где бы ни происходило управление автомобилем, Вы должны строго придерживаться «своего внутреннего правила»," +
            " которое можно сформулировать так: «Моя езда является безопасной в том случае, когда мои действия понятны" +
            " всем остальным участникам дорожного движения». Вы намерены совершить маневр-поворот налево – обязательно" +
            " информируйте других участников дорожного движения об этом, включив указатель поворота. (Пункт 8.1 ПДД)";
    public final String FTC8 = "Вопрос #8\nКто должен уступить дорогу при взаимном перестроении?\n" +
            "1. " +
            "Водитель легкового автомобиля\n" +
            "2. " +
            "Водитель грузового автомобиля\n" +
            "3. " +
            "Водителям следует действовать по взаимной договоренности";
    public final String FTC8Help = "Вопрос #8\nКто должен уступить дорогу при взаимном перестроении?\n" +
            "1. " +
            "Водитель легкового автомобиля\n" +
            "2. " +
            "Водитель грузового автомобиля\n" +
            "3. " +
            "Водителям следует действовать по взаимной договоренности\n\n" +
            "Правильный ответ: 2\n" +
            "При одновременном перестроении водители руководствуются «правилом правой руки». Помеха справа у водителя грузовика." +
            " Он уступает дорогу. (Пункт 8.4 ПДД)";
    public final String FTC9 = "Вопрос #9\nВ каких направлениях Вам можно продолжить движение?\n" +
            "1. " +
            "Только прямо\n" +
            "2. " +
            "Прямо и налево\n" +
            "3. " +
            "Прямо, налево и в обратном направлении";
    public final String FTC9Help = "Вопрос #9\nВ каких направлениях Вам можно продолжить движение?\n" +
            "1. " +
            "Только прямо\n" +
            "2. " +
            "Прямо и налево\n" +
            "3. " +
            "Прямо, налево и в обратном направлении\n\n" +
            "Правильный ответ: 3\n" +
            "С Вашей стороны прерывистая линия разметки 1.11, которая допускает её пересечение. Так как Вы находитесь " +
            "на крайней левой полосе, можете продолжить движение прямо, повернуть налево или развернуться и " +
            "продолжить движение в обратном направлении.";
    public final String FTC10 = "Вопрос #10\nС какой максимальной скоростью Вы имеете право продолжить движение на легковом автомобиле?\n" +
            "1. " +
            "70 км/ч\n" +
            "2. " +
            "90 км/ч\n" +
            "3. " +
            "110 км/ч";
    public final String FTC10Help = "Вопрос #10\nС какой максимальной скоростью Вы имеете право продолжить движение на легковом автомобиле?\n" +
            "1. " +
            "70 км/ч\n" +
            "2. " +
            "90 км/ч\n" +
            "3. " +
            "110 км/ч\n\n" +
            "Правильный ответ: 3\n" +
            "На автомагистрали разрешается более скоростное движение. При этом допустимая максимальная скорость равна" +
            " 110 км/ч. («Дорожные знаки» 5.1. «Автомагистраль», пункт 10.3 ПДД)";
    public final String FTC11 = "Вопрос #11\nКак Вам следует поступить в данной ситуации?\n" +
            "1. " +
            "Уступить дорогу встречному автомобилю\n" +
            "2. " +
            "Проехать первым\n" +
            "3. " +
            "Действовать по взаимной договоренности с водителем встречного автомобиля";
    public final String FTC11Help = "Вопрос #11\nКак Вам следует поступить в данной ситуации?\n" +
            "1. " +
            "Уступить дорогу встречному автомобилю\n" +
            "2. " +
            "Проехать первым\n" +
            "3. " +
            "Действовать по взаимной договоренности с водителем встречного автомобиля\n\n" +
            "Правильный ответ: 1\n" +
            "На Вашей стороне проезжей части помеха – препятствие в виде неисправного автомобиля. Вы должны уступить " +
            "дорогу. Если бы аналогичная ситуация сложилась на уклоне, обозначенном знаками 1.13 «Крутой спуск», 1.14" +
            " «Крутой подъем», то уступить дорогу должен был бы автомобиль, движущийся на спуск, т.е. вниз. (Пункт 11.7 ПДД)";
    public final String FTC12 = "Вопрос #12\nРазрешено ли Вам поставить автомобиль на стоянку в этом месте?\n" +
            "1. " +
            "Разрешено\n" +
            "2. " +
            "Разрешено, если при этом не будут созданы помехи для движения маршрутных транспортных средств\n" +
            "3. " +
            "Запрещено";
    public final String FTC12Help = "Вопрос #12\nРазрешено ли Вам поставить автомобиль на стоянку в этом месте?\n" +
            "1. " +
            "Разрешено\n" +
            "2. " +
            "Разрешено, если при этом не будут созданы помехи для движения маршрутных транспортных средств\n" +
            "3. " +
            "Запрещено\n\n" +
            "Правильный ответ: 3\n" +
            "Остановка и стоянка запрещены ближе 15 м от мест остановки маршрутных ТС (условие не нарушается), а также " +
            "на пешеходном переходе и ближе 5 м до него. Остановившись вплотную к пешеходному переходу, Вы нарушите это " +
            "требование. Поэтому стоянка ТС в этом месте запрещена. (Пункт 12.4 ПДД)";
    public final String FTC13 = "Вопрос #13\nВы намерены повернуть налево. Ваши действия?\n" +
            "1. " +
            "Уступите дорогу трамваю\n" +
            "2. " +
            "Дождётесь разрешающего сигнала специального светофора и, пропустив трамвай, повернете налево\n" +
            "3. " +
            "Проедете перекрёсток первым";
    public final String FTC13Help = "Вопрос #13\nВы намерены повернуть налево. Ваши действия?\n" +
            "1. " +
            "Уступите дорогу трамваю\n" +
            "2. " +
            "Дождётесь разрешающего сигнала специального светофора и, пропустив трамвай, повернете налево\n" +
            "3. " +
            "Проедете перекрёсток первым\n\n" +
            "Правильный ответ: 3\n" +
            "Светофор с сигналами бело-лунного цвета, предназначенный для водителей маршрутных транспортных средств, " +
            "запрещает им движение (горит верхний ряд). Трамвай стоит. Вам же, согласно зелёного сигнала светофора, " +
            "разрешено движение в любом направлении, по Вашему желанию поворачивая налево, проезжайте перекресток первым." +
            "(Пункты 6.3, 6.8 ПДД)";
    public final String FTC14 = "Вопрос #14\nКому Вы обязаны уступить дорогу при повороте налево?\n" +
            "1. " +
            "Только пешеходам\n" +
            "2. " +
            "Пешеходам и велосипедисту\n" +
            "3. " +
            "Никому";
    public final String FTC14Help = "Вопрос #14\nКому Вы обязаны уступить дорогу при повороте налево?\n" +
            "1. " +
            "Только пешеходам\n" +
            "2. " +
            "Пешеходам и велосипедисту\n" +
            "3. " +
            "Никому\n\n" +
            "Правильный ответ: 2\n" +
            "На перекрёстках, независимо регулируемые они или нет, при повороте налево или направо водитель обязан " +
            "уступить дорогу пешеходам, переходящим проезжую часть, на которую он поворачивает. Следует уступить" +
            " и велосипедисту, движущемуся навстречу прямо. (Пункты 13.1, 13.2 ПДД)";
    public final String FTC15 = "Вопрос #15\nВ каком случае Вы должны будете уступить дорогу автомобилю ДПС?\n" +
            "1. " +
            "Если на автомобиле ДПС будут включены проблесковые маячки синего цвета\n" +
            "2. " +
            "Если на автомобиле ДПС одновременно будут включены проблесковые маячки синего цвета и специальный звуковой сигнал\n" +
            "3. " +
            "В любом";
    public final String FTC15Help = "Вопрос #15\nВ каком случае Вы должны будете уступить дорогу автомобилю ДПС?\n" +
            "1. " +
            "Если на автомобиле ДПС будут включены проблесковые маячки синего цвета\n" +
            "2. " +
            "Если на автомобиле ДПС одновременно будут включены проблесковые маячки синего цвета и специальный звуковой сигнал\n" +
            "3. " +
            "В любом\n\n" +
            "Правильный ответ: 2\n" +
            "В данном случае Вы должны уступить дорогу «оперативнику», если на данном автомобиле одновременно будут " +
            "включены проблесковые маячки синего цвета и специальный звуковой сигнал. (Пункт 3.2 ПДД)";
    public final String FTC16 = "Вопрос #16\nПри приближении к остановившемуся транспортному средству с включенной " +
            "аварийной сигнализацией, которое имеет опознавательные знаки «Перевозка детей», водитель должен:\n" +
            "1. " +
            "Снизить скорость\n" +
            "2. " +
            "При необходимости остановиться и пропустить детей\n" +
            "3. " +
            "Осуществить все перечисленные действия";
    public final String FTC16Help = "Вопрос #16\nПри приближении к остановившемуся транспортному средству с включенной " +
            "аварийной сигнализацией, которое имеет опознавательные знаки «Перевозка детей», водитель должен:\n" +
            "1. " +
            "Снизить скорость\n" +
            "2. " +
            "При необходимости остановиться и пропустить детей\n" +
            "3. " +
            "Осуществить все перечисленные действия\n\n" +
            "Правильный ответ: 3\n" +
            "Аварийная сигнализация должна быть включена при посадке детей в транспортное средства и высадке из него, " +
            "имеющем опознавательные знаки «Перевозка детей». Приближаясь к остановившемуся ТС с включенной аварийной " +
            "сигнализацией, имеющему опознавательные знаки «Перевозка детей» водитель должен снизить скорость, при " +
            "необходимости остановиться и пропустить детей, т.е. осуществить все перечисленные действия. " +
            "(Пункты 7.1, 14.7, 22.6 ПДД)";
    public final String FTC17 = "Вопрос #17\nВ каких случаях водители мопедов нарушают Правила?\n" +
            "1. " +
            "Только если управляют мопедом, не держась за руль хотя бы одной рукой\n" +
            "2. " +
            "Только если двигаются по дороге без застегнутого мотошлема\n" +
            "3. " +
            "В обоих перечисленных случаях";
    public final String FTC17Help = "Вопрос #17\nВ каких случаях водители мопедов нарушают Правила?\n" +
            "1. " +
            "Только если управляют мопедом, не держась за руль хотя бы одной рукой\n" +
            "2. " +
            "Только если двигаются по дороге без застегнутого мотошлема\n" +
            "3. " +
            "В обоих перечисленных случаях\n\n" +
            "Правильный ответ: 3\n" +
            "Водителям мопедов запрещается: – управлять мопедом не держать за руль хотя бы одной рукой; – двигаться по " +
            "дороге без застегнутого мотошлема. Правильный ответ - в обоих перечисленных случаях. (Пункт 24.8 ПДД)";
    public final String FTC18 = "Вопрос #18\nЭксплуатировать грузовой автомобиль с разрешенной максимальной массой не более 3,5 т можно при отсутствии:\n" +
            "1. " +
            "Аптечки\n" +
            "2. " +
            "Огнетушителя\n" +
            "3. " +
            "Знака аварийной остановки\n" +
            "4. " +
            "Противооткатных упоров";
    public final String FTC18Help = "Вопрос #18\nЭксплуатировать грузовой автомобиль с разрешенной максимальной массой не более 3,5 т можно при отсутствии:\n" +
            "1. " +
            "Аптечки\n" +
            "2. " +
            "Огнетушителя\n" +
            "3. " +
            "Знака аварийной остановки\n" +
            "4. " +
            "Противооткатных упоров\n\n" +
            "Правильный ответ: 4\n" +
            "«Перечнем неисправностей» запрещается эксплуатация любого автомобиля при отсутствии аптечки, огнетушителя" +
            " и знака аварийной остановки. Отсутствие противооткатных упоров допускается на грузовом автомобиле, " +
            "если его р.м.м. не превышает 3,5 т. («Перечень неисправностей» пункт 7.7)";
    public final String FTC19 = "Вопрос #19\nВ случае остановки на подъеме(спуске) при наличии обочины можно " +
            "предотвратить самопроизвольное скатывание автомобиля на проезжую часть, повернув его передние колеса в положение:\n" +
            "1. " +
            "А и Г\n" +
            "2. " +
            "Б и В\n" +
            "3. " +
            "А и В\n" +
            "4. " +
            "Б и Г";
    public final String FTC19Help = "Вопрос #19\nВ случае остановки на подъеме(спуске) при наличии обочины можно " +
            "предотвратить самопроизвольное скатывание автомобиля на проезжую часть, повернув его передние колеса в положение:\n" +
            "1. " +
            "А и Г\n" +
            "2. " +
            "Б и В\n" +
            "3. " +
            "А и В\n" +
            "4. " +
            "Б и Г\n\n" +
            "Правильный ответ: 1\n" +
            "Колёса, вывернутые в сторону кювета («А» и «Г»), в случае непреднамеренного скатывания автомобиля " +
            "уведут неуправляемый автомобиль в кювет, что позволит избежать встречного столкновения движущихся " +
            "транспортных средств. И наоборот.";
    public final String FTC20 = "Вопрос #20\nУстановленный факт употребления водителем вызывающих алкогольное " +
            "опьянение веществ определяется наличием в его организме абсолютного этилового спирта в концентрации, превышающей:\n" +
            "1. " +
            "0,10 миллиграмма на один литр выдыхаемого воздуха\n" +
            "2. " +
            "0,16 миллиграмма на один литр выдыхаемого воздуха\n" +
            "3. " +
            "0,25 миллиграмма на один литр выдыхаемого воздуха";
    public final String FTC20Help = "Вопрос #20\nУстановленный факт употребления водителем вызывающих алкогольное " +
            "опьянение веществ определяется наличием в его организме абсолютного этилового спирта в концентрации, превышающей:\n" +
            "1. " +
            "0,10 миллиграмма на один литр выдыхаемого воздуха\n" +
            "2. " +
            "0,16 миллиграмма на один литр выдыхаемого воздуха\n" +
            "3. " +
            "0,25 миллиграмма на один литр выдыхаемого воздуха\n\n" +
            "Правильный ответ: 2\n" +
            "Статья 12.8 КоАП, предусматривающая наказание водителей, находящихся в алкогольном опьянении предусматривает," +
            " что она вступает в силу, если наличие абсолютного этилового спирта в концентрации превышает показатель " +
            "0,16 миллиграмма на один литр выдыхаемого воздуха.";
}

