package main.tickets.caption;

public class SecondTicketCaption {
    public final String STP1 = "https://i.imgur.com/UDTiiMf.png";
    public final String STP2 = "https://imgur.com/nSbkCKw";
    public final String STP3 = "https://imgur.com/Z8f0lpI";
    public final String STP4 = "https://imgur.com/Rz9iUD9";
    public final String STP5 = "https://imgur.com/KQhQBR2";
    public final String STP6 = "https://i.imgur.com/UDTiiMf.png";
    public final String STP7 = "https://i.imgur.com/UDTiiMf.png";
    public final String STP8 = "https://imgur.com/tJkXPF0";
    public final String STP9 = "https://imgur.com/5aFqS8V";
    public final String STP10 = "https://imgur.com/xtrqJsl";
    public final String STP11 = "https://imgur.com/ZmjlIXo";
    public final String STP12 = "https://imgur.com/9Pgv2fe";
    public final String STP13 = "https://imgur.com/nlDAOt1  ";
    public final String STP14 = "https://imgur.com/NoGta7Q";
    public final String STP15 = "https://imgur.com/od8zA93";
    public final String STP16 = "https://imgur.com/t6YQfIR";
    public final String STP17 = "https://i.imgur.com/UDTiiMf.png";
    public final String STP18 = "https://i.imgur.com/UDTiiMf.png";
    public final String STP19 = "https://i.imgur.com/UDTiiMf.png";
    public final String STP20 = "https://i.imgur.com/UDTiiMf.png";

    public final String STC1 = "Вопрос #1\nВ каком случае водитель совершит вынужденную остановку? \n" +
            "1. Остановившись непосредственно перед пешеходным переходом, чтобы уступить дорогу пешеходу \n" +
            "2. Остановившись на проезжей части из-за технической неисправности транспортного средства \n" +
            "3. В обоих перечисленных случаях \n";
    public final String STC1Help = "Вопрос #1\nВ каком случае водитель совершит вынужденную остановку? \n" +
            "1. Остановившись непосредственно перед пешеходным переходом, чтобы уступить дорогу пешеходу \n" +
            "2. Остановившись на проезжей части из-за технической неисправности транспортного средства \n" +
            "3. В обоих перечисленных случаях \n\n" +
            "Правильный ответ: 2\n" +
            "«Вынужденная остановка» - прекращение движения транспортного средства, связанное с его технической неисправностью, опасностью, создаваемой перевозимым грузом, состоянием водителя (пассажира) или появления препятствия на дороге. " +
            "(Пункт 1.2 ПДД, термин «Вынужденная остановка»)";
    public final String STC2 = "Вопрос #2\nРазрешен ли Вам съезд на дорогу с грунтовым покрытием? \n" +
            "1. Разрешен \n" +
            "2. Разрешен только при технической неисправности транспортного средства \n" +
            "3. Запрещен\n";
    public final String STC2Help = "Вопрос #2\nРазрешен ли Вам съезд на дорогу с грунтовым покрытием? \n" +
            "1. Разрешен \n" +
            "2. Разрешен только при технической неисправности транспортного средства \n" +
            "3. Запрещен\n\n" +
            "Правильный ответ: 1\n" +
            "Впереди по ходу Вашего движения предупреждающий знак 1.11.2 «Опасный поворот» и знаки 1.34.2 «Направление поворота», которые указывают направление движения на закруглении дороги малого радиуса с ограниченной видимостью. " +
            "Ничего, что бы Вам запрещало съезд на дорогу с грунтовым покрытием, нет. По Вашему желанию поворачиваете направо. («Дорожные знаки»).";
    public final String STC3 = "Вопрос #3\nМожно ли Вам остановиться в указанном месте для посадки пассажира? \n" +
            "1. Можно\n" +
            "2. Можно, если Вы управляете такси \n" +
            "3. Нельзя\n";
    public final String STC3Help = "Вопрос #3\nМожно ли Вам остановиться в указанном месте для посадки пассажира? \n" +
            "1. Можно\n" +
            "2. Можно, если Вы управляете такси \n" +
            "3. Нельзя\n\n" +
            "Правильный ответ: 1\n" +
            "Знак 3.28 «Стоянка запрещена» не запрещает производить остановку. В указанном месте Вам совершить остановку можно. («Дорожные знаки»)";
    public final String STC4 = "Вопрос #4\nКакие из указанных знаков запрещают движение водителям мопедов?\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "Только Б\n" +
            "3. " +
            "В и Г\n" +
            "4. " +
            "Все";
    public final String STC4Help = "Вопрос #4\nКакие из указанных знаков запрещают движение водителям мопедов?\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "Только Б\n" +
            "3. " +
            "В и Г\n" +
            "4. " +
            "Все\n\n" +
            "Правильный ответ: 4\n" +
            "Запрещают движение водителям мопедов все знаки из перечисленных";
    public final String STC5 = "Вопрос #5\nВы намерены повернуть налево. Где остановиться, чтобы уступить дорогу легковому автомобилю: \n\n" +
            "1. Перед знаком. \n" +
            "2. Перед знаком у линии разметки. \n" +
            "3. На перекрестке перед прерывистой линией разметки. \n" +
            "4. В любом месте по усмотрению водителя. ";;
    public final String STC5Help = "Вопрос #5\nВы намерены повернуть налево. Где остановиться, чтобы уступить дорогу легковому автомобилю: \n\n" +
            "1. Перед знаком. \n" +
            "2. Перед знаком у линии разметки. \n" +
            "3. На перекрестке перед прерывистой линией разметки. \n" +
            "4. В любом месте по усмотрению водителя. \n\n" +
            "Правильный ответ: 2\n" +
            "Согласно знаку 2.4 «Уступите дорогу» водители должны пропускать транспорт, движущийся по пересекаемой дороге. " +
            "Разметка 1.13 в виде треугольников указывает место, где при необходимости следует остановиться. " +
            "У Вас такая необходимость есть, так как при повороте налево Вы уступаете дорогу легковому автомобилю.";
    public final String STC6 = "Вопрос #6\nЧто означает мигание зелёного сигнала светофора?\n" +
            "1. " +
            "Предупреждает о неисправности светофора\n" +
            "2. " +
            "Разрешает движение и информирует о том, что вскоре будет включен запрещающий сигнал\n" +
            "3. " +
            "Запрещает дальнейшее движение";
    public final String STC6Help = "Вопрос #6\nЧто означает мигание зелёного сигнала светофора?\n" +
            "1. " +
            "Предупреждает о неисправности светофора\n" +
            "2. " +
            "Разрешает движение и информирует о том, что вскоре будет включен запрещающий сигнал\n" +
            "3. " +
            "Запрещает дальнейшее движение\n\n" +
            "Правильный ответ: 2\n" +
            "Длительность мигания зелёного сигнала светофора обычно составляет 3-4 с. Это позволяет водителю заблаговременно, " +
            "в зависимости от конкретных условий, принять решение: 1) продолжить движение с прежней скоростью; " +
            "2) несколько увеличить скорость; 3) начать снижение скорости вплоть до остановки.";
    public final String STC7 = "Вопрос #7\nВодитель обязан подавать сигналы световыми указателями поворота (рукой):\n" +
            "1. " +
            "Перед началом движения или перестроением\n" +
            "2. " +
            "Перед поворотом или разворотом\n" +
            "3. " +
            "Перед остановкой\n" +
            "4. " +
            "Во всех перечисленных случаях";
    public final String STC7Help = "Вопрос #7\nВодитель обязан подавать сигналы световыми указателями поворота (рукой):\n" +
            "1. " +
            "Перед началом движения или перестроением\n" +
            "2. " +
            "Перед поворотом или разворотом\n" +
            "3. " +
            "Перед остановкой\n" +
            "4. " +
            "Во всех перечисленных случаях\n\n" +
            "Правильный ответ: 4\n" +
            "Перед началом движения, перестроением, поворотом (разворотом) и остановкой водитель обязан" +
            " подавать сигналы световыми указателями поворота соответствующего направления, а если они отсутствуют или неисправны – рукой.";
    public final String STC8 = "Вопрос #8\nКак Вам следует поступить при повороте направо?\n" +
            "1. " +
            "Перестроиться на правую полосу, затем осуществить поворот\n" +
            "2. " +
            "Продолжить движение по второй полосе до перекрёстка, затем повернуть\n" +
            "3. " +
            "Возможны оба варианта действий";
    public final String STC8Help = "Вопрос #8\nКак Вам следует поступить при повороте направо?\n" +
            "1. " +
            "Перестроиться на правую полосу, затем осуществить поворот\n" +
            "2. " +
            "Продолжить движение по второй полосе до перекрёстка, затем повернуть\n" +
            "3. " +
            "Возможны оба варианта действий\n\n" +
            "Правильный ответ: 3\n" +
            "Разметка разрешает поворот направо с обеих полос, поэтому возможны оба варианта действий. " +
            "В таких случаях, выполняя поворот на перекрёстке, соблюдайте избранную Вами рядность.";
    public final String STC9 = "Вопрос #9\nПо какой траектории Вам разрешено выполнить разворот?\n" +
            "1. " +
            "Только по А\n" +
            "2. " +
            "Только по Б\n" +
            "3. " +
            "По любой из указанных";
    public final String STC9Help = "Вопрос #9\nПо какой траектории Вам разрешено выполнить разворот?\n" +
            "1. " +
            "Только по А\n" +
            "2. " +
            "Только по Б\n" +
            "3. " +
            "По любой из указанных\n\n" +
            "Правильный ответ: 1\n" +
            "Выезд с пересечения проезжих частей должен быть выполнен на «свою» сторону, т.е. исходя из правостороннего движения без выезда на сторону встречного движения. " +
            "Двигаясь по траектории «Б», Вы совершаете встречное движение по пересекаемой дороге, что крайне опасно, " +
            "так как можете произвести лобовое столкновение с автомобилем, приближающимся слева.";
    public final String STC10 = "Вопрос #10\nС какой скоростью Вы можете продолжить движение вне населённого пункта по левой полосе на легковом автомобиле?\n" +
            "1. " +
            "Не более 50 км/ч\n" +
            "2. " +
            "Не менее 50 км/ч и не более 70 км/ч\n" +
            "3. " +
            "Не менее 50 км/ч и не более 90 км/ч";
    public final String STC10Help = "Вопрос #10\nС какой скоростью Вы можете продолжить движение вне населённого пункта по левой полосе на легковом автомобиле?\n" +
            "1. " +
            "Не более 50 км/ч\n" +
            "2. " +
            "Не менее 50 км/ч и не более 70 км/ч\n" +
            "3. " +
            "Не менее 50 км/ч и не более 90 км/ч\n\n" +
            "Правильный ответ: 3\n" +
            "Над левой полосой висит знак 4.6 «Ограничение минимальной скорости» с табличкой 8.14 «Полоса движения», " +
            "указывающей полосу движения, на которую распространяется действие знака.";
    public final String STC11 = "Вопрос #11\nМожно ли водителю легкового автомобиля выполнить опережение грузовых автомобилей вне населенного пункта по такой траектории?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно, если скорость грузовых автомобилей менее 30 км/ч\n" +
            "3. " +
            "Нельзя";
    public final String STC11Help = "Вопрос #11\nМожно ли водителю легкового автомобиля выполнить опережение грузовых автомобилей вне населенного пункта по такой траектории?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно, если скорость грузовых автомобилей менее 30 км/ч\n" +
            "3. " +
            "Нельзя\n\n" +
            "Правильный ответ: 1\n" +
            "На дорогах с двусторонним движением, имеющих четыре и более полос для движения обгон запрещён. В таких ситуациях можно совершать только опережение. ";
    public final String STC12 = "Вопрос #12\nВ каком случае водителю разрешается поставить автомобиль на стоянку в указанном месте?\n" +
            "1. " +
            "Только если расстояние до сплошной линии разметки не менее 3 м\n" +
            "2. " +
            "Только если расстояние до края пересекаемой проезжей части не менее 5 м\n" +
            "3. " +
            "При соблюдении обоих перечисленных условий";
    public final String STC12Help = "Вопрос #12\nВ каком случае водителю разрешается поставить автомобиль на стоянку в указанном месте?\n" +
            "1. " +
            "Только если расстояние до сплошной линии разметки не менее 3 м\n" +
            "2. " +
            "Только если расстояние до края пересекаемой проезжей части не менее 5 м\n" +
            "3. " +
            "При соблюдении обоих перечисленных условий\n\n" +
            "Правильный ответ: 3\n" +
            "Водитель не нарушает правила остановки и стоянки. Расстояние до края проезжей части, до сплошной линии разметки соблюдается – не менее допустимых. " +
            "Остановка и стоянка за пешеходным переходом также допустима.";
    public final String STC13 = "Вопрос #13\nПри повороте направо Вы должны уступить дорогу:\n" +
            "1. " +
            "Только велосипедисту\n" +
            "2. " +
            "Только пешеходам\n" +
            "3. " +
            "Пешеходам и велосипедисту\n" +
            "4. " +
            "Никому";
    public final String STC13Help = "Вопрос #13\nПри повороте направо Вы должны уступить дорогу:\n" +
            "1. " +
            "Только велосипедисту\n" +
            "2. " +
            "Только пешеходам\n" +
            "3. " +
            "Пешеходам и велосипедисту\n" +
            "4. " +
            "Никому\n\n" +
            "Правильный ответ: 3\n" +
            "При повороте направо или налево водитель обязан уступить дорогу пешеходам, переходящим проезжую часть дороги, на которую он поворачивает," +
            " и велосипедистам, независимо от того, регулируемый или нерегулируемый это перекресток";
    public final String STC14 = "Вопрос #14\nВы намерены проехать перекресток в прямом направлении. Кому Вы должны уступить дорогу?\n" +
            "1. " +
            "Обоим трамваям\n" +
            "2. " +
            "Только трамваю А\n" +
            "3. " +
            "Только трамваю Б\n" +
            "4. " +
            "Никому";
    public final String STC14Help = "Вопрос #14\nВы намерены проехать перекресток в прямом направлении. Кому Вы должны уступить дорогу?\n" +
            "1. " +
            "Обоим трамваям\n" +
            "2. " +
            "Только трамваю А\n" +
            "3. " +
            "Только трамваю Б\n" +
            "4. " +
            "Никому\n\n" +
            "Правильный ответ: 1\n" +
            "Перекрёсток равнозначный. Трамваи в равнозначных условиях имеют преимущество перед безрельсовыми транспортными средствами. " +
            "Между собой руководствуются «правилом правой руки». Помеха справа у трамвая «А». " +
            "Соответственно первым проезжает трамвай «Б», за ним «А», Вы последним.";
    public final String STC15 = "Вопрос #15\nКому Вы обязаны уступить дорогу при повороте налево?\n" +
            "1. " +
            "Только автобусу\n" +
            "2. " +
            "Только легковому автомобилю\n" +
            "3. " +
            "Никому";
    public final String STC15Help = "Вопрос #15\nКому Вы обязаны уступить дорогу при повороте налево?\n" +
            "1. " +
            "Только автобусу\n" +
            "2. " +
            "Только легковому автомобилю\n" +
            "3. " +
            "Никому\n\n" +
            "Правильный ответ: 3\n" +
            "Перекрёсток неравнозначный. Главная дорога меняет направление. Транспортные средства, находящиеся на главной дороге, имеют преимущество, " +
            "а водители между собой руководствуются «правилом правой руки». " +
            "Никому не уступая, первым проезжаете Вы, вторым автобус, легковой автомобиль последним, так как он находится на второстепенной дороге.";
    public final String STC16 = "Вопрос #16\nС какой максимальной скоростью можно продолжить движение за знаком?\n" +
            "1. " +
            "60 км/ч\n" +
            "2. " +
            "50 км/ч\n" +
            "3. " +
            "30 км/ч\n" +
            "4. " +
            "20 км/ч";
    public final String STC16Help = "Вопрос #16\nС какой максимальной скоростью можно продолжить движение за знаком?\n" +
            "1. " +
            "60 км/ч\n" +
            "2. " +
            "50 км/ч\n" +
            "3. " +
            "30 км/ч\n" +
            "4. " +
            "20 км/ч\n\n" +
            "Правильный ответ: 4\n" +
            "В жилой зоне, согласно знаку, в которую Вы въезжаете, разрешается движение со скоростью не более 20 км/ч. («Дорожные знаки» 5.21, пункт 10.2 ПДД).";
    public final String STC17 = "Вопрос #17\nДля перевозки людей на мотоцикле водитель должен иметь водительское удостоверение на право управления транспортными средствами:\n" +
            "1. " +
            "Категории «A» или подкатегории «A1»\n" +
            "2. " +
            "Любой категории или подкатегории в течение 2 и более лет\n" +
            "3. " +
            "Только категории «A» или подкатегории «A1» в течение 2 и более лет";
    public final String STC17Help = "Вопрос #17\nДля перевозки людей на мотоцикле водитель должен иметь водительское удостоверение на право управления транспортными средствами:\n" +
            "1. " +
            "Категории «A» или подкатегории «A1»\n" +
            "2. " +
            "Любой категории или подкатегории в течение 2 и более лет\n" +
            "3. " +
            "Только категории «A» или подкатегории «A1» в течение 2 и более лет\n\n" +
            "Правильный ответ: 3\n" +
            "Перевозка людей на мотоцикле должна осуществляться водителем, имеющим водительское удостоверение на право управления " +
            "ТС категории «A» или подкатегории «A1» в течение 2 и более лет. ";
    public final String STC18 = "Вопрос #18\nПри какой неисправности разрешается эксплуатация транспортного средства?\n" +
            "1. " +
            "Не работают пробки топливных баков\n" +
            "2. " +
            "Не работает механизм регулировки положения сиденья водителя\n" +
            "3. " +
            "Не работают устройства обогрева и обдува стекол\n" +
            "4. " +
            "Не работает стеклоподъемник";
    public final String STC18Help = "Вопрос #18\nПри какой неисправности разрешается эксплуатация транспортного средства?\n" +
            "1. " +
            "Не работают пробки топливных баков\n" +
            "2. " +
            "Не работает механизм регулировки положения сиденья водителя\n" +
            "3. " +
            "Не работают устройства обогрева и обдува стекол\n" +
            "4. " +
            "Не работает стеклоподъемник\n\n" +
            "Правильный ответ: 4\n" +
            "Перечисленные в ответах неисправности, за исключением неработающего стеклоподъемника, указаны в «Перечне неисправностей». " +
            "Неработающий стеклоподъемник в данном перечне не указан";
    public final String STC19 = "Вопрос #19\nВ случае, когда правые колёса автомобиля наезжают на неукреплённую влажную обочину, рекомендуется:\n" +
            "1. " +
            "Затормозить и полностью остановиться\n" +
            "2. " +
            "Затормозить и плавно направить автомобиль на проезжую часть\n" +
            "3. " +
            "Не прибегая к торможению, плавно направить автомобиль на проезжую часть";
    public final String STC19Help = "Вопрос #19\nВ случае, когда правые колёса автомобиля наезжают на неукреплённую влажную обочину, рекомендуется:\n" +
            "1. " +
            "Затормозить и полностью остановиться\n" +
            "2. " +
            "Затормозить и плавно направить автомобиль на проезжую часть\n" +
            "3. " +
            "Не прибегая к торможению, плавно направить автомобиль на проезжую часть\n\n" +
            "Правильный ответ: 3\n" +
            "Такая ситуация опасна вследствие возникновения момента сил, стремящегося развернуть автомобиль. " +
            "Старайтесь плавно вернуть автомобиль на проезжую часть не меняя скорости.";
    public final String STC20 = "Вопрос #20\nЧто понимается под временем реакции водителя?\n" +
            "1. " +
            "Время с момента обнаружения водителем опасности до полной остановки транспортного средства\n" +
            "2. " +
            "Время с момента обнаружения водителем опасности до начала принятия мер по её избежанию\n" +
            "3. " +
            "Время, необходимое для переноса ноги с педали управления подачи топлива на педаль тормоза";
    public final String STC20Help = "Вопрос #20\nЧто понимается под временем реакции водителя?\n" +
            "1. " +
            "Время с момента обнаружения водителем опасности до полной остановки транспортного средства\n" +
            "2. " +
            "Время с момента обнаружения водителем опасности до начала принятия мер по её избежанию\n" +
            "3. " +
            "Время, необходимое для переноса ноги с педали управления подачи топлива на педаль тормоза\n\n" +
            "Правильный ответ: 2\n" +
            "Под временем реакции водителя понимается время с момента обнаружения водителем опасности до начала принятия мер по её избежанию. " +
            "Время реакции водителя - величина непостоянная. В основном зависит от возраста, самочувствия в данный момент. " +
            "Компенсировать недостаток реакции можно снижением скорости.";

}
