package main.tickets.caption;

public class ThirdTicketCaption {
    public final String TTP1 = "https://imgur.com/tGsnkoI";
    public final String TTP2 = "https://imgur.com/zp6nO90";
    public final String TTP3 = "https://imgur.com/T7BMOAP";
    public final String TTP4 = "https://imgur.com/qJF7HLr";
    public final String TTP5 = "https://imgur.com/TlrkwmO";
    public final String TTP6 = "https://imgur.com/MNSJFxt";
    public final String TTP7 = "https://i.imgur.com/UDTiiMf.png";
    public final String TTP8 = "https://imgur.com/IZEJkJy";
    public final String TTP9 = "https://imgur.com/cSKTica";
    public final String TTP10 = "https://imgur.com/2uwvehQ";
    public final String TTP11 = "https://i.imgur.com/UDTiiMf.png";
    public final String TTP12 = "https://imgur.com/Dvu6TJg";
    public final String TTP13 = "https://imgur.com/FbxX0cz";
    public final String TTP14 = "https://imgur.com/j0bG9iW";
    public final String TTP15 = "https://imgur.com/VNxjC4o";
    public final String TTP16 = "https://imgur.com/dTOIPh5";
    public final String TTP17 = "https://i.imgur.com/UDTiiMf.png";
    public final String TTP18 = "https://i.imgur.com/UDTiiMf.png";
    public final String TTP19 = "https://i.imgur.com/UDTiiMf.png";
    public final String TTP20 = "https://i.imgur.com/UDTiiMf.png";



    public final String TTC1 = "Вопрос #1\nВыезжая с грунтовой дороги на перекресток, Вы попадаете:\n" +
            "1. " +
            "На главную дорогу\n" +
            "2. " +
            "На равнозначную дорогу, поскольку отсутствуют знаки приоритета\n" +
            "3. " +
            "На равнозначную дорогу, поскольку проезжая часть имеет твердое покрытие перед перекрестком";
    public final String TTCHelp1 = "Вопрос #1\nВыезжая с грунтовой дороги на перекресток, Вы попадаете:\n" +
            "1. " +
            "На главную дорогу\n" +
            "2. " +
            "На равнозначную дорогу, поскольку отсутствуют знаки приоритета\n" +
            "3. " +
            "На равнозначную дорогу, поскольку проезжая часть имеет твердое покрытие перед перекрестком\n\n" +
            "Правильный ответ: 1\n" +
            "Главной является дорога с покрытием по отношению к грунтовой. Перекрёсток неравнозначный. " +
            "Вы находитесь на второстепенной дороге, выезжать будете на главную. (Пункт 1.2 термин «Главная дорога»)";
    public final String TTC2 = "Вопрос #2\nГде Вы должны остановиться?\n" +
            "1. " +
            "Перед знаком (А)\n" +
            "2. " +
            "Перед перекрестком (Б)\n" +
            "3. " +
            "Перед краем пересекаемой проезжей части (В)";
    public final String TTCHelp2 = "Вопрос #2\nГде Вы должны остановиться?\n" +
            "1. " +
            "Перед знаком (А)\n" +
            "2. " +
            "Перед перекрестком (Б)\n" +
            "3. " +
            "Перед краем пересекаемой проезжей части (В)\n\n" +
            "Правильный ответ: 3\n" +
            "В случае установки знака 2.5 «Движение без остановки запрещено» непосредственно перед пересечением проезжих " +
            "частей водитель обязан остановиться у стоп-линии. При её отсутствии (как в данном случае) водитель обязан " +
            "остановиться перед границей проезжих частей, т.е. не заезжая за линию «В». Имейте в виду, что такие места " +
            "опасны, часто находятся «под особым контролем» инспекторов ГИБДД. Поэтому всегда выполняйте главное " +
            "условие - обязательную остановку.";
    public final String TTC3 = "Вопрос #3\nВам необходимо двигаться со скоростью не более 40 км/ч:\n" +
            "1. " +
            "Только во время дождя\n" +
            "2. " +
            "Во время выпадения осадков (дождя, града, снега)\n" +
            "3. " +
            "Во всех случаях, когда покрытие проезжей части влажное";
    public final String TTCHelp3 = "Вопрос #3\nВам необходимо двигаться со скоростью не более 40 км/ч:\n" +
            "1. " +
            "Только во время дождя\n" +
            "2. " +
            "Во время выпадения осадков (дождя, града, снега)\n" +
            "3. " +
            "Во всех случаях, когда покрытие проезжей части влажное\n\n" +
            "Правильный ответ: 3\n" +
            "Табличка 8.16 «Влажное покрытие» указывает, " +
            "что действие знака распространяется на период времени, когда покрытие проезжей части влажное. («Дорожные знаки»)";
    public final String TTC4 = "Вопрос #4\nКакой из указанных знаков устанавливается в начале дороги с односторонним движением?\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "Только Б\n" +
            "3. " +
            "Б или Г\n" +
            "4. " +
            "Б или В";
    public final String TTCHelp4 = "Вопрос #4\nКакой из указанных знаков устанавливается в начале дороги с односторонним движением?\n" +
            "1. " +
            "Только А\n" +
            "2. " +
            "Только Б\n" +
            "3. " +
            "Б или Г\n" +
            "4. " +
            "Б или В\n\n" +
            "Правильный ответ: 2\n" +
            "Знак «Б» - 5.5 «Дорога с односторонним движением». («Дорожные знаки»)";
    public final String TTC5 = "Вопрос #5\nМожно ли Вам остановиться в этом месте для посадки или высадки пассажиров?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно, если при этом не будут созданы помехи движению маршрутных транспортных средств\n" +
            "3. " +
            "Нельзя";
    public final String TTCHelp5 = "Вопрос #5\nМожно ли Вам остановиться в этом месте для посадки или высадки пассажиров?\n" +
            "1. " +
            "Можно\n" +
            "2. " +
            "Можно, если при этом не будут созданы помехи движению маршрутных транспортных средств\n" +
            "3. " +
            "Нельзя\n\n" +
            "Правильный ответ: 2\n" +
            "В данном случае место остановки маршрутных транспортных средств обозначено соответствующим знаком и жёлтой" +
            " зигзагообразной разметкой 1.17. Остановка в указанном месте допускается, если Вы произведёте ее для " +
            "посадки или высадки пассажиров и в это время не создадите помех движению маршрутных транспортных средств.";
    public final String TTC6 = "Вопрос #6\nПри повороте направо Вы:\n" +
            "1. " +
            "Имеете право проехать перекресток первым\n" +
            "2. " +
            "Должны уступить дорогу только пешеходам\n" +
            "3. " +
            "Должны уступить дорогу автомобилю с включенными проблесковым маячком и специальным " +
            "звуковым сигналом, а также пешеходам";
    public final String TTCHelp6 = "Вопрос #6\nПри повороте направо Вы:\n" +
            "1. " +
            "Имеете право проехать перекресток первым\n" +
            "2. " +
            "Должны уступить дорогу только пешеходам\n" +
            "3. " +
            "Должны уступить дорогу автомобилю с включенными проблесковым маячком и специальным звуковым сигналом, а также пешеходам\n\n" +
            "Правильный ответ: 3\n" +
            "Перекресток регулируемый. «Оперативник» с включенным проблесковым маячком и специальным звуковым сигналом" +
            " может отступать от ряда требований Правил. В данной ситуации все водители должны обеспечить ему " +
            "беспрепятственный проезд перекрестка. После его проезда, поворачивая направо Вы уступаете также и пешеходам. " +
            "(Пункты 3.2, 13.1 ПДД)";
    public final String TTC7 = "Вопрос #7\nВ каких случаях водитель не должен подавать сигнал указателями поворота?\n" +
            "1. " +
            "Только при отсутствии на дороге других участников движения\n" +
            "2. " +
            "Только если сигнал может ввести в заблуждение других участников движения\n" +
            "3. " +
            "В обоих перечисленных случаях";
    public final String TTCHelp7 = "Вопрос #7\nВ каких случаях водитель не должен подавать сигнал указателями поворота?\n" +
            "1. " +
            "Только при отсутствии на дороге других участников движения\n" +
            "2. " +
            "Только если сигнал может ввести в заблуждение других участников движения\n" +
            "3. " +
            "В обоих перечисленных случаях\n\n" +
            "Правильный ответ: 2\n" +
            "Подача сигнала указателями поворота должна производиться заблаговременно до начала выполнения маневра" +
            " и прекращаться немедленно после его завершения. При этом сигнал не должен вводить в заблуждение других " +
            "участников движения. (Пункт 8.2 ПДД)";
    public final String TTC8 = "Вопрос #8\nВам разрешено выполнить поворот направо:\n" +
            "1. " +
            "Только по траектории А\n" +
            "2. " +
            "Только по траектории Б\n" +
            "3. " +
            "По любой траектории из указанных";
    public final String TTCHelp8 = "Вопрос #8\nВам разрешено выполнить поворот направо:\n" +
            "1. " +
            "Только по траектории А\n" +
            "2. " +
            "Только по траектории Б\n" +
            "3. " +
            "По любой траектории из указанных\n\n" +
            "Правильный ответ: 1\n" +
            "При повороте направо транспортное средство должно двигаться по возможности ближе к правому краю проезжей " +
            "части. У Вас такая возможность есть, продолжаете движение по траектории «А». (Пункт 8.6 ПДД)";
    public final String TTC9 = "Вопрос #9\nРазрешается ли Вам выполнить разворот на перекрестке по указанной траектории?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается, если видимость дороги не менее 100 м\n" +
            "3. " +
            "Запрещается";
    public final String TTCHelp9 = "Вопрос #9\nРазрешается ли Вам выполнить разворот на перекрестке по указанной траектории?\n" +
            "1. " +
            "Разрешается\n" +
            "2. " +
            "Разрешается, если видимость дороги не менее 100 м\n" +
            "3. " +
            "Запрещается\n\n" +
            "Правильный ответ: 3\n" +
            "Впереди перекрёсток. Прежде, чем совершить на нём поворот или разворот, необходимо было перестроиться на " +
            "левую крайнюю полосу. Вы этого своевременно не сделали. Разворот по данной траектории является нарушением." +
            " (Пункты 8.5, 8.8 ПДД)";
    public final String TTC10 = "Вопрос #10\nПо какой полосе Вы имеете право двигаться с максимальной разрешенной скоростью вне населенного пункта?\n" +
            "1. " +
            "Только по правой\n" +
            "2. " +
            "Только по левой\n" +
            "3. " +
            "По любой";
    public final String TTCHelp10 = "Вопрос #10\nПо какой полосе Вы имеете право двигаться с максимальной разрешенной скоростью вне населенного пункта?\n" +
            "1. " +
            "Только по правой\n" +
            "2. " +
            "Только по левой\n" +
            "3. " +
            "По любой\n\n" +
            "Правильный ответ: 1\n" +
            "Действие происходит вне населённого пункта. В этом случае запрещается занимать левые полосы движения при" +
            " свободных правых. Вам необходимо перестроиться и продолжать движение в данной ситуации только по правой полосе. " +
            "(Пункт 9.4 ПДД)";
    public final String TTC11 = "Вопрос #11\nВ каком случае водитель может начать обгон, если такой маневр на данном участке дороги не запрещен?\n" +
            "1. " +
            "Только если полоса, предназначенная для встречного движения, свободна на достаточном для обгона расстоянии\n" +
            "2. " +
            "Только если его транспортное средство никто не обгоняет\n" +
            "3. " +
            "В случае, если выполнены оба условия";
    public final String TTCHelp11 = "Вопрос #11\nВ каком случае водитель может начать обгон, если такой маневр на данном участке дороги не запрещен?\n" +
            "1. " +
            "Только если полоса, предназначенная для встречного движения, свободна на достаточном для обгона расстоянии\n" +
            "2. " +
            "Только если его транспортное средство никто не обгоняет\n" +
            "3. " +
            "В случае, если выполнены оба условия\n\n" +
            "Правильный ответ: 3\n" +
            "Выполняя «классический» обгон, Вы должны учитывать три обязательных условия, при выполнении которых, " +
            "при обгоне не создаёте никаких помех: 1) встречному, 2) едущим позади, 3) обгоняемому. " +
            "(Пункты 11.1, 11.2 ПДД, «Техника управления автомобилем»)";
    public final String TTC12 = "Вопрос #12\nКто из водителей нарушил правила стоянки?\n" +
            "1. " +
            "Оба\n" +
            "2. " +
            "Только водитель автомобиля\n" +
            "3. " +
            "Только водитель мотоцикла\n" +
            "4. " +
            "Никто не нарушил";
    public final String TTCHelp12 = "Вопрос #12\nКто из водителей нарушил правила стоянки?\n" +
            "1. " +
            "Оба\n" +
            "2. " +
            "Только водитель автомобиля\n" +
            "3. " +
            "Только водитель мотоцикла\n" +
            "4. " +
            "Никто не нарушил\n\n" +
            "Правильный ответ: 2\n" +
            "Водитель легкового автомобиля может заезжать на прилегающий к проезжей части тротуар только в местах," +
            " обозначенных знаком 6.4 «Парковка (парковочное место)», с одной из табличек " +
            "«Способ постановки транспортного средства на стоянку». В данной ситуации таких знаков нет, соответственно" +
            " водитель - «нарушитель». Водитель мотоцикла не нарушает правила остановки и стоянки, т. к. правила запрещают" +
            " это делать в условиях, когда расстояние между сплошной линией разметки и остановившимся транспортным средством менее З м.";
    public final String TTC13 = "Вопрос #13\nПри движении прямо Вы:\n" +
            "1. " +
            "Должны остановиться перед стоп-линией\n" +
            "2. " +
            "Можете продолжить движение через перекрёсток без остановки\n" +
            "3. " +
            "Должны уступить дорогу транспортным средствам, движущимся с других направлений";
    public final String TTCHelp13 = "Вопрос #13\nПри движении прямо Вы:\n" +
            "1. " +
            "Должны остановиться перед стоп-линией\n" +
            "2. " +
            "Можете продолжить движение через перекрёсток без остановки\n" +
            "3. " +
            "Должны уступить дорогу транспортным средствам, движущимся с других направлений\n\n" +
            "Правильный ответ: 2\n" +
            "Перекрёсток регулируемый. В этом случае знаки приоритета, а в их число входит и знак 2.5 «Движение без " +
            "остановки запрещено», согласно принципу приоритетности регулирования дорожного движения, «не работают», " +
            "т.е. ими мы не руководствуемся. Горит зелёный сигнал светофора. Продолжаете движение через перекрёсток " +
            "без остановки. (Пункты 6.2, 6.15, 13.3 ПДД)";
    public final String TTC14 = "Вопрос #14\nВы намерены повернуть направо. Ваши действия?\n" +
            "1. " +
            "Проедете перекрёсток первым\n" +
            "2. " +
            "Уступите дорогу легковому автомобилю\n" +
            "3. " +
            "Уступите дорогу обоим транспортным средствам";
    public final String TTCHelp14 = "Вопрос #14\nВы намерены повернуть направо. Ваши действия?\n" +
            "1. " +
            "Проедете перекрёсток первым\n" +
            "2. " +
            "Уступите дорогу легковому автомобилю\n" +
            "3. " +
            "Уступите дорогу обоим транспортным средствам\n\n" +
            "Правильный ответ: 1\n" +
            "Перекрёсток равнозначный. Водители при определении порядка проезда перекрёстка руководствуются " +
            "«правилом правой руки», т.е. у кого помеха справа, тот и уступает дорогу. У Вас помехи справа при повороте" +
            " направо нет. Проезжаете перекресток первым. (Пункт 13.11 ПДД)";
    public final String TTC15 = "Вопрос #15\nКому Вы обязаны уступить дорогу при повороте налево?\n" +
            "1. " +
            "Трамваям А и Б\n" +
            "2. " +
            "Трамваю А и легковому автомобилю\n" +
            "3. " +
            "Только трамваю А\n" +
            "4. " +
            "Никому";
    public final String TTCHelp15 = "Вопрос #15\nКому Вы обязаны уступить дорогу при повороте налево?\n" +
            "1. " +
            "Трамваям А и Б\n" +
            "2. " +
            "Трамваю А и легковому автомобилю\n" +
            "3. " +
            "Только трамваю А\n" +
            "4. " +
            "Никому\n\n" +
            "Правильный ответ: 3\n" +
            "Перекрёсток неравнозначный. Главная дорога меняет направление. Транспортные средства, находящиеся на " +
            "главной дороге, имеют преимущество; между собой безрельсовые транспортные средства руководствуются " +
            "«правилом правой руки», уступая трамваю, имеющему преимущество в равнозначных условиях. Трамвай «А» " +
            "проезжает первым, Вы после него. Легковой автомобиль и трамвай «Б» одновременно, так как их траектории не пересекаются. ";
    public final String TTC16 = "Вопрос #16\nКто из водителей нарушил правила остановки?\n" +
            "1. " +
            "Только водитель легкового автомобиля\n" +
            "2. " +
            "Только водитель грузового автомобиля\n" +
            "3. " +
            "Оба";
    public final String TTCHelp16 = "Вопрос #16\nКто из водителей нарушил правила остановки?\n" +
            "1. " +
            "Только водитель легкового автомобиля\n" +
            "2. " +
            "Только водитель грузового автомобиля\n" +
            "3. " +
            "Оба\n\n" +
            "Правильный ответ: 3\n" +
            "На автомагистрали остановка и стоянка вне мест, специально отведённых и обозначенных соответствующими знаками," +
            " запрещена. Оба водителя нарушают правила. («Дорожные знаки», пункты 12.1, 16.1 ПДД)";
    public final String TTC17 = "Вопрос #17\nКакое оборудование должно иметь механическое транспортное средство, используемое для обучения вождению?\n" +
            "1. " +
            "Дополнительные педали привода сцепления (кроме транспортных средств с автоматической трансмиссией) и тормоза\n" +
            "2. " +
            "Зеркало заднего вида для обучающего вождению\n" +
            "3. " +
            "Опознавательные знаки «Учебное транспортное средство»\n" +
            "4. " +
            "Все перечисленное оборудование";
    public final String TTCHelp17 = "Вопрос #17\nКакое оборудование должно иметь механическое транспортное средство, используемое для обучения вождению?\n" +
            "1. " +
            "Дополнительные педали привода сцепления (кроме транспортных средств с автоматической трансмиссией) и тормоза\n" +
            "2. " +
            "Зеркало заднего вида для обучающего вождению\n" +
            "3. " +
            "Опознавательные знаки «Учебное транспортное средство»\n" +
            "4. " +
            "Все перечисленное оборудование\n\n" +
            "Правильный ответ: 4\n" +
            "Правильный ответ – все перечисленное оборудование, согласно Пункта 21.5 ПДД и Пункта 5 Основных положений по допуску";
    public final String TTC18 = "Вопрос #18\nКакие из перечисленных транспортных средств разрешается эксплуатировать без огнетушителя?\n" +
            "1. " +
            "Только мотоциклы без бокового прицепа\n" +
            "2. " +
            "Любые мотоциклы\n" +
            "3. " +
            "Все мотоциклы и легковые автомобили";
    public final String TTCHelp18 = "Вопрос #18\nКакие из перечисленных транспортных средств разрешается эксплуатировать без огнетушителя?\n" +
            "1. " +
            "Только мотоциклы без бокового прицепа\n" +
            "2. " +
            "Любые мотоциклы\n" +
            "3. " +
            "Все мотоциклы и легковые автомобили\n\n" +
            "Правильный ответ: 2\n" +
            "Перечень неисправностей не запрещает эксплуатировать без огнетушителя любые мотоциклы. («Перечень неисправностей» пункт 7.7)";
    public final String TTC19 = "Вопрос #19\nНа повороте возник занос задней оси переднеприводного автомобиля. Ваши действия?\n" +
            "1. " +
            "Уменьшите подачу топлива, рулевым колесом стабилизируете движение\n" +
            "2. " +
            "Притормозите и повернёте рулевое колесо в сторону заноса\n" +
            "3. " +
            "Слегка увеличите подачу топлива, корректируя направление движения рулевым колесом\n" +
            "4. " +
            "Значительно увеличите подачу топлива, не меняя положения рулевого колеса";
    public final String TTCHelp19 = "Вопрос #19\nНа повороте возник занос задней оси переднеприводного автомобиля. Ваши действия?\n" +
            "1. " +
            "Уменьшите подачу топлива, рулевым колесом стабилизируете движение\n" +
            "2. " +
            "Притормозите и повернёте рулевое колесо в сторону заноса\n" +
            "3. " +
            "Слегка увеличите подачу топлива, корректируя направление движения рулевым колесом\n" +
            "4. " +
            "Значительно увеличите подачу топлива, не меняя положения рулевого колеса\n\n" +
            "Правильный ответ: 3";
    public final String TTC20 = "Вопрос #20\nКакие сведения необходимо сообщить диспетчеру для вызова «Скорой медицинской помощи» при ДТП?\n" +
            "1. " +
            "Указать общеизвестные ориентиры, ближайшие к месту ДТП. Сообщить о количестве пострадавших, указать их пол и возраст\n" +
            "2. " +
            "Указать улицу и номер дома, ближайшего к месту ДТП. Сообщить, кто пострадал в ДТП (пешеход, водитель автомобиля или пассажиры), и описать травмы, которые они получили.\n" +
            "3. " +
            "Указать место ДТП (назвать улицу, номер дома и общеизвестные ориентиры, ближайшие к месту ДТП). Сообщить: " +
            "количество пострадавших, " +
            "их пол, примерный возраст, наличие у них сознания, дыхания, кровообращения, а также сильного кровотечения, " +
            "переломов и других травм. Дождаться сообщения диспетчера о том, что вызов принят.";
    public final String TTCHelp20 = "Вопрос #20\nКакие сведения необходимо сообщить диспетчеру для вызова «Скорой медицинской помощи» при ДТП?\n" +
            "1. " +
            "Указать общеизвестные ориентиры, ближайшие к месту ДТП. Сообщить о количестве пострадавших, указать их пол и возраст\n" +
            "2. " +
            "Указать улицу и номер дома, ближайшего к месту ДТП. Сообщить, кто пострадал в ДТП (пешеход, водитель автомобиля или пассажиры), и описать травмы, которые они получили.\n" +
            "3. " +
            "Указать место ДТП (назвать улицу, номер дома и общеизвестные ориентиры, ближайшие к месту ДТП). Сообщить: " +
            "количество пострадавших, " +
            "их пол, примерный возраст, наличие у них сознания, дыхания, кровообращения, а также сильного кровотечения, " +
            "переломов и других травм. Дождаться сообщения диспетчера о том, что вызов принят.\n\n" +
            "Правильный ответ: 3";
}
